{"title":"The Laura Ingraham Podcast May 9, 2016","uid":14572890,"size":33974980,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:017b6fd9636461fa4c09188d2949c77da9de8da8&amp;dn=The+Laura+Ingraham+Podcast+May+9%2C+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1462822189,"description":"Laura Ingraham may 9 , 2016 The Laura Ingraham Podcast \r\nMP3\r\n\r\nByron York: What does Paul Ryan want from Donald Trump? Paul Nehlen: 'Ryan's Elitism is Showing, His Disdain &amp; Disrespect for the American People Is Unbelievable' \r\n\r\nGuest Lineup :\r\n\r\nByron York - Chief Political Correspondent, Washington Examiner\r\nBo Copely - Unemployed West Virginia Coal Miner who Confronted Hillary Clinton\r\nPaul Nehlen - Paul Ryan's challenger; Senior VP Operations at Neptune Benson\r\nDr. Meg Meeker - LifeZette Contributor; Pediatrician, mother, and author of six bestselling books\r\n\r\n100,000 New Illegal Minors:\r\n\r\n\r\nTalk about bad timing. In an election year rife with anti-immigrant sentiment, U.S. Customs and Border Patrol statistics show that apprehensions of unaccompanied minors from Central America have spiked to levels near those in the first six months of fiscal year 2014, when the issue became a political football and a source of hysteria for some Americans.\r\n\r\n\r\nByron York: \r\nWhat does Paul Ryan want from Donald Trump?\r\n\r\n\r\nIt's Clinton's Case to Make on Global Engagement :\r\n\r\nIllegal immigrant households get $5,692 in welfare..$1,261 MORE than American families:\r\n\r\nIllegal immigrant households receive an average of $5,692 in federal welfare benefits every year, far more than the average &quot;native&quot; American household, at $4,431, according to a new report on the cost of immigration released Monday.\r\n\r\nBy questioning the fundamentals of America's global role, Donald Trump has given Hillary Clinton a chance to lift her game -- by explaining why continued international engagement is in America's interest and the world's.\r\n\r\nKerry Attacks Trump's Wall Proposal, Tells Northeastern Univ Grads to Prepare for 'Borderless World':\r\n\r\nOn Friday, Secretary of State John Kerry took a shot at likely presumptive GOP presidential nominee Donald Trump, particularly for his proposed border wall, during his commencement address at Northeastern University in Boston.\r\n\r\n\r\n\r\nThousands rally in Berlin against refugees: \r\n\r\nAbout 1,000 right-wing extremists have rallied outside Berlin's main train station, protesting against Chancellor Angela Merkel's welcoming stance to refugees.\r\n\r\n\r\nPaul Nehlen:\r\n\r\n 'Ryan's Elitism is Showing, His Disdain &amp; Disrespect for the American People Is Unbelievable'\r\n\r\nCalling Trump Hateful Won't Be Enough for Dems:\r\n\r\nDonald Trump became the presumptive Republican presidential nominee Tuesday night, turning his sights on Hillary Clinton, who, he says, will be easy to beat. She will not be - at least not for him. But Democrats must avoid making a similar mistake, dismissing Trump based on his historically high negative poll numbers without understanding why people are voting for him.\r\n \nhttp://www.lauraingraham.com/","torrent":{"xt":"urn:btih:017b6fd9636461fa4c09188d2949c77da9de8da8","amp;dn":"The+Laura+Ingraham+Podcast+May+9%2C+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"017b6fd9636461fa4c09188d2949c77da9de8da8","infoHashBuffer":{"type":"Buffer","data":[1,123,111,217,99,100,97,250,76,9,24,141,41,73,199,125,169,222,141,168]},"announce":[],"urlList":[]}}