{"title":"Xev Bellringer Home Wrecking Secretary Wants Her Job Back 1080p","uid":13537855,"size":764252833,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:0316243b3e27e81d316479fc9e835c405f7efe67&amp;dn=Xev+Bellringer+Home+Wrecking+Secretary+Wants+Her+Job+Back+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxsunset","files":1,"time":1455451784,"description":"Screenshots: \nhttp://imgur.su/image/MFUG\r\n\r\nI know I'm the last person you want to see on a Saturday, especially since you fired me. I'm here to convince you to keep me on as your secretary. Please show some professional courtesy and hear me out. You don't mind if I get comfortable and take my jacket off do you? Your wife isn't home, you shouldn't be so nervous about my outfit. I have a feeling that if I wore this to the office every day, you wouldn't have fired me. Yes, yes I'll get to the point, let's sit down on the couch.Wow, you're so uncomfortable being close to an attractive woman that you won't even sit next to me. Your wife must have you whipped. And you probably get nothing in return except for blue balls. There's a reason you haven't kicked me out yet...you're waiting to hear my proposition because you're desperate.\r\n\r\nAlright, I'll spell it out for you: if you let me keep my job, I'll be your personal little office slut. That's right, I know you can't resist despite your marital programming. She's taken your masculinity away and you're willing to do anything to get it back. Don't worry, I won't destroy your marriage...but you will stay drained as long as I'm employed.\r\n\r\nI even invested in a pair of glasses; I know you have a fetish for women wearing them...I could wear these at the office all the time, you know. You want to see if I'm worth it? Well then sit back - show me that you're still a man","torrent":{"xt":"urn:btih:0316243b3e27e81d316479fc9e835c405f7efe67","amp;dn":"Xev+Bellringer+Home+Wrecking+Secretary+Wants+Her+Job+Back+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0316243b3e27e81d316479fc9e835c405f7efe67","infoHashBuffer":{"type":"Buffer","data":[3,22,36,59,62,39,232,29,49,100,121,252,158,131,92,64,95,126,254,103]},"announce":[],"urlList":[]}}