{"title":"Greater Tuna (1994) DVD-RIP 720.mp4","uid":13511151,"size":367769367,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:06aceb8e4bcb4910817258071f37ffcdf11dc160&amp;dn=Greater+Tuna+%281994%29+DVD-RIP+720.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ChasVA","files":1,"time":1455285495,"description":"Greater Tuna \r\n\r\nWritten by Jaston Williams, Joe Sears, and Ed Howard \r\n\r\nDirected by Ed Howard \r\n\r\nStarring original New York cast: Joe Sears and Jaston Williams \r\n\r\nFilmed before a live audience at the Will Rogers Memorial Auditorium in Fort Worth, Texas \r\n\r\nFrom the DVD cover: \r\n\r\nWelcome to GREATER TUNA, the tall Texas tale of a hilarious day in Tuna, the third smallest town in the Lone Star State where the Lion's Club is too liberal and Patsy Cline never dies. A boisterous comedy starring master comedians Joe Sears and Jaston Williams (helped by more than 40 lightning quick costume changes) who portray all 20 characters: men, women, children and animals. The show ushers us through a day in Tuna, starting with the morning broadcast from radio station OKKK and wandering in and out of the homes and Jaston Williams as Vera Carp &amp; businesses of the denizens of this colorful community. \r\n\r\nEver vigilant Vera Carp leads The Smut Snatchers of the New Order in their campaign to clear the library shelves of dirty books like &quot;Huckleberry Finn&quot; and &quot;Romeo and Juliet&quot; while the annual high school essay contest produces entries entitled &quot;Human Rights — Why Bother?&quot; and &quot;Living With Radiation.&quot; Elmer Watkins speaks up for the KKK and Petey Fisk argues for animal rights. UFO sightings, a celebrity murder and Didi's used weapons sale all contribute to the hilarity. GREATER TUNA is a funny, loving portrait of rural America... big hearts, small minds and all","torrent":{"xt":"urn:btih:06aceb8e4bcb4910817258071f37ffcdf11dc160","amp;dn":"Greater+Tuna+%281994%29+DVD-RIP+720.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06aceb8e4bcb4910817258071f37ffcdf11dc160","infoHashBuffer":{"type":"Buffer","data":[6,172,235,142,75,203,73,16,129,114,88,7,31,55,255,205,241,29,193,96]},"announce":[],"urlList":[]}}