{"title":"O regresso dublado 720p lançamento 2016","uid":13502689,"size":1515431936,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:070ebc4939d0d2a11076f2c4298be4c37195d7d2&amp;dn=O+regresso+dublado+720p+lan%26ccedil%3Bamento+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":12,"uploader":"Bahia007","files":1,"time":1455219888,"description":"(O Regresso é um filme norte-americano de 2015 realizado por Alejandro González Iñárritu, escrito por Mark L. Smith e Iñárritu baseados no romance homónimo escrito por Michael Punke, que por sua vez foi inspirado pela história real de Hugh Glass. O filme é estrelado por Leonardo DiCaprio, Tom Hardy, Domhnall Gleeson e Will Poulter.\r\n\r\nO desenvolvimento começou em agosto de 2001 quando Akiva Goldsman comprou os direitos do manuscrito de Punke com o objetivo de produzir o filme. The Revenant originalmente seria dirigido por Park Chan-wook com a intenção de ter Samuel L. Jackson como protagonista, e posteriormente John Hillcoat e Christian Bale em negociações para estrelar. Ambos os diretores deixaram o projeto e Iñárritu assinou para dirigir em 2011. Após vários adiamentos na produção por causa de outros projetos, as filmagens começaram em outubro de 2014 e terminaram em agosto do ano seguinte.\r\n\r\nO filme ganhou em três importantes categorias do Globo de Ouro de 2016: melhor filme de drama, melhor ator de drama (Leonardo DiCaprio) e melhor diretor (Alejandro González Iñárritú) e foi indicado a 12 Oscars, incluindo melhor filme, melhor diretor (Alejandro González Iñárritú), melhor ator (Leonardo DiCaprio) e melhor ator coadjuvante (Tom Hardy)","torrent":{"xt":"urn:btih:070ebc4939d0d2a11076f2c4298be4c37195d7d2","amp;dn":"O+regresso+dublado+720p+lan%26ccedil%3Bamento+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"070ebc4939d0d2a11076f2c4298be4c37195d7d2","infoHashBuffer":{"type":"Buffer","data":[7,14,188,73,57,208,210,161,16,118,242,196,41,139,228,195,113,149,215,210]},"announce":[],"urlList":[]}}