{"title":"Chemorheology of Polymers","uid":14531496,"size":4607073,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:082735115be7880cd18ea5ad8029be986909b5af&amp;dn=Chemorheology+of+Polymers&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1462447977,"description":"Chemorheology of Polymers - P. J. Halley and G. A. George (CUP, 2009).pdf\r\n\r\nISBN 978-0-521-80719-7\r\n\r\nUnderstanding the dynamics of reactive polymer processes allows scientists to create new, high value, high performance polymers. Chemorheology of Polymers provides an indispensable resource for researchers and practitioners working in this area, describing theoretical and industrial approaches to characterising the flow and gelation of reactive polymers. Beginning with an in-depth treatment of the chemistry and physics of thermoplastics, thermoset and reactive polymers, the core of the book focuses on fundamental characterization of reactive polymers, rheological (flow characterization) techniques and the kinetic and chemorheological models of these systems. Uniquely, the coverage extends to a complete review of the practical industrial processes used for these polymers and an insight into the current chemorheological models and tools used to describe and control each process. This book will appeal to polymer scientists working on reactive polymers within materials science, chemistry and chemical engineering departments as well as polymer process engineers in industry","torrent":{"xt":"urn:btih:082735115be7880cd18ea5ad8029be986909b5af","amp;dn":"Chemorheology+of+Polymers","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"082735115be7880cd18ea5ad8029be986909b5af","infoHashBuffer":{"type":"Buffer","data":[8,39,53,17,91,231,136,12,209,142,165,173,128,41,190,152,105,9,181,175]},"announce":[],"urlList":[]}}