{"title":"FAIL SAFE 2000.DVDrip.by_Galmuchet","uid":14337357,"size":1074724105,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0889b5d2100e48a63fb1fde735737098d9264213&amp;dn=FAIL+SAFE+2000.DVDrip.by_Galmuchet&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"yousef86","files":4,"time":1460726843,"description":"FAIL SAFE [Point Limite] 2000\r\nDVDrip | MKV H264-1330 |    | 720x412 | 2 Audio Tracks: English_1 French_2 | Subs: English, French, Dutch, Italian, Spanish, Arabic, Portuguese, German, Romanian, Bulgarian (emb.) | DVD Cover | 1h24 | 1.0 Gb\r\nDrama, Thriller | USA 09 April 2000 | Director Stephen FREARS\r\n\r\n\r\nEnglish:\r\nThe time is the early-to-mid-1960s, the height of the Cold War between the United States and the Soviet Union. An unknown aircraft approaches North America from Europe. American bombers of the Strategic Air Command (SAC) are scrambled to their fail safe points near Russia. The bombers have orders not to proceed past their fail safe points without receiving a special attack code. The original &quot;threat&quot; is proven to be innocuous and recall orders are issued. However, due to a technical failure, the attack code is transmitted to Group Six, which consists of six Vindicator supersonic bombers and four escort fighters. Colonel Grady, the head of the group, tries to contact Omaha to verify the fail-safe order (called Positive Check), but due to Soviet radar jamming, Grady cannot hear Omaha. Concluding that the attack order and the radar jamming could only mean nuclear war, Grady commands Group Six towards Moscow, their intended destination…\r\n\r\nFrançais:\r\nEn pleine guerre froide, un dysfonctionnement d'un ordinateur du ministère de la défense déclenche la transmission des codes d'attaque nucléaire à un bombardier américain. La cible : Moscou. Les ordres sont irréversibles. En effet, chaque bombardier a un point limite déterminé. Une fois ce point limité dépassé, les pilotes ont pour ordre de ne plus répondre aux ordres verbaux. Le président des Etats Unis, ses conseillers et ses chefs militaires font une course contre la montre pour éviter la catastrophe…","torrent":{"xt":"urn:btih:0889b5d2100e48a63fb1fde735737098d9264213","amp;dn":"FAIL+SAFE+2000.DVDrip.by_Galmuchet","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0889b5d2100e48a63fb1fde735737098d9264213","infoHashBuffer":{"type":"Buffer","data":[8,137,181,210,16,14,72,166,63,177,253,231,53,115,112,152,217,38,66,19]},"announce":[],"urlList":[]}}