{"title":"Craters for Peace 2016 DOCU WebRip 720p","uid":14158676,"size":1246846022,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:093f9e8adc47f4f0141da3cbc546a0f859bae2d1&amp;dn=Craters+for+Peace+2016+DOCU+WebRip+720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"crisisofcivilization","files":2,"time":1459692387,"description":"Craters for Peace\r\nHow the military industrial complexe survived disarmament\r\n\r\n\r\nIn 1959, the Soviet leader Nikita Khrushchev called at the United Nations for an end of the arms race and for an end of nuclear testing. The atmosphere was poisoned by radioactive particles. And he offered a peace treaty for a united and neutral Germany. These proposals should be discussed and concluded at a summit conference in May 1960 in Paris by the victorious Allies of War World II. The US government and the &quot;military-industrial complex&quot; were against this offer. An end of the Cold War would have shaken their supremacy. How did they manage to bring about the failure the summit? There is an official version, and a story that is told the first time in this documentary.\r\n\r\nAccording to official history, the Summit in Paris failed because of Krushchev´s anger. Related to the U-2-incident, that spy plane of the CIA. According to the official history, the Soviets alone are responsible for the division of Germany. The official history denies the existence of nuclear tests in Patagonia, invents an „heroic kidnapping“ of a Nazi War Criminal by Israeli agents and describes the earthquake in Chile as a natural event.\r\n\r\nA true &quot;intelligence fabric&quot; had been built around the Summit conference by the CIA and the Pentagon, consisting of several provocations:  Shortly before the summit, a U-2 spy plane violated Russian airspace - at an altitude that made it impossible for the Soviet air defense not to detect it. While Eisenhower was staying at the disarmament summit, his generals arrived in Argentina with four aircraft carriers - full of nuclear explosives. They wanted to conduct nuclear tests, said the newspaper. These tests however were at that time prohibited by the US-Soviet moratorium and by the US Atomic Energy Law. During the summit, the CIA took Russian hostages.\r\n\r\nBut the US nuclear tests in Argentina ended in catastrophe. Thousands of people died. They had to cover up everything. But in the archives of the US, Germany, Argentina and even the Catholic Cathedral are still documents that show what really happened..\r\n\r\nThis documentary was produced without any financing. If you appreciate and support independant investigation, please donate: http://www.gabyweber.com/werke_krater.php","torrent":{"xt":"urn:btih:093f9e8adc47f4f0141da3cbc546a0f859bae2d1","amp;dn":"Craters+for+Peace+2016+DOCU+WebRip+720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"093f9e8adc47f4f0141da3cbc546a0f859bae2d1","infoHashBuffer":{"type":"Buffer","data":[9,63,158,138,220,71,244,240,20,29,163,203,197,70,160,248,89,186,226,209]},"announce":[],"urlList":[]}}