{"title":"The Bible and the Coming Age Pt2","uid":14529932,"size":7171051243,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0be5f40ea8580d83a36ff66a74a59d2c2617fd3e&amp;dn=The+Bible+and+the+Coming+Age+Pt2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":88,"time":1462425767,"description":"The Bible and the Coming Age Pt2\r\n\r\n\r\nDescription\r\nDARPA Cyborgs and Adv tech (part 2):\r\nThis is a special folder of various short video clips dealing with many of the latest DARPA special projects that have already hit or soon to enter the application implementation phase. From military robots to invisibility clokes, this is your chance to clearly see the progress of future tech and advanced weapon systems that most still believe is fantasy.\r\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nPeople Vanishing in Clusters:\r\nWhat is happening to all these people and why doesn't this receive the proper media attention for this growing epidemic? Most have never heard of this before, well now is your chance. WHat is the government hiding from us and what is their agenda?\r\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nThe Seven New Signs of the Apocalypse:\r\nIn this updated documentary of the original &quot;Seven Signs of the Apocalypse&quot;, the world seems beset by more catastrophes than ever and some believe the signs of the coming apocalypse are all around us. &quot;The Seven Signs are clear: We will be struck by deadly plagues, famines and earthquakes; The sky will turn dark and oceans will turn to blood; And the Antichrist will emerge to fight the final battle between good and evil. Could this all be true?&quot;\r\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nBetrayed With A Kiss by Eric Ludy:\r\nThis message pulls no punches. It speaks straightforwardly on a topic that most of us would rather avoid — that which is wolves in sheep's clothing in the modern church. There are wolves in the sheep pen of modern Christianity undermining the timeless, eternal truths of Scripture and thus altering the nature and the pattern of the Gospel. But these wolves don't look like wolves; they are wearing very convincing sheep costumes. They appear to be humble and wise men, with spectacles roosted on the ends of their noses. They appear to be cordial men, kind and thoughtful. It's their fruit that exposes them. For they have one singular question that they are asking the body of Christ today: &quot;Did God really say that? Are you certain? Could it be that you have it wrong?&quot; They are proffering the notion of an &quot;open mind&quot;—a mind more tolerant to new religious thought—a mind hospitable to ideas outside the pale of the Biblical framework. 6,000 years ago this was the tactic of the serpent in the garden, and it's still the serpent's primary tactic today.\r\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nHELL FIRE: The Most Powerful Sermon Ever!!!\r\nSermon preached by Pastor Charles Lawson, Temple Baptist Church, Knoxville, Tennessee. He presents the Sermon on the Mount (from Matthew 5) the way it was intended to be preached, which liberals often twist for their own self-righteousness.\r\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nLukewarm by Dr. John R. Rice:\r\nTHE CHURCH THAT MAKES OUR LORD SICK. \r\n1. Let me start out by saying that is far better to be ice-cold than lukewarm because at least a cold man realizes that he needs to warm up.\r\n2. Lukewarm church members are an embarrassment and a disgrace to the cause of Jesus Christ. The great Baptist preacher Vance Havner said, &quot;Nobody ever saw a lukewarm church with power. Anything is better than a tasteless tepidity. The cause of Christ has been hurt more by Sunday-morning bench warmers who pretend to love Christ, who call Him Lord but do not His commands, than by all the publicans and sinners.&quot;\r\n3. Another great man of God, G. Campbell Morgan, wrote these words: &quot;Lukewarmness is the worse form of blasphemy…If there is anything abhorrent to the heart of Christ it is a tepid church…(But) this condition of being tepid is utterly repugnant to Him. No emotion, no enthusiasm, no urgency, no compassion.&quot;\r\n4. Notice that Morgan refers to churches with &quot;no emotion and no enthusiasm&quot; – this describes most churches today – either they are crawling around on the floor barking like dogs and braying like jackasses or they are as dead as a doornail – it is either wildfire or no fire. May God deliver us from these two extremes","torrent":{"xt":"urn:btih:0be5f40ea8580d83a36ff66a74a59d2c2617fd3e","amp;dn":"The+Bible+and+the+Coming+Age+Pt2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0be5f40ea8580d83a36ff66a74a59d2c2617fd3e","infoHashBuffer":{"type":"Buffer","data":[11,229,244,14,168,88,13,131,163,111,246,106,116,165,157,44,38,23,253,62]},"announce":[],"urlList":[]}}