{"title":"Marine Polysaccharides - Food Applications","uid":14547172,"size":2521012,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d7850d3f317dee47a190fd329da798172895f49&amp;dn=Marine+Polysaccharides+-+Food+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1462599325,"description":"Marine Polysaccharides - Food Applications - Vazhiyil Venugopal (CRC, 2011).pdf\r\n\r\nISBN 978-1-4398-1527-4\r\n\r\nIncreased public awareness of the importance of healthy living presents new challenges for the commercial food processing sector. The industry is always on the hunt for novel and safe additives with functional properties that can be used to impart healthy and appealing properties to foods. While the ocean is known as a conventional source of fish proteins and lipids, it is yet to be tapped as a source of polysaccharides. A clear exposition on how these resources can be developed, Marine Polysaccharides: Food Applications compiles recent data on the food applications of marine polysaccharides from such diverse sources as fishery products, seaweeds, microalgae, microorganisms, and corals.\r\n\r\nThe book begins with discussions on the isolation of polysaccharides from marine sources and their properties, particularly those important from a food technology point of view. It then focuses on the actual food applications of these compounds and concludes with a brief examination of biomedical applications. The author presents an overview of the general functional properties of polysaccharides, including their structure; their hydration, gelation, emulsification, and rheological properties; and interactions among themselves and with other food components such as proteins that are relevant to food processing. He then explores the isolation and food-related properties of various marine polysaccharides, use of these polysaccharides in food product and biopackaging, recent developments in composite films and nanotechnology, and safety and regulatory issues.\r\n\r\nWhile there are many books available on polysaccharides, few address the applications of marine polysaccharide food product development. Written from a realistic, practical point of view avoiding technical jargon, this book highlights the ocean not as a conventional source of fish protein and lipids, but as a major supplier of versatile carbohydrates that can have diverse food applications","torrent":{"xt":"urn:btih:0d7850d3f317dee47a190fd329da798172895f49","amp;dn":"Marine+Polysaccharides+-+Food+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d7850d3f317dee47a190fd329da798172895f49","infoHashBuffer":{"type":"Buffer","data":[13,120,80,211,243,23,222,228,122,25,15,211,41,218,121,129,114,137,95,73]},"announce":[],"urlList":[]}}