{"title":"Real Racing 3 v4.2.0 mega mods","uid":14218134,"size":109632360,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:0e21d906344d2a5bdaac4f221bc4dcd7e0c87265&amp;dn=Real+Racing+3+v4.2.0+mega+mods&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1460010734,"description":"Real Racing 3 is an award-winning franchise that sets a new standard for mobile racing games – it really must be experienced to be believed.\r\n\r\nReal Racing 3 features a continuously expanding roster of officially licensed tracks, a 22-car grid, and over 100 meticulously detailed cars from manufacturers like Ferrari, Porsche, Chevrolet, Lamborghini, Mercedes-Benz, Bugatti, and Audi. Plus Real-Time Multiplayer, Social Leaderboards, Time Trials, Ghost Challenges, and innovative Time Shifted Multiplayer™ (TSM) technology, allowing you to race anyone, anytime, anywhere.\r\n\r\nREAL CARS\r\nTake the wheel of over 100 intensely detailed vehicles from iconic manufacturers like Ford, Aston Martin, McLaren, Koenigsegg and Pagani, and test your skills on an authentic 22-car race grid – the most epic racing experience on any handheld.\r\n\r\nREAL TRACKS\r\nBurn rubber on a full lineup of 12 real tracks in multiple configurations from top worldwide locations, including Silverstone, Hockenheimring, Circuit des 24 heures du Mans, Dubai Autodrome and many more.\r\n\r\nREAL PEOPLE\r\nGet bumper to bumper with friends and rivals in global 8-player, cross-platform, real-time racing with drafting. When your friends and rivals aren’t there, drop into any race to challenge their AI-controlled versions in Time-Shifted Multiplayer™.\r\n\r\nMORE CHOICES THAN EVER\r\nCompete in over 2000 events, including Cup races, Eliminations, Endurance challenges, and Drag Races. Choose from a diverse range of upgrades to maximize your car’s performance. Customize your car with a broad variety of paints, vinyls and rims. View the action from a variety of camera angles, tweak the HUD and fine-tune the controls to your personal preference.\r\n\r\nTHE PREMIER RACING EXPERIENCE\r\nPowered by the remarkable Mint™ 3 Engine, Real Racing 3 features detailed car damage, fully functioning rear view mirrors, and dynamic reflections for truly HD racing. Enjoy a rich, next-gen game with the most advanced cross-platform social and competitive racing community ever. Real Racing 3 delivers it all and pushes the boundaries with every update.\r\n\r\nWelcome to the definitive racing experience for everyone, everywhere.\r\n\r\n200 Million Downloads – This app has received more than 100 million overall downloads.\r\n___\r\nWhat’s new:\r\nHit 0-to-186 miles per hour in less than 14 seconds as the Hennessey Venom GT comes to Real Racing 3!\r\n• Take on the all-new Front Runner event for your chance to win the Hennessey Venom GT!\r\n• Bring home both the classic 1975 BMW 3.0 CSL and the new 2015 BMW 3.0 CSL Hommage R!\r\n• Take on The Gauntlet Season 5 for your chance to win R$ and Gold!\r\n\r\nHacks: \r\nmod V1:\r\n- Infinite money\r\n- Infinite gold\r\n- Antiban\r\n\r\nmod V2:\r\n- Infinite money\r\n- Infinite gold\r\n- Unlock all cars\r\n- Unlock all Gold cars\r\n- Unlock all Tracks\r\n- Unlock all decal packs\r\n- Unlock all paints\r\n- Unlock all suspensions\r\n- Unlock all tyres\r\n- Unlock all wheel mods\r\n- Antiban \r\n\r\n**This is a resource-intensive game featuring extremely high quality visuals. Please make sure you have at least 1.5GB of free space on your device. **\r\n\r\nRequires Internet connection and Android OS 4.0.3 and up \r\nInstall APK, Place data folder in SDCard/Android/Data/  (NOT in the Obb) and play","torrent":{"xt":"urn:btih:0e21d906344d2a5bdaac4f221bc4dcd7e0c87265","amp;dn":"Real+Racing+3+v4.2.0+mega+mods","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e21d906344d2a5bdaac4f221bc4dcd7e0c87265","infoHashBuffer":{"type":"Buffer","data":[14,33,217,6,52,77,42,91,218,172,79,34,27,196,220,215,224,200,114,101]},"announce":[],"urlList":[]}}