{"title":"Rigmar Radio Karaoke Collection 50500","uid":13553000,"size":2610202208,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0e382be2b666c5250f14c38b575f61bd0aab2a84&amp;dn=Rigmar+Radio+Karaoke+Collection+50500&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rigmar_radio","files":800,"time":1455570076,"description":"Well done the last part flew out so fast I did not even get a change to super seed, some kind peer just sucked up my maximum upload speed of 7.62 megabits per second and then (Yes it get better) Passed it out to the gathering swarm at speeds well in excess of my maximum upload speed.   WAY TO GO... :)\r\n\r\nBut when I seed as SEE 10 peers gathered round myself as the primary source and only seed and between them they can not max out my upload speed....\r\n\r\nYEAH I super seed and to heck with them.  Learn to torrent is my message.  If you are a student and on Wi Fi in the halls of residence I do have some pity for you as your Ports will be blocked for sure, but what the heck go study or something.  The University does not want you breaking the law.  Please don't mess up MY SWARM until other seeds have been made and are back active.\r\n\r\nYES YOUR UPLOAD SPEED IS someones download speed when everyone is talking to each other in the Swarm.  University or other boarding school students will NOT HAVE ACCESS to the Wi Fi or Network router and can not open ports like home users.\r\n\r\nMoving through the Letter T and not long to go now before you have the whole 2015 Rigmar Karaoke collection and I can use my PC for my own stuff for a change.\r\n\r\nRigmar Radio - Attempting to educate Bit Torrent users since 2003","torrent":{"xt":"urn:btih:0e382be2b666c5250f14c38b575f61bd0aab2a84","amp;dn":"Rigmar+Radio+Karaoke+Collection+50500","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e382be2b666c5250f14c38b575f61bd0aab2a84","infoHashBuffer":{"type":"Buffer","data":[14,56,43,226,182,102,197,37,15,20,195,139,87,95,97,189,10,171,42,132]},"announce":[],"urlList":[]}}