{"title":"Acid Hype by Stephen Siff.pdf","uid":14188503,"size":3427972,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e8bf10d4be2cd3f69cc70c9f3a2ff11028db294&amp;dn=Acid+Hype+by+Stephen+Siff.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"yousef86","files":1,"time":1459866516,"description":"Acid Hype: American News Media and the Psychedelic Experience (History of Communication) by Stephen Siff\r\nEnglish | 2015 | ISBN: 025203919X, 0252080769 | 264 pages | PDF | 3,3 MB\r\n\r\n\r\nNow synonymous with Sixties counterculture, LSD actually entered the American consciousness via the mainstream. Time and Life, messengers of lumpen-American respectability, trumpeted its grand arrival in a postwar landscape scoured of alluring descriptions of drug use while outlets across the media landscape piggybacked on their coverage with stories by turns sensationalized and glowing.\r\n\r\nAcid Hype offers the untold tale of LSD's wild journey from Brylcreem and Ivory soap to incense and peppermints. As Stephen Siff shows, the early attention lavished on the drug by the news media glorified its use in treatments for mental illness but also its status as a mystical–yet legitimate–gateway to exploring the unconscious mind. Siff's history takes readers to the center of how popular media hyped psychedelic drugs in a constantly shifting legal and social environment, producing an intricate relationship between drugs and media experience that came to define contemporary pop culture. It also traces how the breathless coverage of LSD gave way to a textbook moral panic, transforming yesterday's refined seeker of truths into an acid casualty splayed out beyond the fringe of polite society","torrent":{"xt":"urn:btih:0e8bf10d4be2cd3f69cc70c9f3a2ff11028db294","amp;dn":"Acid+Hype+by+Stephen+Siff.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e8bf10d4be2cd3f69cc70c9f3a2ff11028db294","infoHashBuffer":{"type":"Buffer","data":[14,139,241,13,75,226,205,63,105,204,112,201,243,162,255,17,2,141,178,148]},"announce":[],"urlList":[]}}