{"title":"Pete Dexter-Spooner  &amp; Train","uid":14395876,"size":534640087,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0f8154bd47b92aeca9b8119b387bcf0a4f79460f&amp;dn=Pete+Dexter-Spooner++%26amp%3B+Train&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"twocows","files":145,"time":1461343217,"description":"Pete Dexter-Train\r\n\r\n\r\n\r\nTrain is a 18-year-old black caddy at an exclusive L.A. country club. He is a golf prodigy, but the year is 1953 and there is no such thing as a black golf prodigy. Nevertheless, Train draws the interest of Miller Packard, a gambler whose smiling, distracted air earned him the nickname &quot;the Mile Away Man.&quot; Packard's easy manner hides a proclivity for violence, and he remains an enigma to Train even months later when they are winning high stakes matches against hustlers throughout the country. Packard is also drawn to Norah Still, a beautiful woman scared in a hideous crime, a woman who finds Packard's tendency toward violence both alluring and frightening. In the ensuing triangular relationship kindness is never far from cruelty.\r\n\r\n\r\nPete Dexter-Spooner\r\n\r\nNational Book Award-winning author Pete Dexter excels at writing eccentric characters and comical, yet touching, prose. In Spooner, Dexter weaves the tale of Warren Spooner, a troubled boy whose father dies shortly after he's born. When his mother marries Calmer Ottosson, a decorated Navy officer fallen from grace, Warren is saved by Calmer's inexhaustible patience. As Warren grows up, the two men forge a bond that will carry them both through the hard times ahead","torrent":{"xt":"urn:btih:0f8154bd47b92aeca9b8119b387bcf0a4f79460f","amp;dn":"Pete+Dexter-Spooner++%26amp%3B+Train","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f8154bd47b92aeca9b8119b387bcf0a4f79460f","infoHashBuffer":{"type":"Buffer","data":[15,129,84,189,71,185,42,236,169,184,17,155,56,123,207,10,79,121,70,15]},"announce":[],"urlList":[]}}