{"title":"THE 1ST EVER WORLD 45 SHOOT OUT CLASH WAS A GREAT SUCCESS","uid":13576919,"size":770622464,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1124605761d9c591f73905e7e542fe91c9c0a152&amp;dn=THE+1ST+EVER+WORLD+45+SHOOT+OUT+CLASH+WAS+A+GREAT+SUCCESS&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"real36","files":4,"time":1455719524,"description":"Congratulations to the RTMRADIO.NET team for staging  a great show on the 26th of december 2015.\r\n\r\nFirst time ever World clash 45 shoot out  was  staged with 17 different DJs in 7 different countries in one night.\r\n\r\nThe event was hosted by Movie star Johnny and it captured the imagination of sound clash lovers from all over the world showing their support by making comments round by round on WWW.RTMRADIO.NET , Tunein, Twitter,and other social media platforms.\r\n\r\nThe clash was being judged by five different judges which gave each Dj a mark from 1-10 depending on how well or how poorly they played.\r\n\r\n \r\n\r\n\r\nRound 1\r\n\r\nRound one was a free style round were the Djs could play anything. Dj Reallyfe from Portmore Jamaica topped it with 41 points but controversie started when the Judges scored Dj Sandman 22 and Dj Spain 19.\r\n\r\nThe judges thought Dj Spain played better then  Dj Sandman but because of a technical problem with Dj Spain’s microphone he got a low score.\r\n\r\nRound 2\r\n\r\nRound two was the vocal round were the Djs could only play singers of songs.\r\n\r\nAfter getting through the first round by the skin of his teeth Dj Sandman starts the round and displays an awsome knowledge of vocal pressure, topping the round with 45 points.\r\n\r\nDj Reallyfe displays another strong round scoring 40 points. Jag 1 from london england, spowie dan from Montego Bay Jamiaca and Dj Rudie from Ohio America score’s 35 points or more respectively to get themselves into the next round.\r\n\r\nDj Junky from Texas usa having displayed a good first round could not repeat due to playing a dj song in the vocal round which lead him to score only 16 points getting him knocked out.\r\n\r\nDj Cheddie from French Guyana get’s knocked out of the second round due to a technicality upon receiving two yellow card’s.\r\n\r\nFirst yellow card for playing explicit music in the first round\r\n\r\nsecond yellow card for playing a non vocal song in the vocal round.\r\n\r\nRound 3\r\n\r\nRound three was a combination round were the Dj’s had to play duet song meaning two artist on the one track.\r\n\r\nThis round Dj Spowie Dan from Montego Bay score’s 42 point’s heating up the clash with great combination song’s and great clash talk.\r\n\r\nDj Reallyfe another high scoring round with 41 point’s, Jag 1 takes the round with a display of diversity playing hip-hop combination song’s and at the end sway’s the judges vote’s with a new exclusive track with Junior [one blood] Reid and local london artist Stylo G. Having played two very good steady round’s Dj Rajiv from Costa rico get’s knocked out scoring the lowest point’s at 29, but win’s a lot of respect and applaud from the listener’s and Judge’s.\r\n\r\nRound 4\r\n\r\nRound four was called Gun Man round were the Dj’s had to play song’s displaying killing a sound lyrically.  This round every Dj was well prepared,the mark’s from the judge’s were high for every individual Dj.\r\n\r\nDj Spowie tek the round with 48 points, Dj Sandman and Dj Reallyfe scored 43 and 42 respectively and Dj Rudie scored 36 leaving him short of getting into the semi final. Dj Rudie from ohio displayed his selecting skill’s and  great ability to research the appropriate song’s to play round by round.\r\n\r\nRound 5\r\n\r\nRound Five was called dead artist round were Dj’s must only play artist’s that are decease. This round is the semi final’s so two out the last four had to be eliminated\r\n\r\nDj Sandman from Sheffield England being the elder statesman this round seemed right up his street topping it with 48 points.\r\n\r\nDj Reallyfe was having one of his quiet’s rounds until he played Michael Jackson and a Christmas song from Elvis Presley to the delight of the listener’s and judge’s scoring 42 points. Dj Spowie Dan had a strong round again scoring 41 points and Jag 1 having a not so strong round  scoring 36 points this leading Dj Spowie Dan to losing out to Dj Reallyfe by 1 point.\r\n\r\nDj Genius and Danger of Jag 1 sound put up a good fight and should be proud of their effort’s.\r\n\r\nRound 6 [The Finals]\r\n\r\nRound six the Final round was another free style round were the two Djs are allowed to play any song they feel to.\r\n\r\nD j Sandman having had a poor first free style round and Dj Reallyfe having the best free style round, Dj Reallyfe was favorite to lift the trophy but to the surprise of the listeners Dj Reallyfe had a technical problem with his internet connection and could not connect. The event organiser’s gave him as much time as possible giving the host Moviestar johnny a chance to display his Dj talents playing numerous dubplates and after a long deliberation the show had to go on organisers decided to use the wild card and call back Dj Spowie Dan to take Dj Reallyfe’s place in the finals.\r\n\r\nFinals were played out with Dj Spowie Dan seemingly unprepared having not anticipated being recalled for the finals.\r\n\r\nDj Sandman scored 38 points while Dj Spowie Dan 33 points leaving Dj Sandman from Sheffield England the WINNER for the World 45 Shoot Out Clash 2015","torrent":{"xt":"urn:btih:1124605761d9c591f73905e7e542fe91c9c0a152","amp;dn":"THE+1ST+EVER+WORLD+45+SHOOT+OUT+CLASH+WAS+A+GREAT+SUCCESS","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1124605761d9c591f73905e7e542fe91c9c0a152","infoHashBuffer":{"type":"Buffer","data":[17,36,96,87,97,217,197,145,247,57,5,231,229,66,254,145,201,192,161,82]},"announce":[],"urlList":[]}}