{"title":"Under the Affluence ^ Tim Wise ^ azw3 ebook","uid":14286127,"size":626751,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11f0c1237f49251602cdc98cb8499fcbe921bde3&amp;dn=Under+the+Affluence+%5E+Tim+Wise+%5E+azw3+ebook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"heliiaruy","files":3,"time":1460406456,"description":"Under the Affluence: Shaming the Poor, Praising the Rich and Sacrificing the Future of America\r\n\r\n&quot;Tim Wise is one of the great public moralists in America today. In his bracing new book, Under the Affluence, he brilliantly engages the roots and ramifications of radical inequality in our nation, carefully detailing the heartless war against the poor and the swooning addiction to the rich that exposes the moral sickness at the heart of our culture. Wise's stirring analysis of our predicament is more than a disinterested social scientific treatise; this book is a valiant call to arms against the vicious practices that undermine the best of the American ideals we claim to cherish. Under the Affluence is vintage Tim Wise: smart, sophisticated, conscientious, and righteously indignant at the betrayal of millions of citizens upon whose backs the American Dream rests. This searing testimony for the most vulnerable in our nation is also a courageous cry for justice that we must all heed.&quot;—Michael Eric Dyson, author of The Black Presidency: Barack Obama and the Politics of Race in America\r\n\r\nTim Wise is one of America's most prolific public intellectuals. His critically acclaimed books, high-profile media interviews, and year-round speaking schedule have established him as an invaluable voice in any discussion on issues of race and multicultural democracy.\r\n\r\nIn Under the Affluence, Wise discusses a related issue: economic inequality and the demonization of those in need. He reminds us that there was a time when the hardship of fellow Americans stirred feelings of sympathy, solidarity for struggling families, and support for policies and programs meant to alleviate poverty. Today, however, mainstream discourse blames people with low income for their own situation, and the notion of an intractable &quot;culture of poverty&quot; has pushed our country in an especially ugly direction.\r\n\r\nTim Wise argues that far from any culture of poverty, it is the culture of predatory affluence that deserves the blame for America's simmering economic and social crises. He documents the increasing contempt for the nation's poor, and reveals the forces at work to create and perpetuate it. With clarity, passion and eloquence, he demonstrates how America's myth of personal entitlement based on merit is inextricably linked to pernicious racial bigotry, and he points the way to greater compassion, fairness, and economic justice.\r\n\r\nTim Wise is the author of many books, including Dear White America and Colorblind.\r\n\r\n\r\n-------\r\nazw3 can be converted in Calibre to whichever format you prefer, or can be directly placed in a Kindle file directory. Having been told I was uploading &quot;useless&quot; azw3 files, I hope you take the time to read this, learn about Calibre, or shut the fuck up. Cheers. Enjoy.\r\n\r\nheliiaruy heliiaruy heliiaruy","torrent":{"xt":"urn:btih:11f0c1237f49251602cdc98cb8499fcbe921bde3","amp;dn":"Under+the+Affluence+%5E+Tim+Wise+%5E+azw3+ebook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11f0c1237f49251602cdc98cb8499fcbe921bde3","infoHashBuffer":{"type":"Buffer","data":[17,240,193,35,127,73,37,22,2,205,201,140,184,73,159,203,233,33,189,227]},"announce":[],"urlList":[]}}