{"title":"Food Emulsifiers and Their Applications","uid":14578185,"size":6196584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1605b69eb3832807bab60182956f2c8a4e01065c&amp;dn=Food+Emulsifiers+and+Their+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1462846783,"description":"Food Emulsifiers and Their Applications - Gerard L. Hasenhuettl, Richard W. Hartel (Springer, 1997).pdf\r\n\r\nISBN 978-1-4757-2664-0\r\n\r\nFood emulsions have existed since long before people began to process foods for distribution and consumption. Milk, for example, is a natural emulsion/colloid in which a nutritional fat is stabilized by a milk-fat-globule membrane. Early processed foods were developed when people began to explore the art of cuisine. Butter and gravies were early foods used to enhance flavors and aid in cooking. By contrast, food emulsifiers have only recently been recognized for their abil ity to stabilize foods during processing and distribution. As economies of scale emerged, pressures for higher quality and extension of shelf life prodded the de velopment of food emulsifiers and their adjunct technologies. Natural emulsifiers, such as egg and milk proteins and phospholipids, were the first to be generally utilized. Development of technologies for processing oils, such as refining, bleaching, and hydrogenation, led to the design of synthetic food emulsifiers. Formulation of food emulsions has, until recently, been practiced more as an art than a science. The complexity offood systems has been the barrier to funda mental understanding. Scientists have long studied emulsions using pure water, hydrocarbon, and surfactant, but food systems, by contrast, are typically a com plex mixture of carbohydrate, lipid, protein, salts, and acid. Other surface-active ingredients, such as proteins and phospholipids, can demonstrate either syner- XV xvi Preface gistic or deleterious functionality during processing or in the finished food","torrent":{"xt":"urn:btih:1605b69eb3832807bab60182956f2c8a4e01065c","amp;dn":"Food+Emulsifiers+and+Their+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1605b69eb3832807bab60182956f2c8a4e01065c","infoHashBuffer":{"type":"Buffer","data":[22,5,182,158,179,131,40,7,186,182,1,130,149,111,44,138,78,1,6,92]},"announce":[],"urlList":[]}}