{"title":"BackCountry NavigatoO GPS v6.1.1 APK (Android)","uid":14238393,"size":17843490,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:177aa557440f76ebc4ce63f0691c29350823984e&amp;dn=BackCountry+NavigatoO+GPS+v6.1.1+APK+%28Android%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pahly","files":1,"time":1460116430,"description":"Use your phone or tablet as an offroad topo mapping GPS with the bestselling outdoor navigation app for Android! Explore beyond cell coverage for hiking, hunting and more.\r\n\r\nDownload topo maps for the US and some other countries in advance, so you won't need cell coverage when navigating.\r\n\r\nThis uses many publicly available map sources as free downloads. It also has some additional content available as an in app purchase:\r\nBoundary maps for 12 western states from the Bureau of Land Management(BLM) for $7.99. Great for hunters, hikers, and prospectors. \r\nContent from US TrailMaps for $15.99, including:\r\nSnowmobile Trail Maps for Snowmobiling enthusiasts, \r\nATV Trail Maps \r\nWhitewater Trail Maps,\r\nEquestrian Trail maps. \r\nSee these in the menu under More-&gt; &quot;Purchasing AddOns&quot;.\r\n\r\nYou are welcome to try the DEMO version to make sure you like the maps in your country.\r\n\r\nNOTE: If you've already purchased this or any paid app, you can install it at any time from 'My Apps' in the Android Market.\r\n\r\nUse offline topo maps and GPS on hiking trails without cell service! The GPS in your Android phone can get its position from GPS satellites, and you don’t have to rely on your data plan to get maps. Have more fun and safe GPS adventures in the backcountry.\r\n\r\nPreload offline topo maps, aerial photos, and road maps on your storage card, so they are ready when you need them for your GPS navigation. Many free map source are built into the app.\r\n\r\nAdd custom GPS waypoints in longitude and latitude, UTM or MGRS grid reference. Import GPS waypoints from GPX files. Choose mapsource-like icons for GPS waypoints. (This app uses the WGS84 datum, NAD27 is available in settings). \r\n\r\nUse GPS for hunting a waypoint or geocache, for recording tracks and GPS waypoints on your trip, all the while tracking your GPS quest on topographic maps.\r\n\r\nWhat's in this version : (Updated : 7 April 2016)\r\nFurther GPX Fix.\r\nHigher resolution for NSW Map\r\nFix for issue changing waypoint icons.\r\nRecord Audio files for waypoints (beta) which is why there is microphone permission.\r\nBetter matching for icons on import.\r\nTurn boundary labels on and off.\r\nAddons include Accuterra map source, GMUs of various states. SnowMobile trail maps, ATV, Equestrian, Birding, and Whitewater trail maps, and BLM Land Boundary Maps of 12 western states.\r\nRequired Android O/S : 1.6+","torrent":{"xt":"urn:btih:177aa557440f76ebc4ce63f0691c29350823984e","amp;dn":"BackCountry+NavigatoO+GPS+v6.1.1+APK+%28Android%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"177aa557440f76ebc4ce63f0691c29350823984e","infoHashBuffer":{"type":"Buffer","data":[23,122,165,87,68,15,118,235,196,206,99,240,105,28,41,53,8,35,152,78]},"announce":[],"urlList":[]}}