{"title":"Jump Jet Rex - TheDarkKnight","uid":14546179,"size":58071083,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:18cead87f73c27c39b7d45f72942cc41272f464b&amp;dn=Jump+Jet+Rex+-+TheDarkKnight&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"batknight2016","files":1,"time":1462583604,"description":"Store Page:\r\n \nhttp://store.steampowered.com/app/329460/\r\n\r\nAbout This Game:\r\n\r\nRetro Platformer Flare \r\n\r\nJumpJet Rex features beautiful hand-drawn 16-bit graphics and classic chiptune music that transfers dino lovers back to the 2-D glory days of the early 90’s. \r\n\r\nSecrets and Collectibles \r\n\r\nWith dozens of items stashed across the Galaxy, and many secret areas to discover, JumpJet Rex offers plenty to do for the treasure hunters in the house! \r\n\r\nReplayability \r\n\r\nWith a time challenge twist, players can replay every level multiple times to prove their platforming prowess. Download ghosts to race against the best players in the world, or compete directly with your friends to see who can post the best times! \r\n\r\nKiller Old School Gameplay \r\n\r\nRemember when platformers were so tough that people would hurt their hands playing, but feel amazing after getting past a level? Relive those moments with JumpJet Rex’s strenuous platforming challenges and retro boss battles. \r\n\r\nCo-op Mode \r\n\r\nSaving all of dinokind from a giant asteroid barreling down on Earth is a pretty tall task for a T-Rex with tiny arms, so players can team up with a friend to take on challenges. Teammates must coordinate efforts in order to avoid mass obliteration. \r\n\r\nCustomization and Upgrades \r\n\r\nNo two T-Rex’s are alike and fans will be able to customize their character and upgrade their appearance with the loot they collect on their travels.\r\n\r\nScreenshots:\r\n \nhttp://i.imgur.com/lhr7MUY.jpg \nhttp://i.imgur.com/0kV5HGk.jpg \nhttp://i.imgur.com/hVE7ruN.jpg \nhttp://i.imgur.com/6IqQ6PB.jpg \nhttp://i.imgur.com/bj51oef.jpg \nhttp://i.imgur.com/rLZsRL4.jpg \nhttp://i.imgur.com/EuVGIkr.jpg \nhttp://i.imgur.com/7qnNlZM.jpg\r\n\r\nAuthors Note:\r\n\r\nWhy I do this? I share because I want to give back to the community that has given to me for years. I believe torrents are a great form or advertising and promoting. When people can test games and watch movies before buying them they are more likely to support the developers / producers by buying their products.\r\n\r\nI Try to release things no one else has so when people steal my torrents without saying thanks or giving recognition it makes me want to stop. So if you want to share my stuff please ask or mention me.\r\n\r\nPlease don't hit and run show some appreciation and say thanks/seed so you motivate me to keep sharing things that no one else has. My motivation is to give to the community but if your not telling me you like it I feel i'm wasting my time. I have lots of stuff no one else has shared but i'm not going to put much time into it unless people seed and say thanks. -TheDarkKnight\r\n\r\n\r\n!!!IF YOU LIKE THIS PLEASE SUPPORT THE DEVELOPERS AND BUY IT!!!","torrent":{"xt":"urn:btih:18cead87f73c27c39b7d45f72942cc41272f464b","amp;dn":"Jump+Jet+Rex+-+TheDarkKnight","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18cead87f73c27c39b7d45f72942cc41272f464b","infoHashBuffer":{"type":"Buffer","data":[24,206,173,135,247,60,39,195,155,125,69,247,41,66,204,65,39,47,70,75]},"announce":[],"urlList":[]}}