{"title":"Murder in the name of Allah","uid":13528369,"size":17838801,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:194200d1fe0beff3963edc53e3501bba73790574&amp;dn=Murder+in+the+name+of+Allah&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"r0cxy","files":6,"time":1455403745,"description":"Murder in the Name of Allah\r\n\r\nMurder in the Name of Allah is the first translation into English of Mazhab Ke Nam Per Khoon, a re-affirmation of the basic tenets of Islam.\r\n\r\nHardly a day passes on which an Islamic event does not make headlines. The president of a Muslim country is assassinated by the supporters of Muslim brotherhood; a European journalist is taken hostage by Islamic Jihad; a Pan-American aircraft is hijacked by another Muslim group; American university professors are taken into custody by Hezbullah; Two passenger carrying airplanes were slammed in to world trade center. The glare of 'Islamic' revolution in Iran is reflected through the flares of every gulf oil refinery.\r\n\r\nThis book is a reminder that the purpose of any religion is the spread of peace, tolerance and understanding. It argues that the meaning of Islam—submission to the will of God—has been steadily corrupted by minority elements in the community. Instead of spreading peace, the religion has been abused by fanatics and made an excuse for violence and the spread of terror, both inside and outside the faith.\r\n\r\nIn confirming the true spirit of Islam, it makes the point to followers of all religions that the future of mankind depends on the intrinsic values of love, tolerance, and freedom of conscience and of belief.\r\n\r\nAbout the Author: Mirza Tahir Ahmad\r\n\r\nHazrat Mirza Tahir Ahmad was the fourth supreme spiritual head (Caliph/Khalifa) of a dynamic missionary sect, the Ahmadi Muslims, of which there are more than ten million members spread throughout the world.\r\n\r\n-----------------------------------------------------------------------------------\r\nAn Overview of The Ahmadiyya Muslim Community:\r\n\r\nThe Ahmadiyya Muslim Community is a dynamic, fast growing international revival movement within Islam. Founded in 1889, it spans over 206 countries with membership exceeding tens of millions. Its current headquarters are in the United Kingdom.\r\n\r\nAhmadiyya Muslim Community is the only Islamic organization to believe that the long-awaited Messiah has come in the person of Mirza Ghulam Ahmad(as) (1835-1908) of Qadian. Ahmad(as) claimed to be the metaphorical second coming of Jesus(as) of Nazareth and the divine guide, whose advent was foretold by the Prophet of Islam, Muhammad(sa).\r\n\r\nContact for more details:\r\n \nhttp://www.alislam.org/contactus/\r\n\r\nOfficial websites:\r\n \nhttp://www.alislam.org/ \nhttp://www.mta.tv/","torrent":{"xt":"urn:btih:194200d1fe0beff3963edc53e3501bba73790574","amp;dn":"Murder+in+the+name+of+Allah","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"194200d1fe0beff3963edc53e3501bba73790574","infoHashBuffer":{"type":"Buffer","data":[25,66,0,209,254,11,239,243,150,62,220,83,227,80,27,186,115,121,5,116]},"announce":[],"urlList":[]}}