{"title":"Dare Dorm 24 XXX (NEW) DVDRip x264-XCiTE","uid":14334466,"size":2720865448,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:19467bcb3ecc2ce8e2d9b85aad6e7859b2ff545c&amp;dn=+Dare+Dorm+24+XXX+%28NEW%29+DVDRip+x264-XCiTE+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LucasCar","files":3,"time":1460696957,"description":"Dare Dorm 24 XXX (NEW) DVDRip x264-XCiTE \r\n\r\nCategory: 18+ Teens, Amateur, College, Gonzo, Home Made Movies\r\n\r\nCast: Teens, Amateur\r\n\r\n.:Description:.\r\nJoin The Party That Never Ends! 100% Real Submitted Dorm Room Footage!Kiss Lick Sip Bang What is it with hot tubs and bubbles that make girls go crazy. That`s exactly what these college guys did to entice these ladies. Somehow they managed to get a working hot tub into their dorm room. And of course, they got three of the hottest chicks on campus. One with a glorious pair of tits, and the other two with inane booties. It didn`t take long until one of the girls really kicked it off and started blowing a guy, which meant that all the girls had to do it. Hot tub sex party anyone?Party Time This time the birthday girl got exactly what she wanted. In this latest submission of DD, a birthday bash for Rosie becomes a sex party. All her friends gave her things like a jump-drive for school, and a hot dog oven, but her boyfriend gave her what she loved most, which is cock. He didn`t intend to give her the present right in the middle of the party, but she wanted it that way. They started fucking right then and there. Rosie couldn`t ask for anything more. Actually she couldn`t ask for anything at that point because his cock was deep in her mouth. This was definitely the craziest group of college students out there.Sex Art The best college classes were always the art classes, but this group of hotties took an art project to a whole new level. They started by painting on several canvases, before painting each others boobs. Then they all got naked and painted each others hot bodies. Finally, they got rid of all the paint and began to eat each others pussies, all while a group of dudes were getting blue balls. This art project was just for girls, and even when the guys wanted to join in, the girls said no, and continued to eat vagina until they all orgasmed.\r\nTake a look at screenshots! Enjoy!\r\n \nhttp://naughtyimage.com/img-57105b26dea2e.html\r\n \nhttp://naughtyimage.com/img-57105b2b02eb5.html\r\n\r\n\r\n\r\n* * * For more stuff please visit * * *   \nhttps://thepiratebay.se/user/LucasCar/","torrent":{"xt":"urn:btih:19467bcb3ecc2ce8e2d9b85aad6e7859b2ff545c","amp;dn":"+Dare+Dorm+24+XXX+%28NEW%29+DVDRip+x264-XCiTE+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19467bcb3ecc2ce8e2d9b85aad6e7859b2ff545c","infoHashBuffer":{"type":"Buffer","data":[25,70,123,203,62,204,44,232,226,217,184,90,173,110,120,89,178,255,84,92]},"announce":[],"urlList":[]}}