{"title":"Stargate SG-1 - Season 07 - Episodes 1 thru 11","uid":14258539,"size":6490312005,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1cb022e3f47d1eb5bcd4155a3b1230d4c2fa3d85&amp;dn=Stargate+SG-1+-+Season+07+-+Episodes+1+thru+11&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":36,"time":1460224445,"description":"Stargate SG-1 - Season 07 - Episodes 1 thru 11\r\n\r\n\r\n S7, Ep1\r\n13 Jun. 2003 Fallen\r\nA group of nomads on an alien planet find Daniel Jackson naked in the middle of ruins and take him in. Jonas translates the tablet Daniel said was important and discovers that it describes the last city the Ancients were building before the plague. He surmises that the list of addresses Jack put into the computer while storing the Ancient data were Ancient outposts in temporal order. Thus the last of the addresses should be the &quot;City of the Lost&quot;. SG-1 visits the planet and happens upon the nomadic people, now inhabiting the ruins of the Ancient city. There they find ...\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n Homecoming S7, Ep2\r\n13 Jun. 2003 Homecoming\r\nAnubis's superweapon has been put out of commission, but Yu's fleet has been diverted to the other side of the galaxy by Yu himself, allowing Anubis to escape into hyperspace. Jonas has been captured by Anubis and Daniel is still aboard Anubis's ship, evading capture. Anubis uses the mind probe on Jonas, learns of Naquadria, and begins his attack on Kelowna. The Kelownans seek aid from the SGC. Jack and Sam arrive on Langara to discover that they have given Anubis Naquadria in order to secure their safety. They communicate with Daniel who is attempting to free Jonas. ...\r\n \r\n Fragile Balance S7, Ep3\r\n20 Jun. 2003 Fragile Balance\r\nA teenage boy shows up at the SGC claiming to be Jack O'Neill. He recalls a dream in which an Asgard was studying him. They determine that they must find this Asgard to fix what has been done to Jack.\r\n \r\n Orpheus S7, Ep4\r\n27 Jun. 2003 Orpheus\r\nIn a firefight with Jaffa, Teal'c takes a staff blast to the gut. Without his symbiote, he cannot regenerate as he once did. Daniel feels that he cannot remember something important, so he goes searching through the logs for any sign of his lost knowledge. Teal'c expresses his feelings that the Tritonin has made him weak.\r\n \r\n Revisions S7, Ep5\r\n11 Jul. 2003 Revisions\r\nSG-1 investigate a seemingly idyllic and subtly advanced human colony sheltered inside an energy dome on an otherwise inhospitable planet.\r\n \r\n Lifeboat S7, Ep6\r\n18 Jul. 2003 Lifeboat\r\nWhile exploring an crashed alien ship full of passengers in cryostasis, an alien force has downloaded a number of their consciousnesses into Daniel.\r\n \r\n Enemy Mine S7, Ep7\r\n25 Jul. 2003 Enemy Mine\r\nWhen a SG geological exploration mission runs into deadly conflict with an indigenous Unas clan, Daniel gets Chaka to help seek an accord with it.\r\n \r\n Space Race S7, Ep8\r\n1 Aug. 2003 Space Race\r\nIn exchange for new tech for the SGC, Warrick Finn asks for their help to win a dangerous spaceship competition.\r\n \r\n Avenger 2.0 S7, Ep9\r\n8 Aug. 2003 Avenger 2.0\r\nTo save his job, Dr. Felger tests a new virus on the Stargate Network to help control it and it ends up disabling it instead.\r\n \r\n Birthright S7, Ep10\r\n15 Aug. 2003 Birthright\r\nAfter being saved by a group of free female Jaffa, SG-1 is taken to the females' homeworld to meet their leader, Ishta. Ishta proposes an alliance between her all-female rebel group, Haktil, and the Tau'ri. The Tau'ri offer her Tritonin to supplant their practice of taking the symbiotes from defeated Jaffa in the service of the Goa'uld. However, since Tritonin has only had two test subjects, Teal'c and Bra'tac, they are cautious to spread it among their ranks.\r\n \r\n Evolution: Part 1 S7, Ep11\r\n22 Aug. 2003 Evolution: Part 1\r\nBra'tac and Teal'c encounter a heavily armed enemy with shielding protecting him from Goa'uld weaponry who took out two Goa'uld's personal guards. They barely manage to defeat him and bring him back to SGC for study, but this new threat poses a greater problem for the Tau'ri","torrent":{"xt":"urn:btih:1cb022e3f47d1eb5bcd4155a3b1230d4c2fa3d85","amp;dn":"Stargate+SG-1+-+Season+07+-+Episodes+1+thru+11","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cb022e3f47d1eb5bcd4155a3b1230d4c2fa3d85","infoHashBuffer":{"type":"Buffer","data":[28,176,34,227,244,125,30,181,188,212,21,90,59,18,48,212,194,250,61,133]},"announce":[],"urlList":[]}}