{"title":"Rush Limbaugh - May 6, 2016 Full Podcast.mp3","uid":14546160,"size":268612055,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:24ef02e07aee969e72a12faf2add335938a9b456&amp;dn=Rush+Limbaugh+-+May+6%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1462583542,"description":"Rush Limbaugh - May 6, 2016 Full Podcast\r\nMP3 be kind to others and seed please\r\n\r\n\r\nI've Never Seen Such Panic on Our Side\r\nMay 06, 2016\r\nRUSH: I'm sitting here, trying to recall if I can remember a time where there has ever been such panic. I'm drawing a blank. I do not recall a time where there's been this degree of it, and I'm gonna share examples with you today so that you know what I'm talking about. The degree of panic out there, I have not seen -- on our side, I mean -- in all the years that I have been doing this program.\r\n\r\n\r\n\r\nThe New York Times Celebrates How an Obama Aide with No Experience Helped His Boss Dupe America on the Iran Deal\r\n\r\nRUSH: It is devastating!  It's incredible that this story is running in the New York Times\r\n\r\nHow Trump Became the Hero of the Media Narrative\r\n\r\nRUSH:  Do you know what a MacGuffin is?  &quot;'In a movie or book, 'The MacGuffin' is the thing the hero wants,' Ace writes.&quot; So in the Maltese Falcon, for example, the hero wants the Maltese Falcon, but there's always somebody trying to stop the hero from getting what he wants.  There's always a villain in every book, in every movie. In every story you have the hero and what he wants, and that is the MacGuffin... Trump wanted the nomination, and all these other Republicans and their supporters didn't want Trump to have the nomination. So who became the villains? \r\n\r\nRyan Should Move to Trump\r\n\r\nRUSH: If Trump, in order to get Ryan's support, moves toward the Republican agenda, it's not good for Trump.  That would be an error. \r\n\r\nListen Now (Members Only)\t  Read Transcript\r\nVicente Fox Blasts Trump's Taco Bowl, Endorses Iron Lockbox Lady\r\nMay 06, 2016\r\nRUSH: He was so mad, he endorsed Hillary.  &quot;Passionate, compassionate, committed, intelligent leadership, that's what we need for United States, and that's what we need for the world. That's why I like Hillary Clinton. She's the Iron Lady.&quot;   Well, the testicle lockbox is made out of iron, I guess. \r\n\r\n\r\n\r\nMy Rebuttal to Obama's Economic Lies\r\n\r\n\r\nRUSH: The economy is in the tank. It's confirmed. All the April economic news is out, jobs news and everything. So what does Obama do?  Come out and spin it.  He's doing a presser or some sort of press availability now at the White House timed exactly to coincide with the beginning of this program, which he is wont to do.  Here are the numbers that you need to know... \r\n\r\n\r\nWhy It's So Hard for the Washington Establishment to Line Up Behind Trump\r\n\r\nRUSH:  I think what we're witnessing: actually things I predicted last fall.  Because this degree of panic, fright, fear, anger is so deep, it almost seems like the effect on these people is personal.  And the reason they're not lining up behind Trump is because Trump is blowing up the existing order. \r\n \nhttp://www.rushlimbaugh.com/","torrent":{"xt":"urn:btih:24ef02e07aee969e72a12faf2add335938a9b456","amp;dn":"Rush+Limbaugh+-+May+6%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24ef02e07aee969e72a12faf2add335938a9b456","infoHashBuffer":{"type":"Buffer","data":[36,239,2,224,122,238,150,158,114,161,47,175,42,221,51,89,56,169,180,86]},"announce":[],"urlList":[]}}