{"title":"Xev Bellringer - Supergirl Becomes Sex Slave [1080p]","uid":13504158,"size":2488347772,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:257113bf4aaf4cd2806a1c4ae84e93e976c25d2d&amp;dn=Xev+Bellringer+-+Supergirl+Becomes+Sex+Slave+%5B1080p%5D+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxsunset","files":1,"time":1455232423,"description":"Screenshots: \nhttp://imgur.su/image/p8sL\r\n\r\nIn the midst of a battle at a local chemical plant, Supergirl is caught-off guard when Lex Luther's evil robots suddenly release a strange, debilitating purple gas. As the gas fills her lungs, Supergirl's powers are severely weakened, and she is forced to retreat\r\n\r\nHello? Hello? Oh hi! I'm Supergirl. I'm sorry for hiding in your house, but I thought such a...cute guy could protect me until I get my strength back. I just feel so strange...it must have been something in that gas. I feel so...turned on. I can't control myself. Oh no! The gas must have contained Kryptonite mixed with Venus -Chemical! The chemical plant was a trap! Lex Luther's plan must have been to capture me and enslave me as his sex toy!\r\n\r\nOh God, I'm so hot...I need to cum...You can save me from this horrible fate! If you were the one to...if you and I, you know, before he finds me, he couldn't enslave me, right? I don't know if I'd then be enslaved to you, but I just can't let him take me! Please I'm begging you...Master.\r\n\r\nSupergirl grinds away on your lap until the need to have your mouth on her pussy overcomes her. She relishes the way your lips and tongue caress her and she cums violently on your face. Supergirl wants to offer you the same pleasure, she closes her warm mouth around your throbbing cock until you explode deep into her throat. Unsatisfied, Supergirl slips your cock inside of her hot pussy until you both orgasm again, simultaneously","torrent":{"xt":"urn:btih:257113bf4aaf4cd2806a1c4ae84e93e976c25d2d","amp;dn":"Xev+Bellringer+-+Supergirl+Becomes+Sex+Slave+%5B1080p%5D+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"257113bf4aaf4cd2806a1c4ae84e93e976c25d2d","infoHashBuffer":{"type":"Buffer","data":[37,113,19,191,74,175,76,210,128,106,28,74,232,78,147,233,118,194,93,45]},"announce":[],"urlList":[]}}