{"title":"Ordered Porous Solids - Recent Advances and Prospects","uid":14561605,"size":59561178,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2825515135543b9c12a3047bfdde1fe972dd0059&amp;dn=Ordered+Porous+Solids+-+Recent+Advances+and+Prospects&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1462743952,"description":"Ordered Porous Solids - Recent Advances and Prospects - Valentin Valtchev et al. (Elsevier, 2009).pdf\r\n\r\nISBN 978-0-444-53189-6\r\n\r\nThe developments in the area of ordered nanoporous solids have moved beyond the traditional catalytic and separation uses and given rise to a wide variety of new applications in different branches of chemistry, physics, material science, etc. The activity in this area is due to the outstanding properties of nanoporous materials that have attracted the attention of researchers from different communities. However, recent achievements in a specific field often remain out of the focus of collaborating communities. This work summarizes the latest developments and prospects in the area of ordered porous solids, including synthetic layered materials (clays), microporous zeolite-type materials, ordered mesoporous solids, metal-organic-framework compounds (MOFs), carbon, etc. All aspects, from synthesis via comprehensive characterization to the advanced applications of ordered porous materials, are presented. The chapters are written by leading experts in their respective fields with an emphasis on recent progress and the state of the art.\r\n\r\n\r\n* Summarizes the latest developments in the field of ordered nanoporous solids\r\n* Presents state-of-the-art coverage of applications related to porous solids\r\n* Incorporates 28 contributions from experts across the disciplines","torrent":{"xt":"urn:btih:2825515135543b9c12a3047bfdde1fe972dd0059","amp;dn":"Ordered+Porous+Solids+-+Recent+Advances+and+Prospects","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2825515135543b9c12a3047bfdde1fe972dd0059","infoHashBuffer":{"type":"Buffer","data":[40,37,81,81,53,84,59,156,18,163,4,123,253,222,31,233,114,221,0,89]},"announce":[],"urlList":[]}}