{"title":"John-Batchelor-Nato-Tabletop-fail-out-of-date-out-of-excuses.mp3","uid":14406507,"size":20266338,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:28811b1d27dfb798029ad82278f7e5ad7ab7940d&amp;dn=John-Batchelor-Nato-Tabletop-fail-out-of-date-out-of-excuses.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1461419919,"description":"NATO Tabletop Fail: Out of Date &amp; Out of Excuses. @jerryhendrix11 @cnasdc\r\n\r\n\r\nDespite countless efforts since the fall of the Berlin Wall to fold Russia into both Western institutions and a community of shared values, Russia’s relationship with the West has deteriorated significantly in recent years. There were warning signs – President Vladimir Putin’s fiery speech at the Munich Security Conference in 2007 and, more troubling, the Russia-Georgia conflict in 2008. But there were also occasional breakthroughs, such as the signing of the New Strategic Arms Reduction Treaty in 2010 that gave the West the impression that relations with Russia were, at least in broad terms, on a positive trajectory.\r\n\r\nThe hope behind such cooperative efforts and what they might deliver in the future faded to black in 2012 when Putin returned to his position as president, a post he earlier held from 2000 to 2008. Since 2012, Putin has rolled back democratic reforms at home, used force to illegally seize the territory of neighboring states, violated international norms and laws, and used economic coercion to advance his agenda. Across the European continent, Russia is carrying out acts of intimidation designed to divide Europe from within and divide Europe from the United States. Such acts regularly include snap exercises along neighboring borders; overflights into countries’ sovereign airspace; efforts to incite anger among Russian minorities living in Europe; aggressive disinformation campaigns; and direct support to anti-EU and anti-immigrant parties across Europe.\r\n \nhttp://www.cnas.org/sites/default/files/publications-pdf/CNASReport-BalticTTX-160331.pdf\r\n\r\nThe John Batchelor Show","torrent":{"xt":"urn:btih:28811b1d27dfb798029ad82278f7e5ad7ab7940d","amp;dn":"John-Batchelor-Nato-Tabletop-fail-out-of-date-out-of-excuses.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28811b1d27dfb798029ad82278f7e5ad7ab7940d","infoHashBuffer":{"type":"Buffer","data":[40,129,27,29,39,223,183,152,2,154,216,34,120,247,229,173,122,183,148,13]},"announce":[],"urlList":[]}}