{"title":"Meana Wolf - Home Schooled [1080]","uid":13552965,"size":823210514,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:29b4c71dfd7b635e859117bdf52f582604ad1211&amp;dn=Meana+Wolf+-+Home+Schooled+%5B1080%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxsunset","files":1,"time":1455568885,"description":"Screenshots: \nhttp://imgur.su/image/6uj3\r\n\r\nGet out of bed sweety you're going to be late for school. What's wrong? You think you're sick? You think you have a fever? Well you don't look sick to me. Come on now, what's up? You're too embarrassed to go to school? Why what happened? hahah You were kissing a girl and you jizzed in your pants? hahahah You should be emberassed, that is totally unacceptable. You should be ashamed of yourself haha Oh she told all the other girls in your class too? hah I can just imagine you walking around all day with your jizz stained pants. Well that's not going to work any more. I'm going to have to keep you home for a few days to train your cock. That's right. I'm going to train you to have some self restraint. Because no son of mine is going to be a premature ejaculator. I'm going to edge you over and over and over again until you get it right. There...feel my fingers sliding all up and over your cock. I know how much you love the feeling of mommy's hands gripping your dick...I know how badly you want to cum for mommy...but you dont get to cum until mommy says so.\r\nxoxo Meana Wolf\r\n\r\nClip Contains: Mommy humiliates you for having so little control over your cock. She decides to keep you home from school so she can teach you. She edges you over and over and over until she finally allows you to cum. But you won't be going back to school for a few days. Not until she's satisfied","torrent":{"xt":"urn:btih:29b4c71dfd7b635e859117bdf52f582604ad1211","amp;dn":"Meana+Wolf+-+Home+Schooled+%5B1080%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29b4c71dfd7b635e859117bdf52f582604ad1211","infoHashBuffer":{"type":"Buffer","data":[41,180,199,29,253,123,99,94,133,145,23,189,245,47,88,38,4,173,18,17]},"announce":[],"urlList":[]}}