{"title":"Software.Inc.Alpha.8.8.4","uid":14257122,"size":20001709,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2a2a5c5950e8a0f7727546d9cbed031b8280aeae&amp;dn=Software.Inc.Alpha.8.8.4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Andrewillemse123","files":1,"time":1460201123,"description":"Construct and design buildings for optimal working conditions. Hire people to design and release software, so you can defeat the simulated competition and take over their businesses. Manage and educate your employees to make sure they are skilled and satisfied with their job. \r\n\r\nSoftware Inc. combines tycoon gameplay with multi-story building mechanics, employee management and a simulated market. It is inspired by games like Game Dev Tycoon, Prison Architect, The Sims and Theme Hospital. \r\n\r\n\r\nBuild, furnish and maintain office buildings up to ten stories + basement, on an enormous Land \r\nHire employees to design, develop, support, research and market software in teams \r\nBuild roads and parking to ease commuting for your employees \r\nTend to your employees' needs, demands, skills and specializations, while making sure each team has compatible personalities \r\nCustomize your own employee avatar \r\nCreate your own software products and franchises \r\nCompete in a simulated or event-driven market by selling your products, taking on contract work or trading stocks \r\nHire staff to repair your furniture and computers, and clean your office \r\nMod what kind of software you can develop, what kind of companies will be simulated, game scenarios, missions, personalities and random name generators \r\nDelegate important tasks to your team leaders, such as managing development cycles and human resources \r\nSet up your own servers for products, source control and running your own online store\r\n\r\nSystem Requirements\r\nWindows Mac OS X SteamOS + Linux\r\nMINIMUM: \r\nOS: Windows 7 \r\nProcessor: 2.4 GHz Dual Core Processor \r\nMemory: 2 GB RAM \r\nGraphics: 512 MB dedicated video RAM, Shader Model 3.0 \r\nDirectX: Version 9.0c \r\nStorage: 500 MB available space \r\nAdditional Notes: Laptops with power saving graphic processors might need to be configured for Software Inc","torrent":{"xt":"urn:btih:2a2a5c5950e8a0f7727546d9cbed031b8280aeae","amp;dn":"Software.Inc.Alpha.8.8.4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a2a5c5950e8a0f7727546d9cbed031b8280aeae","infoHashBuffer":{"type":"Buffer","data":[42,42,92,89,80,232,160,247,114,117,70,217,203,237,3,27,130,128,174,174]},"announce":[],"urlList":[]}}