{"title":"Laura Ingraham Podcast May 5, 2016","uid":14535661,"size":34691989,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2a6b43d3eb47687a8c8256d557997ad661e75d44&amp;dn=Laura+Ingraham+Podcast+May+5%2C+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1462491501,"description":"Laura Ingraham Podcast May 5, 2016\r\n\r\nMP3\r\nPLEASE SEED\r\n\r\nGuest Lineup\r\nJeremy Peters - New York Times Reporter\r\nJoel Rosenberg - Founder of The Joshua Fund, NYT bestselling author\r\nDr. Sebastian Gorka - Expert on counterinsurgency and counter-terrorism and teaches irregular warfare\r\n\r\nJeremy Peters - New York Times Reporter on Cruz: &quot;Thrived the most when he played the role of insurgent disruptor&quot; \r\n\r\n\r\nThe 'Smart People,' Wrong Again: Trump's win comes after GOP refused to listen to what actual voters wanted - populist policies with conservative core\r\nLaura Ingraham - Lifezette\r\nFor most of American history, the &quot;conservatives&quot; have included those thinkers who were willing to look hard truths in the face - to realize that mankind is sinful, that the world is fallen, and that anyone who hopes to govern must face real and difficult choices. While fuzzy-headed liberals dreamed of building Utopia here on earth, conservatives recognized that sometimes there are no win-win solutions - sometimes you have to make the best of a bad lot. You can fight the South to preserve the Union - but it will result in hundreds of thousands of deaths. You can stop Hitler - but you will have to ally with Stalin to do so. You can preserve the free enterprise system - but you will have to compromise on some issues to prevent the rise of socialism.\r\n\r\n\r\nConservative chasm: Some pundits vow to fight Trump till the bitter end\r\nFrom the insular political system to the naysaying media culture, Donald Trump essentially clinching the Republican nomination is a stunning development, especially the swiftness with which his two remaining rivals gave up.\r\n\r\nHow Obama's Economy Spawned Trump\r\nWilliam A. Galston - Wall Street Journal\r\nPresident Obama's remarkable interview last week with the New York Times 's Andrew Ross Sorkin shows why historians are likely to assign Mr. Obama a share of responsibility for the rise of Donald Trump.\r\n\r\nDr. Gorka: Trump 'Wants to Be a War President Who Wins'\r\n\r\nConservative chasm: Some pundits vow to fight Trump till the bitter end\r\nFrom the insular political system to the naysaying media culture, Donald Trump essentially clinching the Republican nomination is a stunning development, especially the swiftness with which his two remaining rivals gave up.\r\n\r\n\r\nThe Presidency Is Trump's to Lose--the Sequel\r\nOver eight months ago, August 19, 2015 to be exact, I wrote the following: We're still over five months from the Iowa caucuses and -- astoundingly -- it's increasingly looking like the 2016 presidential election, not just the nomination, is Donald Trump's to lose.\r\n\r\nBuchanan to Cruz: Support Trump or No Future\r\nOn today's program, Pat Buchanan discussed the bitterness among &quot;Never-Trumpers&quot; following the suspension of Sen. Ted Cruz's (R-TX) presidential campaign. In 1992, convention, Buchanan urged his supporters to rally behind George H.W. Bush, the Republican nominee. At the time, Buchanan warned, &quot;this war is for the soul of America. And in that struggle for the soul of America, Clinton &amp; Clinton are on the other side, and George Bush is on our side.\r\n \nhttp://mediamatters.org/video/2016/05/04/laura-ingraham-ive-been-smiling-ear-ear-trump-secured-nomination/210222\r\n\r\n\r\nPlease Seed\r\n \nhttp://www.lauraingraham.com/","torrent":{"xt":"urn:btih:2a6b43d3eb47687a8c8256d557997ad661e75d44","amp;dn":"Laura+Ingraham+Podcast+May+5%2C+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a6b43d3eb47687a8c8256d557997ad661e75d44","infoHashBuffer":{"type":"Buffer","data":[42,107,67,211,235,71,104,122,140,130,86,213,87,153,122,214,97,231,93,68]},"announce":[],"urlList":[]}}