{"title":"Walloid Pro HD Wallpapers v2.3.5 APK (Android)","uid":14262551,"size":5043415,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:2b49567a0914d525574383cabce64b8399fe02be&amp;dn=Walloid+Pro+HD+Wallpapers+v2.3.5+APK+%28Android%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pahly","files":1,"time":1460248217,"description":"HD Wallpapers and QHD Wallpapers from different Stock ROMs (OEMs), Custom ROMs, and Material Design wallpapers. \r\nDaily updates of free and awesome wallpapers for all devices running Android Marshmallow, Android Lollipop, Android KitKat, Android JellyBean and Android Ice Cream Sandwich with a clean and stunning Material Design User Interface.\r\n\r\nFeatures:\r\nGoogle’s Material Design\r\nAndroid Lollipop’s simple interface and minimized designs for all the devices running Android Ice Cream Sandwich and above.\r\nSimple, Fast, Light and Smooth\r\nWalloid HD Wallpapers focuses more on wallpaper image itself, to make a greater performance.\r\nNew Wallpapers Daily Updates and notifications\r\nHD Wallpapers from new and old devices as well as from different categories daily added to our collection and get notified when they arrive on Walloid Pro HD Wallpapers App.\r\nUnlimited Favourites Wallpapers Section\r\nYou can add all your liked HD wallpapers to this section so that you can quickly set it.\r\nTag Support\r\nWallpapers categorized as by tags such as Flagship Devices of 2015, Flagship Devices of 2014, New Wallpapers, Featured Wallpapers and more.\r\nOffline Support\r\nHD Wallpapers can be downloaded and they can be used to set as wallpapers for your Home Screen even when you don’t have an internet connection.\r\nRandom Wallpaper Loader Widget with unlimited source(category) selection\r\nThe only stock wallpaper app that provides you to randomly set any HD wallpaper of your selected devices or categories for your Home Screen from a single click.\r\nMuzei Live Wallpaper App Support\r\nMuzei is a live wallpaper that gently refreshes your home screen each day with HD Wallpapers from Walloid Pro.\r\nDashboard to Quick Set, Crop and Set, Edit and start Slideshow\r\nYou can manage all the above actions on wallpapers in a fast and easy way.\r\nQuickly set HD wallpapers for your lockscreen. (Only if your device supports this feature)\r\nNo Ads\r\nGet rid of intrusive ads and experience a better app performance with Material Design.\r\nUnlimited Histories of HD Wallpapers\r\nNever loose histories of your Set Wallpapers, Random Wallpaper Loader Widget, Muzei Live Wallpaper App.\r\nMaterial App Themes\r\nFour Exclusive Material Design based App Themes for Walloid Pro HD Wallpapers supporters.\r\nFree access to future add-ons\r\nGet access to all the new features in Walloid Pro HD Wallpapers for free.\r\nWhat's in this version : (Updated : 27 March 2016)\r\nNote:\r\n- Please reinstall the application if you are experiencing frequent App Crashes.\r\n\r\nVersion 2.3.5:\r\n► [Updated] Greek, Croatian, Portuguese (Brazil) languages translations.\r\n► [Fixed] Bugs and minor crashes.\r\nRequired Android O/S : 4.0+","torrent":{"xt":"urn:btih:2b49567a0914d525574383cabce64b8399fe02be","amp;dn":"Walloid+Pro+HD+Wallpapers+v2.3.5+APK+%28Android%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b49567a0914d525574383cabce64b8399fe02be","infoHashBuffer":{"type":"Buffer","data":[43,73,86,122,9,20,213,37,87,67,131,202,188,230,75,131,153,254,2,190]},"announce":[],"urlList":[]}}