{"title":"Hydrogen Energy - Economic and Social Challenges","uid":14531217,"size":2929217,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:33023f5d36fd3763c2da815b62e5dbbeb5023da3&amp;dn=Hydrogen+Energy+-+Economic+and+Social+Challenges&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1462445578,"description":"Hydrogen Energy - Economic and Social Challenges - Paul Ekins (Earthscan, 2010).pdf\r\n\r\nISBN 978-1-84407-680-2\r\n\r\nHydrogen could be a significant fuel of the future, with the potential to make a major contribution to the resolution of pressing social and environmental problems such as carbon emissions, energy security and local air pollution. This book, based on four years of detailed research, subjects the promise and potential of hydrogen to searching, in-depth socio-economic analysis. It discusses the different technologies for the production, distribution, storage and use of hydrogen, and analyses the economics of these technologies and their current market prospects. It also describes various experiences with aspects of a hydrogen economy in two parts of the world - the UK and Canada - and then assesses the nature of different hydrogen futures that might develop depending on how the technology, economics, social acceptance and policy frameworks play out in different contexts. The book ends by setting out the policy drivers and levers which could stimulate a virtuous circle of research and development, innovation and investment that might ultimately generate a sustainable hydrogen economy. This is essential reading for economists, engineers, business leaders, investors, policy makers, researchers and students who are interested in the future of the energy system and the part that hydrogen might play in it","torrent":{"xt":"urn:btih:33023f5d36fd3763c2da815b62e5dbbeb5023da3","amp;dn":"Hydrogen+Energy+-+Economic+and+Social+Challenges","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33023f5d36fd3763c2da815b62e5dbbeb5023da3","infoHashBuffer":{"type":"Buffer","data":[51,2,63,93,54,253,55,99,194,218,129,91,98,229,219,190,181,2,61,163]},"announce":[],"urlList":[]}}