{"title":"Hogtied--HT-11960 TessaTaylor WMV MP4 Pics","uid":14161426,"size":929760272,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:36ada2ca2b482360ecbbb51dbc09b7bf1153aaf6&amp;dn=Hogtied--HT-11960+TessaTaylor+WMV+MP4+Pics&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":129,"time":1459722742,"description":"Requested by @hlw04\r\n\r\nEnjoy :D\r\n\r\nShallow2\r\n\r\n\r\n\r\nSexy all natural 20yr old with full C breasts does her first Hogtied shoot. \r\n\r\nLove the cute ones\r\n\r\nMar 29, 2011 - Performers: Tessa Taylor \r\n\r\n\r\nWMV and MP4 + Pics.\r\n\r\n\r\nWelcome Tessa Taylor to Hogtied. This super cute 20yr old has natural, full C breasts and has done bondage in her private life. She likes being the boss, but she doesn't have a choice today. \r\n\r\nTessa has done Bondage for other people, but that doesn't mean anything here. We never assume just because she did this or that for someone else that she can do it here, nor do we assume she would want to. As a professional we have the duty to slowly work with new girls and find out what she can or cannot handle. So this is the Meet and Greet, where we probe the girl's strengths and weaknesses, then base the rest of the day on the information we gathered first hand. This is the safe and correct way to proceed with someone you have never worked with before.\r\n\r\nTessa is told to put her own gag on and put it on tight. We have her strip out of some of her clothes and we have her tease us with her hot natural body. She loves this, she feels in control. We bind her hands up and stretch out her body and that feeling of control instantly vanishes. We then subject Tessa to painful bondage. The cane, nipple clamps, and weights. We flog her, we study her reactions, we learn from her, we read her. Each girl is different. Each girl is different every time you work with them. Soon we make Tessa moan, squirm, and cum. She cums hard and then is left to suffer in a brutal tie that has her calf burning, her wrist aching, as she is made to stand on her tip toes. Beautiful!\r\n\r\nScreens \nhttp://www.hogtied.com/site/shoot.jsp?shootId=11960\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:36ada2ca2b482360ecbbb51dbc09b7bf1153aaf6","amp;dn":"Hogtied--HT-11960+TessaTaylor+WMV+MP4+Pics","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36ada2ca2b482360ecbbb51dbc09b7bf1153aaf6","infoHashBuffer":{"type":"Buffer","data":[54,173,162,202,43,72,35,96,236,187,181,29,188,9,183,191,17,83,170,246]},"announce":[],"urlList":[]}}