{"title":"[ExploitedCollegeGirls] Jillian XXX 480p University of Arizona O","uid":13512615,"size":799316637,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:36e7a51a19c346ba042e78b0eb36cf7a644314a1&amp;dn=%5BExploitedCollegeGirls%5D+Jillian+XXX+480p+University+of+Arizona+O&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"roflcopter2110","files":1,"time":1455299208,"description":"Size: 799316637 bytes (762.29 MiB), duration: 00:58:21, avg.bitrate: 1826 kb/s\r\nAudio: wmav2, 44100 Hz, stereo, 96 kb/s\r\nVideo: wmv3, yuv420p, 768x432, 1714 kb/s, 29.97 fps\r\n\r\n\r\nJillian is a leggy, blonde fox who comes to ECG all the way from the University of Arizona. She's originally from Alaska though, so she's a lot more down to earth than the usual U of A sorority sister I drag in here. She's got a mane of (mostly) blonde hair, a huge white smile, sexy green eyes and she giggles at at almost everything I say and seems to punctuates her sentences with the same kind of giggle. Like when she announces that she tries to be a 'good girl' most of the time. Of course when I ask her why she's here for the shoot and she announces without hesitation, &quot;To get FUCKED!&quot; her good girl act seems a little blown. Don't worry baby, your secret is safe with me... and a few thousand of my furiously fapping friends.\r\nBefore she gets my dick, like all the college girls here to get exploited, she has to submit to me expertly (if I do say so myself) fucking her to orgasm with a sex toy. During the interview she announces that she's never used one other than her shower head and is excited at the prospect. In fact, she's more than excited, she's downright turned on, when she pulls off her white lace panties, I can actually see her wetness. When I go in to investigate, sure enough, she's moist between the thighs. That probably explains why she's able to cum 3 times in less than 15 minutes of my pounding with the purple Rabbit. She had a head start. Speaking of head...\r\nAfter the Rabbit, she's breathless and panting and after three orgasms in a row, she's down for anything. Which is why I have her get down on her knees for a little cock sucking. Jillian is a natural with my dick in her mouth but she treats it with a little too much respect, so after some gentle cock sucking I have her lay down on the bed so I can fuck the shit out of her face properly. It's definitely working, as you hear my cock slamming in and out of her mouth you can hear me fingering her perfect wet pussy at the other end.\r\nLoyal members of ECG know one thing for sure: wet pussies need to be fucked. Worry not, this one is, and hard. I don't let you guys down! I start her off on her back, legs spread wide so I can give her every inch. Watch when she's getting pounded for this priceless blissed out look on her face. Before long, however, I realize what she really needs and I flip her over and pin her down and then pound her into the bed from behind. Jackpot, you can tell as soon as she starts biting her lip and grunting that this is what she needed.\r\nOne thing that becomes apparent only later in the video is just how phat Jillian's ass is. When she climbs on top to do a little reverse cowgirl, you can actually see her round ass from the front! That's shit's priceless. After she rides me for a bit and lubes up my cock with her lips, I bend her over a chair and pound her from behind. You can see that perfect pale whooty bouncing like it's a rap video shoot. I was mesmerized by that thing and it wasn't long before I need to pop. Obviously, there's no place better than on her pretty face, so I have her lay back and I unleash on her. I aim for her mouth and everything that hits her lips she swallows, just like a good girl should... hey, maybe she wasn't lying after all","torrent":{"xt":"urn:btih:36e7a51a19c346ba042e78b0eb36cf7a644314a1","amp;dn":"%5BExploitedCollegeGirls%5D+Jillian+XXX+480p+University+of+Arizona+O","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36e7a51a19c346ba042e78b0eb36cf7a644314a1","infoHashBuffer":{"type":"Buffer","data":[54,231,165,26,25,195,70,186,4,46,120,176,235,54,207,122,100,67,20,161]},"announce":[],"urlList":[]}}