{"title":"Kimmy Granger, Sydney Cole - Grounded - 2016-02-01 [540p]","uid":13502922,"size":619673030,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:377ddec21e178a1e4e21a5d58adafd1b4719375e&amp;dn=Kimmy+Granger%2C+Sydney+Cole+-+Grounded+-+2016-02-01+%5B540p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxsunset","files":1,"time":1455223773,"description":"Screenshots: \nhttp://imgur.su/image/nDjG\r\n\r\nDamon Dice catches his stepsister Kimmy Granger and her friend Sydney Cole sneaking out even though Kimmy is grounded. When Kimmy demands to know what she can do to keep her stepbrother silent, Damon leads them both to the bed and offers to let them go if they kiss. After a few tries they do such a good job that Damon starts rubbing his cock through his clothes.\r\n\r\nThe girls keep on taking Damon's instructions as he orders Sydney's shirt off and Kimmy to suck her tits. Gradually he gets Sydney on her knees sucking his stiffie, and then orders Kimmy to follow her friend's example.\r\n\r\nOnce Damon has both girls down to their thongs, he orders them onto the bed so that he can finger their creamy bald twats. Once their thongs are gone, Damon finally gets to have his way with first Sydney and then Kimmy. After taking each girl on her back, Damon orders them onto their hands and knees so that he can pound each of their pussies doggy style.\r\n\r\nNow that the girls are finally into the pleasure he can give them, they take turns climbing aboard to offer him a stiffie ride in their bald pussies. Damon lets go while Sydney is in mid bounce, glutting his stepsister's with a creampie of cum that leaves her smiling and fully pleased that she gave in to Damon's demands","torrent":{"xt":"urn:btih:377ddec21e178a1e4e21a5d58adafd1b4719375e","amp;dn":"Kimmy+Granger%2C+Sydney+Cole+-+Grounded+-+2016-02-01+%5B540p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"377ddec21e178a1e4e21a5d58adafd1b4719375e","infoHashBuffer":{"type":"Buffer","data":[55,125,222,194,30,23,138,30,78,33,165,213,138,218,253,27,71,25,55,94]},"announce":[],"urlList":[]}}