{"title":"Coast to Coast Economy &amp; Gold April 5 2016","uid":14205379,"size":28177418,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:39055c21221976f6116e1e8441951544c6456dad&amp;dn=Coast+to+Coast+Economy+%26amp%3B+Gold+April+5+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1459967903,"description":"Economy &amp; Gold/ Afterlife Communications\r\nCoast to Coast April 5,2016\r\n\r\nDate:\tTuesday - April 5, 2016\r\nHost:\tGeorge Noory\r\nGuests:\tJames Rickards\r\nIn the first half, investment banker and risk manager James Rickards spoke about the economic outlook and why he considers gold to be a prudent asset to own. The US economy has been growing at a sluggish pace, and a lot of potential earnings are being lost, he said. With the threat of negative interest rates, and banks digitizing cash, investing in gold as a physical commodity, can guard against these possibilities, he suggested. &quot;Gold is the best performing asset class of 2016...it's up almost 20%...It's also the best performing asset class of the 21st century, easily outperforming stocks,&quot; Rickards cited. While there has been the usual price fluctuations that commodities see, gold has been coveted by such countries as Russia and China, who have been stockpiling it in recent years, he reported.\r\n\r\nBeyond the importance of precious metals being part of an individual's portfolio, there is also a strategic aspect playing out in the geopolitical sphere. &quot;When you look at the coming collapse of the international monetary system-- this is like a poker game,&quot; with the US, China, Japan, Russia, and Europe the main players at the table, he remarked. As far as investing, Rickards recommends the one ounce coins of American Gold Eagles and American Silver Eagles which come from the US Mint, and have a badge of authenticity. He expressed caution about investing in bit coins, and cryptocurrency, since they're so new on the market, their value has yet to be tested in an economic downturn","torrent":{"xt":"urn:btih:39055c21221976f6116e1e8441951544c6456dad","amp;dn":"Coast+to+Coast+Economy+%26amp%3B+Gold+April+5+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39055c21221976f6116e1e8441951544c6456dad","infoHashBuffer":{"type":"Buffer","data":[57,5,92,33,34,25,118,246,17,110,30,132,65,149,21,68,198,69,109,173]},"announce":[],"urlList":[]}}