{"title":"GRID.Autosport-RELOADED","uid":14401036,"size":9938141184,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:39373b476b8d59cac88669160b228e92c2c97be0&amp;dn=GRID.Autosport-RELOADED&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cnbluray","files":1,"time":1461376387,"description":"\n\r\nIt's all about the teams, the rivals and the race in an intense new world of\r\nprofessional motorsport. Racing alongside a teammate, you must overcome key\r\nrivals and satisfy team sponsors in ferocious races where every pass and\r\nposition counts. In a huge career, specialise in your favourite racing\r\ndiscipline or conquer them all feel the aggression of the pack in Touring\r\nCars, manage tyre wear and race into the night in Endurance events, race\r\nOpen-Wheel cars with precision, show car control in Tuner events and react on\r\nthe fly in Street races. Each unique category features series dedicated to\r\ndifferent classes, including Touring Cars, Hypercars, Endurance GT Cars,\r\nPrototypes, Single-Seaters, Super Modified vehicles, Drift cars and many\r\nmore. Bursting with content, GRID Autosport features over 100 routes across\r\n22 incredible locations and the world's most exciting contemporary and\r\nclassic high-performance racing cars to collect, tune and upgrade.\r\nDevelopment has been driven by Community feedback to include the return of\r\nin-car view, authentic handling and multiplayer racing powered by RaceNet to\r\ndeliver new challenges every week, plus all-new Racing Clubs for online team\r\ncompetition. Party modes, Demolition Derby and competitive split-screen modes\r\ncomplement the game's extensive career mode and expansive core online game","torrent":{"xt":"urn:btih:39373b476b8d59cac88669160b228e92c2c97be0","amp;dn":"GRID.Autosport-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39373b476b8d59cac88669160b228e92c2c97be0","infoHashBuffer":{"type":"Buffer","data":[57,55,59,71,107,141,89,202,200,134,105,22,11,34,142,146,194,201,123,224]},"announce":[],"urlList":[]}}