{"title":"BiniSoft Windows Firewall Control v4.7.1.0","uid":14373898,"size":339382,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3f61cf5f5354867c939db6430553a64cc94d6212&amp;dn=BiniSoft+Windows+Firewall+Control+v4.7.1.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZarkBit","files":1,"time":1461184889,"description":"BiniSoft Windows Firewall Control v4.7.1.0\r\n\r\nWhat's new in version 4.7.1.0 (10.04.2016)\r\n\r\n- New: Secure Rules was extended to allow two possible actions when handling \r\nunauthorized rules: delete or disable. All the rules that will be automatically \r\ndisabled will be moved in a new predefined group named 'Unauthorized Rules'. \r\nThe user can now review these rules in Rules Panel.\r\n- Fixed: Customize and allow does not work in Connections Log from the toolbox button\r\nor from the context menu. It works only on double click.\r\n- Fixed: Connections Log menu item is enabled in the system tray context menu if the\r\nservice is not started.\r\n- Fixed: The IP set in the rule named  &quot;WFC - Windows Firewall Control Updater&quot; needs \r\nto be updated to the new website IP which is now 66.198.240.5.\r\n- Improved: The timeout for checking for new updates was increased from 3 seconds to \r\n10 to in order avoid connection timeout result.\r\n- Improved: The predefined group names which can't be removed are now grayed out in\r\nthe Authorized groups list. Added tooltip for the new authorized group text box to\r\ninform the user about the @ wildcard that can be used for Windows 10 apps rules.\r\n\r\nWindows Firewall Control - Managing Windows Firewall is now easier than ever\r\nProgram Overview\r\n\r\nWindows Firewall Control is a powerful application which extends the functionality of the Windows Firewall and provides quick access to the most frequent options of Windows Firewall. It runs in the system tray and allows user to control the native firewall easily without having to waste time by navigating to the specific part of the firewall. This is the best tool to manage the native firewall from Windows 10, 8.1, 8, 7, Vista, Server 2008, Server 2012. Windows Firewall Control offers four filtering modes which can be switched with just a mouse click:\r\n\r\nHigh Filtering - All outbound and inbound connections are blocked. This setting blocks all attempts to connect to and from your computer.\r\nMedium Filtering - Outbound connections that do not match a rule are blocked. Only the programs that you allow can initiate outbound connections.\r\nLow Filtering - Outbound connections that do not match a rule are allowed. The user can block the programs he doesn't want to allow initiating outbound connections.\r\nNo Filtering - Windows Firewall is turned off. Avoid using this setting unless you have another firewall running on your computer.\r\nProgram Features\r\n\r\n√ Intuitive and easy accessible interface in the system tray, next to the system clock.\r\n√ Full support with standard user accounts. Elevated privileges are required only at installation.\r\n√ Disable the ability of other programs to add Windows Firewall rules.\r\n√ Multiple and easier ways of creating new rules in Windows Firewall.\r\n√ Integrated support of creating, modifying and deleting Window Firewall rules.\r\n√ Lock feature which can disable the access to the settings of the program and Windows Firewall.\r\n√ Shell integration into the right click context menu of the executable files.\r\n√ Display invalid rules with the possibility to delete them very quickly.\r\n√ Merge multiple similar rules or duplicate existing ones.\r\n√ Search for executable files through folders and create new rules in seconds.\r\n√ View recently allowed and blocked connections and create new rules from the Security log.\r\n√ Choose if you want the program to start at user log on.\r\n√ Import, export and restore all firewall rules or just the selected rules.\r\n√ Protection to unauthorized uninstallation.\r\n√ Possibility to restore previous settings at uninstallation.\r\n√ Global hot keys are supported and various shortcut keys are available.\r\n√ And many, many more. Just try it out","torrent":{"xt":"urn:btih:3f61cf5f5354867c939db6430553a64cc94d6212","amp;dn":"BiniSoft+Windows+Firewall+Control+v4.7.1.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f61cf5f5354867c939db6430553a64cc94d6212","infoHashBuffer":{"type":"Buffer","data":[63,97,207,95,83,84,134,124,147,157,182,67,5,83,166,76,201,77,98,18]},"announce":[],"urlList":[]}}