{"title":"Dead.Island-RELOADED","uid":14400969,"size":5899744643,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:3f63b621c4e1c1ec4704e04b4b6ebabd876e02e4&amp;dn=Dead.Island-RELOADED&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cnbluray","files":2,"time":1461376075,"description":"\nhttp://image.gamespotcdn.net/gamespot/images/bigboxshots/3/933053_96333_front.jpg \r\n\r\n                                        nERv\r\n\r\n                          Dead Island (c) Deep Silver\r\n\r\n        09/2011 :..... RELEASE.DATE .. PROTECTION .......: Steam\r\n              1 :.......... DISC(S) .. GAME.TYPE ........: Action\r\n\r\n  Terror. Violence. Madness. Bedlam. A holiday paradise gone mad. A tropical\r\n  island turns into total chaos after a mysterious zombie outbreak. Cut off\r\n  from the rest of the world, the player's only chance to survive is to fight\r\n  to the death and find a way to escape from the island.\r\n\r\n  Dead Island combines first-person action with a heavy focus on melee combat,\r\n  character development and customization of a vast array of weapons. All of\r\n  these gameplay features are presented in a dark story inspired by classic\r\n  zombie movies with a gritty and engrossing campaign that can be played with\r\n  up to four players in co-op mode.\r\n\r\n  Set in an open world tropical island, hordes of different festering zombies\r\n  await players around every corner while they embark on a variety of\r\n  thrilling missions through the holiday resort. With firearms and ammunition\r\n  being scarce the player must rely on utilizing found items as weapons for\r\n  self-defense and fight off zombie hordes in intense melee combat. A diverse\r\n  range of items can be collected and will later serve to transform the\r\n  player's ordinary makeshift weapons into serious instruments of destruction.\r\n\r\n  In addition to satisfying even the most bloodthirsty action fan's fantasy,\r\n  Dead Island also features role-playing elements which allow the player to\r\n  develop one of the game's unique character classes according to their\r\n  preferences, all the while learning new skills and fresh tactics during\r\n  their journey through the perilous environments of the island. What's more,\r\n  anytime during a game up to four players can seamlessly join together and\r\n  experience the intense combat and immersive story with cooperative gameplay.\r\n\r\n  With the all-new Chrome Engine 5 powering Dead Island, the game will use the\r\n  latest installment of Techland's acclaimed proprietary game engine, allowing\r\n  the player to experience the tropical island paradise in graphical splendor\r\n  with diverse environments like lush forests and detailed city environments.\r\n\r\n  1. Unrar.\r\n  2. Burn or mount the image.\r\n  3. Install the game using our installer.\r\n  4. Copy over the cracked content from the Crack dir on the disc to the\r\n    dir of the game. Install the redists from the REDIST\r\ndir as needed.\r\n  5. Play the game.\r\n  6. Support the software developers. If you like this game, BUY IT!\r\n \nhttp://xbox360media.ign.com/xbox360/image/article/117/1174859/e3-2011-dead-island-screens-20110609102814837_640w.jpg \r\n \nhttp://xbox360media.ign.com/xbox360/image/article/117/1174859/e3-2011-dead-island-screens-20110609102809993_640w.jpg \r\n \nhttp://xbox360media.ign.com/xbox360/image/article/117/1174859/e3-2011-dead-island-screens-20110609102819415_640w.jpg \r\n\r\nAcest torent este [FreeLeech], numai upload-ul se ia in considerare !","torrent":{"xt":"urn:btih:3f63b621c4e1c1ec4704e04b4b6ebabd876e02e4","amp;dn":"Dead.Island-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f63b621c4e1c1ec4704e04b4b6ebabd876e02e4","infoHashBuffer":{"type":"Buffer","data":[63,99,182,33,196,225,193,236,71,4,224,75,75,110,186,189,135,110,2,228]},"announce":[],"urlList":[]}}