{"title":"FullMetal Alchemist","uid":13911869,"size":4901763346,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:415eb03863f5de6ba3b4dd9bce2dd13577605461&amp;dn=FullMetal+Alchemist&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kailer24","files":51,"time":1458306623,"description":"Edward e Alphonse Elric são dois irmãos alquimistas procurando o catalisador lendário chamado Pedra Filosofal, um objeto poderoso que lhes permite restaurar seus corpos (que foram perdidos numa tentativa de trazer sua mãe de volta à vida pelo uso da alquimia). Nascidos na aldeia de Resembool no país chamado Amestris (アメストリス, Amesutorisu?), os dois irmãos viviam na aldeia com sua mãe Trisha Elric.[1] O pai deles, Von Hohenheim, saiu de casa por razões desconhecidas, e anos mais tarde, sua mãe Trisha Elric morreu de uma doença incurável, deixando, portanto, os dois irmãos sozinhos. Após a morte de sua mãe, Edward decide ressuscitá-la através da alquimia,[2] uma ciência avançada em que os objetos podem ser criados a partir de matérias-primas. Eles pesquisaram sobre Transmutação Humana, uma técnica proibida em que se tenta criar ou modificar um ser humano. Essa tentativa, todavia, fracassou e consequentemente Edward perdeu sua perna esquerda e Alphonse seu corpo inteiro. Numa tentativa desesperada de salvar seu irmão, Edward sacrifica seu braço direito para unir a alma de Alphonse a uma armadura","torrent":{"xt":"urn:btih:415eb03863f5de6ba3b4dd9bce2dd13577605461","amp;dn":"FullMetal+Alchemist","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"415eb03863f5de6ba3b4dd9bce2dd13577605461","infoHashBuffer":{"type":"Buffer","data":[65,94,176,56,99,245,222,107,163,180,221,155,206,45,209,53,119,96,84,97]},"announce":[],"urlList":[]}}