{"title":"Rigmar Radio Karaoke Collection 48100","uid":13512112,"size":2402795580,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:42c93f0f23f38746f78f9d22952e75b3a3b0037e&amp;dn=Rigmar+Radio+Karaoke+Collection+48100&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rigmar_radio","files":800,"time":1455294968,"description":"Para aquellos que no hablan, leer o escribir en español, como yo, puede que le resulte útil para colocar estas canciones en los álbumes llamado &quot;Karaoke Vol Español 1&quot; y así sucesivamente hasta que haya terminado, entonces cuando un único orador español le pide una canción , sólo puede enumerar todos los discos en español en su monitor y dejar que el cantante seleccionar directamente de la pantalla.\r\n\r\nMás de 400 españoles Idioma Karaoke, los usuarios de Pirate Bay por favor ver los archivos torrents de los listados de la pista. No hay muchos más antes de que estamos de vuelta donde lo dejamos en Inglés bajo la letra S.\r\n\r\nRigmar Radio - Rockin el mundo libre desde 1967\r\n\r\nFor those who do not speak, read or write Spanish like myself you may find it handy to place these songs into Albums Called &quot;Spanish Karaoke Vol 1&quot; and so on till you are done, then when a Spanish only speaker asks you for a song, you can just list all the Spanish Albums on your monitor and let the Singer select direct from the screen.\r\n\r\n400 More Spanish Language Karaoke, Pirate Bay users please view the torrent files for the track listings.  Not too many more before we are back where we left off in English under the letter S.\r\n\r\nRigmar Radio - Rocking the Free World since 1967","torrent":{"xt":"urn:btih:42c93f0f23f38746f78f9d22952e75b3a3b0037e","amp;dn":"Rigmar+Radio+Karaoke+Collection+48100","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42c93f0f23f38746f78f9d22952e75b3a3b0037e","infoHashBuffer":{"type":"Buffer","data":[66,201,63,15,35,243,135,70,247,143,157,34,149,46,117,179,163,176,3,126]},"announce":[],"urlList":[]}}