{"title":"How to manage your VPS and Create Websites - Sloth Demon","uid":14311347,"size":266640630,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:42e712ae229f0a59ce4dfe7d580c4158489f3e1b&amp;dn=How+to+manage+your+VPS+and+Create+Websites+-+Sloth+Demon&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"daksh7011","files":44,"time":1460545808,"description":"\n\r\nLearn to buy, configure or manage your own VPS: this course is for them who are paying much for managing their server.\r\n\r\nNo experience required : You will be able to manage your VPS yourself after watching this video course.\r\n\r\nThere are over 30 video lectures, each lectures covers an individual topic.\r\n\r\nReason to learn managing a VPS yourself: Web servers is a must essential for presenting yourself online. If you have large website, you will need a personal server for yourself but hire someone for managing your server can be so expensive.\r\n\r\nHow much you need to pay for the tools to manage your VPS: Well, Zero. I will show you the tools you can use for completely free. I am managing these open source tools for managing my or my client's servers for years.\r\n\r\nWhat you will be able to Do after watching this video course?\r\n\r\nYou will be able buy a cool VPS for yourself from some industry leading VPS providers, and configure your VPS with a control panel for hassle free server managing.\r\n\r\nYou will be able to setup and manage servers from scratch yourself.\r\n\r\n    -Introduction to all needed server or web technologies\r\n    -The tools you need to manage your own VPS.\r\n    -How to setup and install Control Panel.\r\n    -How to sell services from your VPS\r\n    -Create your private nameservers and also use external DNS.\r\n    -How to get and install SSL for your site.\r\n    -Use FTP for your server.\r\n    -How to install WordPress in your server.\r\n    -How to Create a very basic website for yourself.\r\n    -Some security Notes you need to know.\r\n\r\nWhat are the requirements?\r\n\r\n    -You should be familiar browsing internet\r\n    -You should be familiar with websites, what a web server is and what it does\r\n\r\nWhat am I going to get from this course?\r\n\r\n    -Over 30 lectures and 1.5 hours of content!\r\n    -Manage your own VPS\r\n    -Use SSH\r\n    -Use FTP\r\n    -Install SSL certificates\r\n    -Upload and install WordPress\r\n    -Create websites in you own server\r\n\r\nWhat is the target audience?\r\n\r\n    -This course is for newbies who are not familiar with VPS or other web technologies.\r\n    -No pre programming knowledge is needed to take this course","torrent":{"xt":"urn:btih:42e712ae229f0a59ce4dfe7d580c4158489f3e1b","amp;dn":"How+to+manage+your+VPS+and+Create+Websites+-+Sloth+Demon","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42e712ae229f0a59ce4dfe7d580c4158489f3e1b","infoHashBuffer":{"type":"Buffer","data":[66,231,18,174,34,159,10,89,206,77,254,125,88,12,65,88,72,159,62,27]},"announce":[],"urlList":[]}}