{"title":"Workers.or.Shirkers.Ian.Hislops.Victorian.Benefits.ENSUB.MPup","uid":14380511,"size":1061884506,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:44a7ce63f5e6ac53161acf5a1f3f57b97e0906ab&amp;dn=Workers.or.Shirkers.Ian.Hislops.Victorian.Benefits.ENSUB.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1461220934,"description":"BBC.Documentaries.2016.04.07.Workers.or.Shirkers.Ian.Hislops.Victorian.Benefits.EN.SUB.MPEG4.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nAn entertaining, provocative film in which Ian explores the colourful history behind one of the most explosive issues of our times - welfare: who deserves to be helped, and who doesn't.\r\n\r\nWith his customary mix of light touch and intelligence, Ian tells the stories of five individuals whose Victorian attitudes remain incredibly resonant, inspiring some revealing interviews. Iain Duncan Smith is visibly moved when describing the lack of aspiration he has encountered as minister in charge of benefits, Deirdre Kelly, also known as 'White Dee' from Benefits Street, gets on famously with Ian, teasing him for being middle class, and Owen Jones and Tristram Hunt MP provide illuminating food for thought on the questions that still haunt us.\r\n\r\nPioneer of the workhouse Edwin Chadwick feared that hand-outs would lead to scrounging and sought to make sure that workers were always better off than the unemployed. That sounds fair - but was his solution simply too unkind? James Greenwood, Britain's first undercover reporter, made poverty a cause celebre through sensational journalism - but is the media voyeuristic when it comes to reporting on those on benefits? Helen Bosanquet, an early social worker, believed that poverty was caused by 'bad character'. Are some people genuinely more deserving than others? Bosanquet came to blows with Beatrice Webb, whose economic explanations for the causes of poverty led her to argue for the first foundations of a welfare state. Finally, even if we want to be generous, are there limits on how much we can afford to help? That question faced Margaret Bondfield, Britain's first female cabinet minister, who, despite her own working-class trade unionist credentials, controversially ended up advocating cuts at a time of national austerity","torrent":{"xt":"urn:btih:44a7ce63f5e6ac53161acf5a1f3f57b97e0906ab","amp;dn":"Workers.or.Shirkers.Ian.Hislops.Victorian.Benefits.ENSUB.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44a7ce63f5e6ac53161acf5a1f3f57b97e0906ab","infoHashBuffer":{"type":"Buffer","data":[68,167,206,99,245,230,172,83,22,26,207,90,31,63,87,185,126,9,6,171]},"announce":[],"urlList":[]}}