{"title":"Phase Transitions in Foods 2nd ed","uid":14414372,"size":6918168,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:468a3e6f639f0be558520d862d6c81b1b6ec73d6&amp;dn=Phase+Transitions+in+Foods+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1461478231,"description":"Phase Transitions in Foods 2nd ed - Yrjo H Roos, Stephan Drusch (AP, 2016).pdf\r\n\r\nISBN 978-0-12-408086-7\r\n\r\nPhase Transitions in Foods, Second Edition, assembles the most recent research and theories on the topic, describing the phase and state transitions that affect technological properties of biological materials occurring in food processing and storage. It covers the role of water as a plasticizer, the effect of transitions on mechanical and chemical changes, and the application of modeling in predicting stability rates of change.\r\n\r\nThe volume presents methods for detecting changes in the physical state and various techniques used to analyze phase behavior of biopolymers and food components. It should become a valuable resource for anyone involved with food engineering, processing, storage, and quality, as well as those working on related properties of pharmaceuticals and other biopolymers.\r\n\r\n\r\n\r\nContains descriptions of non-fat food solids as &quot;biopolymers&quot; which exhibit physical properties that are highly dependent on temperature, time, and water content\r\nDetails the effects of water on the state and stability of foods\r\nIncludes information on changes occurring in state and physicochemical properties during processing and storage\r\nThe only book on phase and state transitions written specifically for the applications in food industry, product development, and research","torrent":{"xt":"urn:btih:468a3e6f639f0be558520d862d6c81b1b6ec73d6","amp;dn":"Phase+Transitions+in+Foods+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"468a3e6f639f0be558520d862d6c81b1b6ec73d6","infoHashBuffer":{"type":"Buffer","data":[70,138,62,111,99,159,11,229,88,82,13,134,45,108,129,177,182,236,115,214]},"announce":[],"urlList":[]}}