{"title":"The Key: And the Name of the Key Is Willingness (1999) Audio","uid":14297741,"size":83928143,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:471997944253649457e436150c2fe2cbd35292e5&amp;dn=The+Key%3A+And+the+Name+of+the+Key+Is+Willingness+%281999%29+Audio&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gs909","files":1,"time":1460467987,"description":"THE KEY: AND THE NAME OF THE KEY IS WILLINGNESS\r\n\r\nby Cheri Huber\r\n\r\nCOMPLETE UNABRIDGED AUDIOBOOK - 1999 edition\r\n\r\n(read by the author)\r\n\r\nThis is a recording of the revised 1999 edition, which has been hailed as life-transforming since it was first published in 1984. \r\n\r\nTo learn more about the author, visit www.CheriHuber.com.\r\n\r\n===\r\n\r\nThe revised edition of the book was published in 1999 and is available on Amazon or wherever books are sold. \r\n\r\nThese insights from many years of Zen meditation practice appeal to a wide range of spiritual traditions and explore topics such as the difference between process and content, notions of right and wrong, ending self-punishment, and taking responsibility for one's experiences. Perfect for beginning Zen students and for those interested in Buddhism in general or eastern religion, it features deep spiritual insights and playful illustrations that add warmth and approachability to the topic.\r\n\r\nCheri Huber is the author of 19 books, including There Is Nothing Wrong with You, When You're Falling, Dive,and Time-Out for Parents. She founded the Mountain View Zen Center in Mountain View, California, and the Zen Monastery Practice Center in Murphys, California, and teaches in both communities. She travels widely and often, leading workshops and retreats around the United States and abroad, most recently in Costa Rica and Italy. She founded Living Compassion in 2003, a nonprofit group comprised of There Is Nothing Wrong With You Retreats (based on the book); Global Community for Peace: The Assisi Peace Project; The Africa Vulnerable Children Project; and Open Air Talk Radio, her weekly call-in radio show originating from Stanford University. She lives in Murphys, California","torrent":{"xt":"urn:btih:471997944253649457e436150c2fe2cbd35292e5","amp;dn":"The+Key%3A+And+the+Name+of+the+Key+Is+Willingness+%281999%29+Audio","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"471997944253649457e436150c2fe2cbd35292e5","infoHashBuffer":{"type":"Buffer","data":[71,25,151,148,66,83,100,148,87,228,54,21,12,47,226,203,211,82,146,229]},"announce":[],"urlList":[]}}