{"title":"The-Laura-Ingraham-Show-Podcast April 20 2016","uid":14373313,"size":34044153,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:48206621a03e572edf0d8c9816528f6ab41e1852&amp;dn=The-Laura-Ingraham-Show-Podcast+April+20+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1461180279,"description":"Unbound PA Delegate: Trump Plays Catch Up In Upcoming Primary \r\n\r\nJan Ting - Professor of Law at Temple University; Unbound PA Delegate\r\nSteve Moore - Senior Economic Contributor at FreedomWorks, Fellow at The Heritage Foundation\r\nAdam Winkler - Professor of constitutional law at the UCLA School of Law\r\n\r\nUnbound PA Delegate: Trump Plays Catch Up In Upcoming Primary\r\n\r\n\r\n\r\n\r\nExit Poll: More than 70% Say Candidate With Most Votes Should Be Nominee\r\n\r\nRecord levels of demand for an outsider, a straight-talker and a change agent lifted Donald Trump to an easy primary victory in his home state, even with less-than-usual levels of support on two of his signature issues, barring Muslims and deporting undocumented immigrants.\r\n\r\nHannity lashes out at Cruz in heated interview (audio)\r\nIn a heated radio interview with Sean Hannity, Republican presidential hopeful Ted Cruz lashed out at front-runner Donald Trump for &quot;whining&quot; about the Texas senator's effectiveness at winning over party delegates.\r\n\r\nChurch receives millions from Feds to relocate illegals in USA, says America 'raped' migrants' countries\r\nA Methodist bishop whose church receives millions of dollars in federal grants each year to house unaccompanied alien children asserted in a House hearing on Tuesday that the U.S. has &quot;raped&quot; immigrants' home countries.\r\n\r\nSheriff Warns: Every County Will Bed'Border County'\r\nIn testimony before Congress Tuesday, a Maryland sheriff said amnesty for minors has led to increased gang crime and warned that without a secure border every county will be a &quot;border county.&quot;\r\n\r\n\r\nBorder agent probed by DHS after testifying before Congress\r\nA top House Republican is calling on the Department of Homeland Security not to retaliate against a border patrol agent who has recently criticized President Obama's immigration policies.\r\n\r\nThe Trump Chess Board\r\nTrump has the lead in delegates for the Republican race and that lead will grow with the upcoming primaries","torrent":{"xt":"urn:btih:48206621a03e572edf0d8c9816528f6ab41e1852","amp;dn":"The-Laura-Ingraham-Show-Podcast+April+20+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48206621a03e572edf0d8c9816528f6ab41e1852","infoHashBuffer":{"type":"Buffer","data":[72,32,102,33,160,62,87,46,223,13,140,152,22,82,143,106,180,30,24,82]},"announce":[],"urlList":[]}}