{"title":"Sayonara Piano Sonata Volume 1 - 4 (English)","uid":13503440,"size":24653429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4877060288d520204ff33967c8ccb7d236bfd276&amp;dn=Sayonara+Piano+Sonata+Volume+1+-+4+%28English%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"martinke123","files":5,"time":1455227919,"description":"Naomi Hikawa is the main character of the novel, and the son of a famous music critic. Due to that, he has some musical knowledge, though it is pretty much limited to that, and perhaps the simple playing of a guitar. His hobby is to repair things, and has developed quite a good skill towards it.\r\n\r\nOne day, while going to his &quot;secret&quot; scrapyard to gather some spare parts, he saw a girl playing an abandoned piano there. Somehow, the music had caused the junks to resonate, creating an illusion of a junkyard symphony. He was mesmerized by the familiar sounding melody, but he could not remember the tune. Just then, the girl noticed him, and called him a pervert/stalker. She then requested him to forget about the incident.\r\n\r\nBack at home, Naomi realized that she is the piano prodigy Mafuyu Ebisawa, who had vanished from the music scene for some unknown reason. He met her soon again, with Mafuyu as the transfer student of his class. She declared to the class that there is no need to know her too well, since she will be gone soon. She had even snatched away an abandoned music shed that he had customized for his own personal use, in order to play her guitar. Not liking her cold personality and her sharp tongue, Naomi vowed to take back the music shed from her.\r\n\r\nSomehow, things became such that he was roped in by a senior, Kyouko Kagurazawa, and childhood friend Chiaki Aihara, to start a music band. His mission was to get Mafuyu, the required forth member, into the band. However, he soon realized the shocking truth behind Mafuyu's reason for disappearing from the piano scene and playing the guitar. Knowing that, will he be able to forget about the melody he heard from the junkyard, or will he be able to help Mafuyu play the piano again?","torrent":{"xt":"urn:btih:4877060288d520204ff33967c8ccb7d236bfd276","amp;dn":"Sayonara+Piano+Sonata+Volume+1+-+4+%28English%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4877060288d520204ff33967c8ccb7d236bfd276","infoHashBuffer":{"type":"Buffer","data":[72,119,6,2,136,213,32,32,79,243,57,103,200,204,183,210,54,191,210,118]},"announce":[],"urlList":[]}}