{"title":"DogHotel - My boarding kennel v1.5.2","uid":13553283,"size":66796835,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:489307d3bc56054f187575416b961cbe975c3dd3&amp;dn=DogHotel+-+My+boarding+kennel+v1.5.2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":1,"time":1455575059,"description":"Open your own dog hotel now!\r\n\r\nLook after all the doggies placed in your care.\r\nGranny Edith's poodle needs to lose some weight, beefy Lucky wants to join the fire department and little Lizzy wants to learn her first tricks. \r\n\r\nMake sure all the dogs have a nice time in your hotel and that they return to their owners happy!\r\n\r\n\r\nTHE FEATURES AT A GLANCE\r\n\r\n# Run and expand your very own dog boarding kennel!\r\n# Care for cute beagles, loyal labradors, agile Australian Shepherds and lots more breeds!\r\n# Feed and groom your doggy guests and train them in clicker training and on the challenging obstacle course!\r\n# Complete exciting missions. Each dog has its own story and presents you with challenging tasks!\r\n# Expand your boarding kennel and decorate it to your tastes with pirate baskets or a magical shower!\r\n# Pet and play with your dogs, or watch them frolic around together on the lawn!\r\n\r\n\r\nCARE FOR UP TO EIGHT DIFFERENT DOGS\r\n\r\nAs a fresh, young boarding kennel manager, you take control of your very own dog hotel.You'll find dog-caring tasks waiting for you there. \r\nYou ensure that all of the dogs are happy and satisfied during their stay. \r\n\r\nUp to eight dogs can stay in your boarding kennel at a time – so you've got your paws full!\r\n\r\nMake sure they've got enough food, wash and brush their coats and clean their cages. With lots of good care and plenty of activities, they'll feel right at home! And of course don't forget to give them lots of loving care and attention.\r\n\r\n\r\nPLAY WITH THE DOGS ON THE LAWN\r\n\r\nHappy dogs need variety and lots of fun! So it's important to give your guests enough space to run around in. You can play Frisbee or ball with them on the playing field or watch the dogs frolicking around together.\r\n\r\n\r\nTEACH THE DOGS NEW TRICKS!\r\n\r\nWith DogHotel 3D it's now also possible to train your dogs! Use the clicker, and with a bit of patience you can teach them neat new tricks and commands to perform. \r\n\r\nLabrador Lucky's owner will be thrilled when he gives him his paw when he comes to picks him up!\r\n\r\nYou can improve the fitness of your furry friends on the obstacle course. Guide your dogs over obstacles, through tunnels and across wobbly tree trunks.\r\n\r\n\r\nDECORATE YOUR DOG HOTEL!\r\n\r\nAs the manager of the boarding kennel, it's also your job to make sure the place is looking spic and span.\r\n\r\nThe more dogs you care for successfully, the more decorative items you'll unlock. From the pirate ship bathtub to the fun sausage feeding bowl, there's something for everyone. \r\n\r\nUse them to decorate and expand your boarding kennel entirely to your own tastes. Let your imagination run wild!\r\n\r\n#\r\n\r\nSo what's keeping you? Your doggy guests are waiting! Download DogHotel 3D now and open up your own boarding kennel!\r\n\r\nWhat's New:\r\n\r\nIt's winter at the DogHotel. The Tivola team would like to thank you for a great year with a small event:\r\n\r\n# Collect all gifts on 7 consecutive days to get a great reward\r\n# Christmas decorations everywhere in the DogHotel\r\n\r\nMore Info:\r\n \nhttps://play.google.com/store/apps/details?id=com.tivola.doghotel.full","torrent":{"xt":"urn:btih:489307d3bc56054f187575416b961cbe975c3dd3","amp;dn":"DogHotel+-+My+boarding+kennel+v1.5.2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"489307d3bc56054f187575416b961cbe975c3dd3","infoHashBuffer":{"type":"Buffer","data":[72,147,7,211,188,86,5,79,24,117,117,65,107,150,28,190,151,92,61,211]},"announce":[],"urlList":[]}}