{"title":"Portal 2-SKIDROW","uid":14372982,"size":7086538162,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:49a39de813a3d2709164cebd285c1c888432e2e9&amp;dn=Portal+2-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OneAndOnlyKing","files":2,"time":1461177561,"description":"\nhttp://img69.imageshack.us/img69/9527/port2c.png \r\n\r\nS  K  I  D  R  O  W\r\n.the leading force.\r\n\r\nproudly presents\r\nPortal 2 (c) Valve\r\n\r\n19-04-2011........Release Date - Protection.........Steam  CEG\r\nAction...............Game Type - Disk(s)..................1 DVD\r\n\r\nRELEASE NOTES\r\n\r\nPortal 2 draws from the award-winning formula of innovative gameplay,\r\nstory, and music that earned the original Portal over 70 industry\r\naccolades and created a cult following.\r\n\r\nThe single-player portion of Portal 2 introduces a cast of dynamic new\r\ncharacters, a host of fresh puzzle elements, and a much larger set of\r\ndevious test chambers. Players will explore never-before-seen areas of\r\nthe Aperture Science Labs and be reunited with GLaDOS, the occasionally\r\nmurderous computer companion who guided them through the original game.\r\n\r\nThe games two-player cooperative mode features its own entirely\r\nseparate campaign with a unique story, test chambers, and two new\r\nplayer characters. This new mode forces players to reconsider\r\neverything they thought they knew about portals. Success will require\r\nthem to not just act cooperatively, but to think cooperatively.\r\n\r\nFeatures:\r\n\r\nExtensive single player: Featuring next generation gameplay and a\r\nwildly-engrossing story.\r\n\r\nComplete two-person co-op: Multiplayer game featuring its own dedicated\r\nstory, characters, and gameplay.\r\n\r\nAdvanced physics: Allows for the creation of a whole new range of\r\ninteresting challenges, producing a much larger but not harder game.\r\n\r\nOriginal music.\r\n\r\nMassive sequel: The original Portal was named 2007's Game of the Year\r\nby over 30 publications worldwide.\r\n\r\nEditing Tools: Portal 2 editing tools will be included. Note: To be\r\nmade available after launch.\r\n\r\nINSTALL NOTES\r\n\r\n1. Unpack the release\r\n2. Mount or burn image\r\n3. Install\r\n4. Copy all files from the SKIDROW folder to the game installation\r\n5. Play the game (use our included language launcher to change language\r\n6. Support the companies, which software you actually enjoy\r\n\r\nADDITIONAL NOTES\r\n\r\nEnjoy - a very strong candidate to game of the year\r\n\r\nCredits to Hyochan for the great tune we used on our language launcher\r\n\r\nGREETINGS\r\n\r\nUnleashed - TiNYiSO - MRN - RADIKAL - POSTMORTEM - GENESIS - Fairlight\r\nSHOCK - CRUDE - ReUnion - VACE - OUTLAWS - BACKLASH - Titan\r\n\r\nascii art by the\r\ngodlike &amp; terrific duo\r\nmalodix  irokos\r\ntitan artdivision\r\n\r\nProducător: Valve Software\r\nDistribuitor: Valve Software\r\nPlatformă: PC, X360, PS3\r\nGen: Sci-Fi First-Person Shooter\r\nData lansării: 21-Apr-2011\r\n\r\nPortal 2 draws from the award-winning formula of innovative gameplay, story, and music that earned the original Portal over 70 industry accolades and created a cult following.\r\n\r\nThe single-player portion of Portal 2 introduces a cast of dynamic new characters, a host of fresh puzzle elements, and a much larger set of devious test chambers. Players will explore never-before-seen areas of the Aperture Science Labs and be reunited with GLaDOS, the occasionally murderous computer companion who guided them through the original game.\r\n\r\nThe game's two-player cooperative mode features its own entirely separate campaign with a unique story, test chambers, and two new player characters. This new mode forces players to reconsider everything they thought they knew about portals. Success will require them to not just act cooperatively, but to think cooperatively.\r\n\r\n    * Extensive single player game featuring next generation gameplay and a wildly-engrossing story.\r\n    * Complete two-person co-operative multiplayer game featuring its own dedicated story, characters, and gameplay.\r\n    * Advanced use of physics allow for the creation of a whole new range of interesting challenges, producing a much larger but not harder game.\r\n    * Original music.\r\n    * A massive sequel to the title named 2007's Game of the Year by over 30 publications worldwide.\r\n \nhttp://shareimage.ro/images/yk3555va1ann6tclvu6_thumb.jpg   \nhttp://shareimage.ro/images/grghqt56ni7qau3uqeb_thumb.jpg   \nhttp://shareimage.ro/images/ub9cipxmgc1hqojt4687_thumb.jpg \r\n\r\nTrailer:\r\n\r\nAcest torent este [FreeLeech], numai upload-ul se ia in considerare !","torrent":{"xt":"urn:btih:49a39de813a3d2709164cebd285c1c888432e2e9","amp;dn":"Portal+2-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49a39de813a3d2709164cebd285c1c888432e2e9","infoHashBuffer":{"type":"Buffer","data":[73,163,157,232,19,163,210,112,145,100,206,189,40,92,28,136,132,50,226,233]},"announce":[],"urlList":[]}}