{"title":"Where The Light Gets In - Kimberly Williams-Paisley","uid":14376240,"size":2171242,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ce2a46feb0796fc52b2c4ed46b22dd96820deed&amp;dn=Where+The+Light+Gets+In+-+Kimberly+Williams-Paisley&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1461197109,"description":"Many know Kimberly Williams-Paisley as the bride in the popular Steve Martin remakes of the Father of the Bride movies, the calculating Peggy Kenter on Nashville, or the wife of country music artist, Brad Paisley. But behind the scenes, Kim was dealing with a tragic secret: her mother, Linda, was suffering from a rare form of dementia that slowly crippled her ability to talk, write and eventually recognize people in her own family.\r\n\r\nWhere the Light Gets In tells the full story of Linda’s illness—called primary progressive aphasia—from her early-onset diagnosis at the age of 62 through the present day. Kim draws a candid picture of the ways her family reacted for better and worse, and how she, her father and two siblings educated themselves, tried to let go of shame and secrecy, made mistakes, and found unexpected humor and grace in the midst of suffering.\r\n\r\nUltimately the bonds of family were strengthened, and Kim learned ways to love and accept the woman her mother became. With a moving foreword by actor and advocate Michael J. Fox, Where the Light Gets In is a heartwarming tribute to the often fragile yet unbreakable relationships we have with our mothers","torrent":{"xt":"urn:btih:4ce2a46feb0796fc52b2c4ed46b22dd96820deed","amp;dn":"Where+The+Light+Gets+In+-+Kimberly+Williams-Paisley","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ce2a46feb0796fc52b2c4ed46b22dd96820deed","infoHashBuffer":{"type":"Buffer","data":[76,226,164,111,235,7,150,252,82,178,196,237,70,178,45,217,104,32,222,237]},"announce":[],"urlList":[]}}