{"title":"Snowboard Party 2 v1.0.5 mod and data","uid":14289595,"size":651888155,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:4f34ef502a684648132dcc45f9fa1165dc7f2b7c&amp;dn=Snowboard+Party+2+v1.0.5+mod+and+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":3,"time":1460419565,"description":"Snowboard Party is back to fulfill all your adrenaline needs in this long-awaited sequel. \r\n\r\nExperience the new time-attack race mode and practice your best tricks in 21 unique locations. Hop on your board and improve your skills to land sick combos and rack high scores!\r\n\r\nPlay with your friends using the online multiplayer mode or challenge riders from all over the world using the online leaderboards. Complete over 150 level objectives and achievements, gain experience and upgrade your attributes to perform better and achieve higher scores.\r\n\r\nCustomize your favorite riders with a selection of over 80 outfits including exclusive skins such as a zombie, alien, pirate and many more. Discover how to unlock the new secret big head mode. Upgrade your board to give you an extra edge over the competition. Pick from a selection of 50 boards with unique specs that complement your rider’s abilities. \r\n\r\nHIGH DEFINITION \r\nSnowboard Party 2 includes next generation 3D graphics specially optimized for your mobile hardware to provide you with the best snowboarding experience.\r\n\r\nTIME-ATTACK\r\nReach the end of the track as quick as possible. Executing tricks will give you extra speed and checkpoints will earn you more time. Missing flags will deduct points from your final score.\r\n\r\nFREESTYLE \r\nFreestyle is all about the tricks! The rider uses natural and man-made features such as rails, jumps, boxes, logs, rocks and innumerable other objects to perform the sickest tricks! \r\n\r\nBIG AIR \r\nGo big or go home! Big air competitions are contests where riders perform tricks on massive jumps while going down the slope at high speed. \r\n\r\nHALFPIPE \r\nPerform a wide range of tricks while going down some of the world’s biggest halfpipes. Chain multiple tricks in a row to gain more points and achieve a better score. \r\n\r\nMULTIPLAYER \r\nChallenge your friends to a snowboard battle and let’s see who can land the baddest tricks! Share and brag your results with your friends on Twitter. \r\n\r\nMASSIVE SELECTION \r\nSelect between 16 snowboarders and customize each of them to your preference choosing your favorite gear. A massive collection of boards ranging from different sizes and designs are available allowing you to complement your rider’s skills and abilities. \r\n\r\nLEARN TO SNOWBOARD\r\nOver 50 unique tricks to master and hundreds of combinations. Follow the tutorial to get started and progress as you go. Execute the craziest combos and trick sequences to rack up some impressive high scores, gain experience and make a name for yourself. \r\n\r\nGAME CONTROLLER\r\nCompatible with most game controllers available. \r\n\r\nLOADED WITH FEATURES \r\n•Supports all the latest generation devices and optimized for high resolution displays.\r\n•Online multiplayer mode to play against your friends or other riders online.\r\n•New fully customizable control system. You can adjust everything! \r\n•Learn over 50 unique tricks and create hundreds of combinations. \r\n•Massive locations to ride including 21 courses located in different continents. \r\n•Customize your outfit in style!\r\n•Upgrade your board to improve your rider’s stats.\r\n•Play often to gain experience and upgrade your favorite snowboarder’s attributes. \r\n•Share your results with your friends on Twitter. \r\n•Extended soundtrack featuring songs from Templeton Pek, Sink Alaska, We Outspoken, Phathom, Voice of Addiction, Pear and Curbside. \r\n•Ability to purchase experience points or special items using in-app purchases. \r\n•Available in the following languages: English, French, German, Italian, Spanish, Russian, Japanese, Korean, Portuguese and Chinese \r\n\r\nNow optimized for NVIDIA SHIELD with Bloom, HDR, and Custom Blur Shaders! Crowned the best snowboarding game available on the market.\r\n\r\nWhat’s new:\r\n-Performance optimization\r\n-Various bug fixes\r\n\r\nMod Info\r\nUnlocked\r\nUnlimited EXP to buy everything\r\n\r\nRequired Android O/S : 3.0+\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play","torrent":{"xt":"urn:btih:4f34ef502a684648132dcc45f9fa1165dc7f2b7c","amp;dn":"Snowboard+Party+2+v1.0.5+mod+and+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f34ef502a684648132dcc45f9fa1165dc7f2b7c","infoHashBuffer":{"type":"Buffer","data":[79,52,239,80,42,104,70,72,19,45,204,69,249,250,17,101,220,127,43,124]},"announce":[],"urlList":[]}}