{"title":"Corra Snows Game - (PC-MAC)","uid":14415242,"size":18922752,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4f49035de693da5886f93a0d4764c05a4355a554&amp;dn=Corra+Snows+Game+-+%28PC-MAC%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mfelippe","files":2,"time":1461489628,"description":"Help Snows in his adventure inspired by classic games of the genre platform.\r\nRun Snows unites the best of the genre platform by adding gender elements &quot;run&quot; to have a more dynamic gameplay on mobile platform, and also has several unique features:\r\n\r\n- Zoom Native System: For devices with small screen, or simply you have all pixel art of glamor on a large scale!\r\n\r\n- ParallaxScrolling: The best use of scrolling system providing greater immersion and interaction in the palm of your hands.\r\n\r\n- Dynamic Difficulty Levels: Run Snows you choose the best way go, casual gamers will choose the easy way, experienced players will be rewarded for their bold choices.\r\n\r\n- Many Secrets: Discover the mysteries behind the next block or hidden paths ...\r\n\r\n- Point + Points: Post your score with #corrasnows hashtag to compete with your friends!\r\n\r\n- Much more: Download now and discover all the mysteries!\r\n\r\n################################################## #####################################\r\n\r\nDeveloper's Note: Run Snows was developed entirely by a single person who does not have the support of large corporations, all tests were made so you can have the best possible experience, but some events can not be predicted.\r\n\r\nGood game!\r\n\r\n--\r\n\r\nAjude Snows em sua aventura inspirada em jogos clássicos do gênero plataforma.\r\nCorra Snows une o melhor do gênero plataforma adicionando elementos do gênero &quot;run&quot; pra ter uma jogabilidade mais dinâmica na plataforma mobile, e ainda conta com diversas características únicas:\r\n\r\n- Sistema de Zoom Nativo: Para aparelhos com tela pequena, ou simplesmente para você ter todo glamour da pixel art em grande escala!\r\n\r\n- ParallaxScrolling: A melhor utilização do sistema de scrolling proporcionando uma maior imersão e interação na palma de suas mãos.\r\n\r\n- Níveis de dificuldade dinâmicos: Em Corra Snows você escolhe o melhor caminho percorrer, jogadores casuais irão escolher o caminho mais fácil, jogadores experientes serão premiados por suas audaciosas escolhas.\r\n\r\n- Muitos Segredos: Descubra todos os mistérios atrás do próximo bloco ou caminhos escondidos...\r\n\r\n- Ponto + Pontos: Publique sua pontuação com hashtag #corrasnows para competir com seus amigos!\r\n\r\n- Muito mais: Baixe agora e descubra todos os mistérios!\r\n\r\n#######################################################################################\r\n\r\nNota do desenvolvedor: Corra Snows foi desenvolvido inteiramente por uma unica pessoa, que não conta com o suporte de grandes corporações, todos os testes foram feitos para que você possa ter a melhor experiência possível, mas algumas ocorrências podem não ser previsíveis.\r\n\r\nBom jogo!","torrent":{"xt":"urn:btih:4f49035de693da5886f93a0d4764c05a4355a554","amp;dn":"Corra+Snows+Game+-+%28PC-MAC%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f49035de693da5886f93a0d4764c05a4355a554","infoHashBuffer":{"type":"Buffer","data":[79,73,3,93,230,147,218,88,134,249,58,13,71,100,192,90,67,85,165,84]},"announce":[],"urlList":[]}}