{"title":"Chainsaw Warrior: Lords of the Night v1.1.7 full","uid":14289260,"size":231930378,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:51931fdad6cfd9d4d084dd0ee401cb700f214955&amp;dn=Chainsaw+Warrior%3A+Lords+of+the+Night+v1.1.7+full&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":3,"time":1460418981,"description":"Chainsaw Warrior: LotN is a new chapter for Games Workshop's cult classic! Based on the original board game, this sequel adds new layers of intensity to the game's unique formula. \r\n\r\nChainsaw Warrior: LotN sees the player fighting against hordes of Aztec Zombies, and the clock, to save reality from Darkness. Lords of the Night introduces an upgraded combat system, new weapons, powers, equipment and unique mini bosses that require careful tactics to defeat. It adds three new zones to fight through, an even tougher confrontation with the enigmatic Darkness and plenty of new opportunities to die!\r\n\r\nIt's the year 2035 and the crazed followers of a near-forgotten God have opened a hole into a nightmare dimension. Through this portal bizarre and dangerous creatures are flooding into our world, intent on total destruction! There remains just single hope: a shadowy ex-special forces soldier, enhanced for combat and known only as 'Chainsaw Warrior'. He saved New York in 2032 – can he now save the world? Equipped with new high-tech armaments, he must battle his way through the jungle to find and defeat Darkness. Not only are there swarms of Aztec zombies, mutants, traps, Moon Cult Agents and other twisted fiends between him and Darkness, time is the enemy too! Only 60 minutes remain to save us all before we are torn from our reality forever.\r\n\r\nChainsaw Warrior was first published as a solo board game in 1987, is expanded in this new adventure. An epic battle that offers new gameplay, weapons, equipment, enemies and much more. Can you prevail where all others have failed? You only have 60 minutes to save the world!\r\n\r\n&quot;An improved interface and tweaked mechanics make Chainsaw Warrior: Lords of the Night an impressive sequel.&quot; 148Apps (4.5/5 Stars)\r\n&quot;Chainsaw Warrior Lords of the Night excruciatingly tense and insanely fun at the same time, both of which keep you coming back for more. 8.5/10&quot; Game Debate\r\n\r\nWhat’s new:\r\nThe latest update for Chainsaw Warrior: Lords of the Night is designed by you, the Chainsaw Warrior community. We've added a brand new weapon - the Katana - plus the Flood trap card that brings with it deadly Piranha. Update now and let us know what you think by leaving us a review and rating!\r\n\r\nRequired Android O/S : 4.3.3+\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play","torrent":{"xt":"urn:btih:51931fdad6cfd9d4d084dd0ee401cb700f214955","amp;dn":"Chainsaw+Warrior%3A+Lords+of+the+Night+v1.1.7+full","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51931fdad6cfd9d4d084dd0ee401cb700f214955","infoHashBuffer":{"type":"Buffer","data":[81,147,31,218,214,207,217,212,208,132,221,14,228,1,203,112,15,33,73,85]},"announce":[],"urlList":[]}}