{"title":"Vanishing Air Supremacy John Batchelor 05062016.mp3","uid":14558994,"size":9863127,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:555fa1b9fc2cc46ac772478b872f8d466f64ee2d&amp;dn=Vanishing+Air+Supremacy+John+Batchelor+05062016.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1462721572,"description":"Vanishing Air Supremacy. Gandhi, Thatcher, Rouseff. Erdogan Rebukes EU. Ghost Galaxies. @jedbabbin. Markos Kounalakis. Gregory Copley. Ken Croswell\r\n\r\nJohn Batchelor May 6, 2016 Podcast\r\n\r\n…The consistently troubled #F-35 is already about seven years late. Its schedule may slip more years because its enormously complex software system is still causing problems that can't be ignored, such as switching off the radar at random moments. As Adm. Shoemaker's briefing shows, if the F-35 schedule slips another two years, the number of unready F-18 squadrons in 2020 would be 11: nine F-18 squadrons and two F-35 squadrons.\r\n\r\nThat means in 2020, nearly one-third of the Navy's fighter squadrons could be unready for combat.\r\n\r\n“Retired U.S. Navy Capt. Chuck Nash is a veteran naval aviator who flew A-7 attack aircraft and F-18s. Capt. Nash told me, &quot;The Navy's carrier fleet is expected to perform a lot of missions around the world at any time. Right now, the Navy doesn't have the aircraft, the people or the budget to do what's expected of it. We are wearing out the platforms and also taking a tremendous toll on our sailors. Something's got to give.&quot;\r\n\r\n“To deal with these shortfalls in capability, the Navy has implemented what it calls &quot;tiered readiness.&quot; It is reducing deployment times to seven months, creating a gap in coverage in critical regions of the world. The Navy has 10 carriers and will soon have 11 when the USS Gerald Ford is delivered. But, according to these two experts, there are only enough aircraft, logistics and support equipment to fully equip six at a time. If the F-35 is further delayed, the effect on Navy (and Air Force) readiness may be catastrophic.\r\n \nhttp://m.washingtontimes.com/news/2016/may/2/jed-babbin-shrinking-us-military-budgets-threaten-/print/\r\n\r\n_________\r\n\r\nIn Choosing Female Leaders, U.S. Trails Many Nations\r\n\r\nby Markos Kounalakis via Sacramento Bee\r\n\r\nEvery election brings new questions about the qualities and character of national leadership, in the United States and abroad. In the 2008 presidential election, the big question was whether America could elect a nonwhite man – in this case, an African American – as president. Up until then, all U.S. presidents had been white Christian males of European descent.\r\n \nhttp://www.sacbee.com/opinion/op-ed/markos-kounalakis/article74279332.html\r\n\r\n_________\r\n \nhttp://www.bbc.com/news/world-europe-36229468\r\n\r\n____\r\n \nhttps://www.newscientist.com/article/2082010-ghostly-galaxies-are-light-on-stars-but-heavy-on-dark-matter/ .\r\n \nhttp://johnbatchelorshow.com/","torrent":{"xt":"urn:btih:555fa1b9fc2cc46ac772478b872f8d466f64ee2d","amp;dn":"Vanishing+Air+Supremacy+John+Batchelor+05062016.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"555fa1b9fc2cc46ac772478b872f8d466f64ee2d","infoHashBuffer":{"type":"Buffer","data":[85,95,161,185,252,44,196,106,199,114,71,139,135,47,141,70,111,100,238,45]},"announce":[],"urlList":[]}}