{"title":"Plastics and the Environment  - Anthony L. Andrady","uid":14533180,"size":7485282,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55c0585ded975c6d0ada801797ffd58655e2584b&amp;dn=Plastics+and+the+Environment++-+Anthony+L.+Andrady&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1462470152,"description":"Plastics and the Environment  - Anthony L. Andrady (Wiley, 2003).pdf\r\n\r\nISBN 0-471-09520-6\r\n\r\nAn original, comprehensive survey on the complex relationship between plastics and the environment Plastics offer a variety of environmental benefits. However, their production, applications, and disposal present many environmental concerns. Plastics and the Environment provides state-of-the-art technical and research information on the complex relationship between the plastic and polymer industry and the environment, focusing on the sustainability, environmental impact, and cost-benefit tradeoffs associated with different technologies. Bringing together the field's leading researchers, Anthony Andrady's innovative collection not only covers how plastics affect the environment, but also how environmental factors affect plastics. The relative benefits of recycling, resource recovery, and energy recovery are also discussed in detail. The first of the book's four sections represents a basic introduction to the key subject matter of plastics and the environment; the second explores several pertinent applications of plastics with environmental implications-packaging, paints and coatings, textiles, and agricultural film use. The third section discusses the behavior of plastics in some of the environments in which they are typically used, such as the outdoors, in biotic environments, or in fires. The final section consists of chapters on recycling and thermal treatment of plastics waste. Chapters include: * Commodity Polymers * Plastics in Transportation * Biodegradation of Common Polymers * Thermal Treatment of Polymer Waste * Incineration of Plastics The contributors also focus on the effectiveness of recent technologies in mitigating environmental impacts, particularly those for managing plastics in the solid waste stream. Plastic and design engineers, polymer chemists, material scientists, and ecologists will find Plastics and the Environment to be a vital resource to this critical industry","torrent":{"xt":"urn:btih:55c0585ded975c6d0ada801797ffd58655e2584b","amp;dn":"Plastics+and+the+Environment++-+Anthony+L.+Andrady","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55c0585ded975c6d0ada801797ffd58655e2584b","infoHashBuffer":{"type":"Buffer","data":[85,192,88,93,237,151,92,109,10,218,128,23,151,255,213,134,85,226,88,75]},"announce":[],"urlList":[]}}