{"title":"Actual Window Manager v8.8","uid":14129467,"size":12462315,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5630480cd9614dc1d7e5b178d849884e19eabe2a&amp;dn=Actual+Window+Manager+v8.8&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZarkBit","files":1,"time":1459545281,"description":"Actual Window Manager v8.8\r\n\r\n[!] Important\r\n[+] New\r\n[-] Fixed error\r\n[*] Changes\r\n\r\n---------------------------------------------------------------------------\r\nActual Window Manager 8.8 (31.03.2016)\r\n---------------------------------------------------------------------------\r\n[!] Configuration: List of specific Window Settings has been removed from\r\n    the Window Settings navigation tree. Now, you can edit certain\r\n    Specific Window settings item in a separate window that can be opened\r\n    in the following ways:\r\n\r\n    - double click the required item in the Specific Settings list\r\n\r\n    - select the required item in the Specific Settings list and press Enter\r\n\r\n    - use the Edit Window Rule command in either the toolbar or the context menu\r\n      of the Specific Settings list\r\n\r\n    Known issues (subject to fix in the future updates):\r\n\r\n    1) the multi-editing of several specific settings does now work as before\r\n\r\n    2) there is no way to adjust the natural order of specific settings\r\n\r\n[!] Configuration: Global Options subitems have been removed from\r\n    the Window Settings navigation tree and transformed into tabs of the Global\r\n    Options detail panel.\r\n\r\n[+] Configuration: Back/Forward buttons have been added into each Configuration\r\n    window to provide the navigation through the user interface panels like in\r\n    web browsers.\r\n\r\n[+] Configuration: Incremental Search box has been added into each Configuration\r\n    window. Now you can quickly discover a panel that contains the required\r\n    option just by typing several letters of what you want to find.\r\n\r\n    Search engine considers the following text information:\r\n\r\n    1) captions of user interface panels and all their sub-controls (control\r\n       hints are ignored at the moment for the sake of search speed)\r\n\r\n    2) captions of built-in and user-added objects of the following types:\r\n\r\n       - specific window settings\r\n       - window exclusions\r\n       - desktop profiles\r\n       - desktop mirrors\r\n       - virtual desktops\r\n       - Desktop Divider layouts\r\n       - Favorite Folders shortcuts\r\n       - clipboard templates\r\n       - hotkeys\r\n       - mouse actions\r\n       - Start Program shortcuts\r\n       - title buttons\r\n       - window menu commands\r\n       - combo actions\r\n\r\n[*] Configuration: Undo/Redo commands now track the changes separately for each\r\n    window.\r\n\r\n[-] If both &quot;Transparent while inactive&quot; and &quot;Transparent while mouse-hovering&quot;\r\n    options were enabled, the transparency level did not restore to\r\n    &quot;While inactive&quot; value after moving the mouse out of a window.\r\n\r\n\r\nVirtual Desktops for Effective Work\r\nIf you have a lack of workspace on the desktop, use virtual desktops included in Actual Window Manager. This tool allows you to create the desired number on virtual desktops and increase your workspace.\r\nUnlimited number of additional desktops\r\nEach virtual desktop is individual and fully-functional\r\nTwo modes of multiple monitor support: Classic and Independent\r\n\r\nFully-Functional Desktop Environment for Multiple Monitors\r\nUsing Actual Window Manager, you will have a fully-functional taskbar for each monitor and many other features to improve the multiple monitors’ desktop environment.\r\nFully-functional taskbar for each display\r\nDesktop Background and Screen Saver management\r\nAdditional mouse features for multiple monitors management\r\nDesktop profiles\r\nAnd much more...\r\n\r\nImproved Windows Folder Navigation\r\nActual Window Manager allows the use of two additional title buttons for each window. These special buttons improve Windows Folder Navigation, so you do not need to use long mouse manipulation to follow through to the desired folder.\r\nRecent Folders\r\nFavorite Folders\r\n\r\nNew Title Buttons for Improving Each Window\r\nMany additional title buttons available to you with Actual Window Manager:\r\nMinimize to the system tray\r\nMove to the next monitor\r\nAlways on top\r\nResize a window\r\nAnd much more...\r\n\r\nConfigure Each Window Individually\r\nConfigure your OS as you wish. With Actual Window Manager, you can set many parameters for each window individually.\r\nSet startup mode and position\r\nSet window priority.\r\nIgnore deactivation\r\nAnd much more...\r\n\r\nSplit Your Desktop\r\nThe divider allows you to split the entire large desktop or each monitor into several non-intersecting areas (tiles). If you place a window into one of such tiles, the window will expand up to tile’s borders only.\r\nYou can create as many custom tile layouts as you need and activate them on the fly, as circumstances require","torrent":{"xt":"urn:btih:5630480cd9614dc1d7e5b178d849884e19eabe2a","amp;dn":"Actual+Window+Manager+v8.8","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5630480cd9614dc1d7e5b178d849884e19eabe2a","infoHashBuffer":{"type":"Buffer","data":[86,48,72,12,217,97,77,193,215,229,177,120,216,73,136,78,25,234,190,42]},"announce":[],"urlList":[]}}