{"title":"Stargate SG-1 - Season 08 - Episodes 1 thru 11","uid":14271551,"size":6332789264,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5737716235d8db66da20c54f266047485e021b8e&amp;dn=Stargate+SG-1+-+Season+08+-+Episodes+1+thru+11&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":38,"time":1460315610,"description":"Stargate SG-1 - Season 08 - Episodes 1 thru 11\r\n\r\noadcasted episodesEdit\r\nImage \tTitle \tNumber \tAirdate \tPlanet(s) \tRace(s) \tEnemies\r\nNew Order (Part 1) \t&quot;New Order (Part 1 of 2)&quot; \t801 \tJuly 9, 2004 \tEarth, Hala, Orilla \tAsgard, Goa'uld, Replicator \tFifth\r\nThe Stargate Program is halted after Dr. Elizabeth Weir is in charge, even though Colonel Jack O'Neill is still in stasis in Antarctica. Eventually, they are allowed to send O'Neill to the Asgard in Othala to save O'Neill, but learn that the Replicators are back, and have taken Major Samantha Carter prisoner. Meanwhile, Dr. Daniel Jackson is to stay and negotiate with System Lords Amaterasu, Camulus and Yu.\r\nNewOrderPart2 \t&quot;New Order (Part 2 of 2)&quot; \t802 \tJuly 9, 2004 \tEarth, Orilla \tAsgard, Goa'uld, Replicator \tFifth\r\nColonel Jack O'Neill's knowledge of the Ancients has managed to form a means to defeat the Replicators. Major Samantha Carter is still held prisoner by Fifth, who admits that he loves her. On Earth, the three System Lords test the operation of the weapon in Antarctica, by sending a ship to Earth. Later Dr. Daniel Jackson is also sent to Othala to fight the Replicators.\r\nLockdownstargate \t&quot;Lockdown&quot; \t803 \tJuly 23, 2004 \tEarth, KS7-535 \tN/A \tAnubis\r\nAfter Jack O'Neill is promoted to Brigadier General and commander of Stargate Command, and months after defeating Anubis' fleet, the Russians are combing the wreckage, where they encounter a strange entity. Later, the entity makes its way to the SGC to get out of Earth.\r\nZero Hour (Stargate SG-1) \t&quot;Zero Hour&quot; \t804 \tJuly 30, 2004 \tEarth, P2X-887 \tJaffa \tBa'al\r\nBrigadier General Jack O'Neill has second thoughts about being the leader of Stargate Command. Also, an alien plant takes control of part of the SGC, and SG-1 is kidnapped by Ba'al.\r\nSG1AaronDoral \t&quot;Icon&quot; \t805 \tAugust 6, 2004 \tEarth, Tegalus \tTegalan \tSoren\r\nDr. Daniel Jackson is declared MIA after he was in the middle of a World War on Tegalus, and the rebels have won. Jackson cannot reach home, as they have taken control of the planet's Stargate, and he relies on a small band of soldiers led by Jared Kane from the planet's military to take back the city, and defeat the rebel leader, Soren.\r\nAvatarstargate \t&quot;Avatar&quot; \t806 \tAugust 13, 2004 \tEarth \tKull \tN/A\r\nTeal'c tests the Virtual reality pods from P7J-989 SG-1 encountered six years ago, to simulate a Kull invasion of Stargate Command. The test is a success, but when the difficulty level increases, Teal'c gets stuck in the simulation, and the amount of times he dies will eventually get him killed in reality.\r\nAffinity \t&quot;Affinity&quot; \t807 \tAugust 20, 2004 \tEarth \tN/A \tThe Trust\r\nTeal'c moves into an apartment with the public, but his attempts to reduce crime in his area often lands him in trouble. While he befriends a local woman, Lt. Colonel Samantha Carter continues her relationship with Pete Shanahan.\r\nCovenant \t&quot;Covenant&quot; \t808 \tAugust 27, 2004 \tEarth, P4X-650 \tAsgard \tThe Trust\r\nWhen Alec Colson, a wealthy industrialist intends on letting the public know of the existence of alien life after finding evidence on the Battle of Antarctica, Lt. Colonel Samantha Carter attempts to intervene and convince him that Stargate Command is too important to be revealed. However, the SGC is not the only secretive organization that wants to silence Colson.\r\nSacrifices \t&quot;Sacrifices&quot; \t809 \tSeptember 10, 2004 \tEarth, Hak'tyl \tHak'tyl Resistance, Jaffa \tMoloc\r\nThe Hak'tyl Resistance plans on moving to another planet after Moloc finds out about the resistance. Rya'c intends to marry one of the Hak'tyl members. Teal'c and Ishta have an opportunity to take out Moloc.\r\nSg1-s08e10-0 \t&quot;Endgame&quot; \t810 \tSeptember 17, 2004 \tEarth, P3S-114, P4X-650 \tJaffa, Tok'ra \tThe Trust\r\nEarth's Stargate goes missing after it is beamed away. Outside Earth, the Alpha Site loses contact with Earth and suspects something is wrong, while Teal'c finds out that every Jaffa on a planet is killed with no signs of battle. The rest of the team discover that The Trust is responsible for the missing Stargate","torrent":{"xt":"urn:btih:5737716235d8db66da20c54f266047485e021b8e","amp;dn":"Stargate+SG-1+-+Season+08+-+Episodes+1+thru+11","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5737716235d8db66da20c54f266047485e021b8e","infoHashBuffer":{"type":"Buffer","data":[87,55,113,98,53,216,219,102,218,32,197,79,38,96,71,72,94,2,27,142]},"announce":[],"urlList":[]}}