{"title":"fantasy novel Azaroth &amp; Sefalin.book1.doc","uid":14280779,"size":708608,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:580c241954af4e58887de6d2df8025413bd631ca&amp;dn=fantasy+novel+Azaroth+%26amp%3B+Sefalin.book1.doc&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"codauma","files":1,"time":1460354600,"description":"&quot;Guardians of the Galaxy meets Game of Thrones&quot;\r\n\r\nOrphaned, then apprenticed to an imperial sorcerer unjustly toppled from grace, the wizard Azaroth has one obsession: locate, steal and use the Coda Uma.\r\n\r\nGuarded by a zealous warrior knighthood of continental renown, the omnipotent evil of the Coda Uma has rested hidden and reviled since the Twilight, when the light of the world was very nearly snuffed out by it.\r\n\r\nHe involves that infamous rake, his best friend Sefalin, the black sheep and first prince of the Rowender. Who else but this famed and feared pair could be so wildly brazen – and misguided? Yet someone else, bent on a different kind of revenge, lies in ambush, and that is when all hell breaks loose.\r\n\r\nLiterally.\r\n\r\nSefalin has made errors and raised ire before, but not like this. As for Azaroth, he made no plans for the explosion of catastrophic events set in motion. Exhausted, hunted relentlessly from all sides, separated and scattered across a world riven by what is now unleashing itself - horrific wars, the Wasting Disease, a cannibalistic horde and hideous monstrosities boiled up from the abyss of time and space - can they  steal again what they want to be rid of while evading their enemies (everyone), and if they can, where can they hide what wants to be found and cannot be concealed?\r\n\r\nAn account of love that endures, friendship that transcends and an apocalypse that will reveal the greatest casualty of all","torrent":{"xt":"urn:btih:580c241954af4e58887de6d2df8025413bd631ca","amp;dn":"fantasy+novel+Azaroth+%26amp%3B+Sefalin.book1.doc","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"580c241954af4e58887de6d2df8025413bd631ca","infoHashBuffer":{"type":"Buffer","data":[88,12,36,25,84,175,78,88,136,125,230,210,223,128,37,65,59,214,49,202]},"announce":[],"urlList":[]}}