{"title":"Lonely Planet - Coastal California - 4th Edition.epub Gooner","uid":13502370,"size":48466240,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:589298afd04e3cd60b6d8151a24374f191a0340a&amp;dn=Lonely+Planet+-+Coastal+California+-+4th+Edition.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1455214640,"description":"Lonely Planet - Coastal California (Travel Guide) - 4th Edition (2012).epub Gooner\r\n\r\nPublisher: Lonely Planet; 4 edition (April 1, 2012)\r\nLanguage: English\r\nISBN-10: 1741799813\r\nISBN-13: 978-1741799811\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Coastal California is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Ride the cable car around San Francisco, discover hidden hot springs along the rocky Big Sur coast, or unleash your inner child at Disneyland; all with your trusted travel companion. Get to the heart of Coastal California and begin your journey now!\r\n\r\nInside Lonely Planet Coastal California Travel Guide:\r\n\r\nColor maps and images throughout\r\nHighlights and itineraries help you tailor your trip to your personal needs and interests\r\nInsider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\nEssential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\nHonest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\nCultural insights give you a richer, more rewarding travel experience - culture, history, art, literature, film, music, architecture, politics, landscapes, wildlife, cuisine, and wine\r\nOver 71 local maps\r\nUseful features - including Walking Tours, Month-by-Month (annual festival calendar), and Travel with Children\r\nCoverage of San Francisco, Los Angeles, San Diego, Disneyland, Orange County, the Central Coast, Marin County, the Bay Area, Napa, Sonoma, the North Coast, Anaheim, and more\r\nThe Perfect Choice: Lonely Planet Coastal California, our most comprehensive guide to Coastal California, is perfect for both exploring top sights and taking roads less traveled.\r\n\r\nLooking for a guide focused on San Francisco or Los Angeles and San Diego? Check out Lonely Planet's San Francisco guide or Los Angeles, San Diego &amp; Southern California guide for a comprehensive look at all that these cities have to offer, or Discover San Francisco, a photo-rich guide to the city's most popular attractions, or Pocket San Francisco or Pocket Los Angeles, handy-sized guides focused on the can't-miss sights for a quick trip.\r\nLooking for more extensive coverage? Check out Lonely Planet's California guide for a comprehensive look at all the state has to offer or Lonely Planet's Discover California, a photo-rich guide to the state's most popular attractions.\r\nAuthors: Written and researched by Lonely Planet, Sara Benson, Andrew Bender, Alison Bing, Nate Cavalieri, Bridget Gleeson, Beth Kohn, and John A Vlahides.\r\n\r\nAbout Lonely Planet: Since in 1973, Lonely Planet has become the world's leading travel content company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveler community. Lonely Planet enables curious travelers to experience the world and get to the heart of the places they find themselves in","torrent":{"xt":"urn:btih:589298afd04e3cd60b6d8151a24374f191a0340a","amp;dn":"Lonely+Planet+-+Coastal+California+-+4th+Edition.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"589298afd04e3cd60b6d8151a24374f191a0340a","infoHashBuffer":{"type":"Buffer","data":[88,146,152,175,208,78,60,214,11,109,129,81,162,67,116,241,145,160,52,10]},"announce":[],"urlList":[]}}