{"title":"Nanomaterials and Nanocomposites","uid":14521152,"size":15693911,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58bf6ba4b1798c0ddbc9f6bc8a85883dab18dec0&amp;dn=Nanomaterials+and+Nanocomposites&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1462389589,"description":"Nanomaterials and Nanocomposites - Zero- to Three-Dimensional Materials and Their Composites (Wiley-VCH, 2016).pdf\r\n\r\nISBN 978-3-527-33780-4\r\n\r\nNanomaterials are defined as materials in which at least one length dimension is below 100 nanometers. In this size regime, these materials exhibit particular - and tunable - optical, electrical or mechanical properties that are not present at the macro-scale. This opens up the possibility for a plethora of applications at the interface of materials, chemistry, physics and biology, many of which have already entered the commercial realm. When nanomaterials are blended with other materials not necessarily in the nanometer regime, the resulting nanocomposites can exhibit dramatically different properties than the bulk material alone, leading to an enhanced performance in terms of, for example, increased thermal and mechanical stability.\r\n\r\nThis book presents the synthesis, characterization and applications of nanomaterials and nanocomposites, covering zero-dimensional, elemental nanoparticles, one-dimensional materials such as nanorods and nanowhiskers, two-dimensional materials such as graphene and boron nitride as well as three-dimensional materials such as fullerenes, polyhedral oligomers and zeolites, complemented by bio-based nanomaterials, e.g., cellulose, chitin, starch and proteins. Introductory chapters on the state-of-the-art of nanomaterial research and the chemistry and physics in nanoscience and nanotechnology round off the book","torrent":{"xt":"urn:btih:58bf6ba4b1798c0ddbc9f6bc8a85883dab18dec0","amp;dn":"Nanomaterials+and+Nanocomposites","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58bf6ba4b1798c0ddbc9f6bc8a85883dab18dec0","infoHashBuffer":{"type":"Buffer","data":[88,191,107,164,177,121,140,13,219,201,246,188,138,133,136,61,171,24,222,192]},"announce":[],"urlList":[]}}