{"title":"Strict Restraint Redux - STRR - Mar 14, 2016 - Skyler Blake","uid":14129159,"size":679741431,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:58fe4bafd5709942ba6a4676e8d429c03a21e4f8&amp;dn=Strict+Restraint+Redux+-+STRR+-+Mar+14%2C+2016+-+Skyler+Blake&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":354,"time":1459535441,"description":"&quot;Skyler's Extreme Submission&quot; \r\nStrict Restraint : Redux\r\n Skyler Blake\r\n\r\nMp4 720p + Pics. \r\n\r\nSkyler is naked as we interview her about her prvious bondage shoots...she was a bondage rookie, but she was a natural slave, and after this shoot, Skyler would prove to be a pro...We lock her wrists and neck into a steel stock...we lift her onto a bar which protrudes from the standing bar and all her weight is on her cunt...we chain up the stocks and use a ratchet to pull her feet down...Sklyer is immobile and helpless the Pope whips her tits, tummy and thighs...he uses a pinwheel to torment her soft skin and he tightens the ratchet, puling her down hard on her cunt before he leaves...in the next scene we decide to have Skyler straddle another object...this time all her wieght is placed on a Sybian...we insert the dildo and lock her wrists out...her neack is held by a wooden stock and once again, her feet are pulled down to keep her cunt on the powerful vibrating mechanism...the Pope turns it up slowly as he whips her ass...then pegs on her ribs...he leaves Skyler to cum over and over, unable to get away from the Sybian monster...in the last scene, Skyler is laid on her back and her feet and wrists are pulled up into a wooden stock...he pussy is well exposed and her mouth is held open by a dental gag...TENS pads are placed on her ass and feet and the Pope plays with the current as the scene progresses...he uses a cane to toy with her...then a steel speculum is inserted and opened inside her cunt...the Pope brings her to orgasm as Skyler writhes...The saga continues for Skyler Blake as she is placed flat on her back a wooden table. The Pope has shackled her neck, wrists and ankles to the wood... The Invader's head is primed with Skyler's sopping pussy juice and inserted in her cunt. She is gagged with a dildo to muffle her moans. The Invader is started and works it's way in and out of Skyler's pussy. As the fucking machine picks up steam, The Pope applies a magic wand to her clit. The Pope spatters Skyler's tits and torso with molten hot wax. The combination of conflicting senses, cause Skyler to bite through her gag in orgasm... Still covered in wax, Skyler is made to stand, hands shackled overhead, legs in a spreader bar by The Pope. Ogre and an unknown cronie enter to assist... Skyler has her head and face covered in a stocking and her mouth taped shut as she is groped and fondled and spanked... \r\n \r\n Screens \r\n \nhttp://www.dungeoncorp.com/updates16/SRD/SKY_050307/index.php\r\n\r\n Uploaded by Merzedes and Shallow2\r\n\r\n 20 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\n Just keep on leaving us the nice comments below and we are happy :)Any Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg\r\n\r\n Cheers","torrent":{"xt":"urn:btih:58fe4bafd5709942ba6a4676e8d429c03a21e4f8","amp;dn":"Strict+Restraint+Redux+-+STRR+-+Mar+14%2C+2016+-+Skyler+Blake","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58fe4bafd5709942ba6a4676e8d429c03a21e4f8","infoHashBuffer":{"type":"Buffer","data":[88,254,75,175,213,112,153,66,186,106,70,118,232,212,41,192,58,33,228,248]},"announce":[],"urlList":[]}}