{"title":"Who Moved The Stone mobi","uid":14347854,"size":2843449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5be25fee4e8ebe1b78e41714e37276eb693725e3&amp;dn=Who+Moved+The+Stone+mobi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"malsi2","files":1,"time":1460999236,"description":"&quot;WHO MOVED THE STONE?&quot; or &quot;who ROLLED away the stone?&quot; (Mark 16:3) is a Question, which has worried theologians for the past two thousand years. Mr. Frank Morison, a prominent Bible scholar, tried to nail down this ghost(s) in a book bearing the same title as this tract. Between 1930 and 1975 his book has gone through ELEVEN editions. Through all his 192 pages of conjectures he failed to answer,&quot;WHO MOVED THE STONE?&quot; (Faber and Faber, London). On page 89 of his book, he writes, &quot;We are left, therefore, with the problem of the vacant tomb unsolved&quot; and proceeds to advance SIX hypotheses, very nearly knocking the proverbial nail on the head with his FIRST supposition, i.e. &quot;THAT JOSEPH OF ARIMATHEA SECRETLY REMOVED THE BODY TO A MORE SUITABLE RESTING PLACE&quot;. After confessing that this Joseph &quot;might himself have removed it for private reasons to another place, is one which seems to carry considerable weight&quot; (italics mine), he hurriedly disposes this hypothesis on the flimsiest ground. As you read on, dear reader, I trust that you as well as Mr Morison will have a satisfactory answer to this problem. Let us begin at the beginning of this problem","torrent":{"xt":"urn:btih:5be25fee4e8ebe1b78e41714e37276eb693725e3","amp;dn":"Who+Moved+The+Stone+mobi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5be25fee4e8ebe1b78e41714e37276eb693725e3","infoHashBuffer":{"type":"Buffer","data":[91,226,95,238,78,142,190,27,120,228,23,20,227,114,118,235,105,55,37,227]},"announce":[],"urlList":[]}}