{"title":"The Skyscraper Throne Series - Tom Pollock","uid":14376265,"size":2079273,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c5842acb2de5da695fd3ce582b05dc7ef8e4e43&amp;dn=The+Skyscraper+Throne+Series+-+Tom+Pollock&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":9,"time":1461197248,"description":"01. The City's Son [The Skyscraper Throne, #1] - Tom Pollock\r\n\r\n\r\n\r\n&quot;Glittering and gritty . . . Gorgeously written and brimming with bizarre urban creatures, this darkly imagined and sometimes painful tale should delight fans of Neil Gaiman, China Miéville, and Holly Black.&quot; ―PUBLISHERS WEEKLY,\r\n\r\nRunning away from her traitorous best friend and her distant father, teenage graffiti artist Beth Bradley is looking for a new home. What she finds is Filius, the ragged crown prince of London’s underworld―a place where glassy spiders steal voices on telephone wires, railwraiths terrorize the train tubes, and deadly scaffwolves stalk the shadows.\r\n\r\nReach, the malign god of demolition, is on a rampage, destroying the creatures of hidden London to lay claim to the skyscraper throne. Caught up in helping Filius raise an alleyway army to battle Reach, Beth soon forgets her old life. But when the enemy claims her best friend, Beth must choose between the acceptance she finds in the streets and the life she left behind.\r\n\r\n02. The Glass Republic [The Skyscraper Throne, #2] - Tom Pollock\r\n\r\n\r\n\r\nThe Glass Republic is the gripping sequel to The City's Son, and the second book of The Skyscraper Throne trilogy.\r\n\r\nPen's life is about secrets: the secret of the city's spirits, deities and monsters, living just beyond the notice of modern Londoners; the secret of Pen's intricate scars that disfigure her so cruelly; and the most closely guarded secret of all: Parva, her mirror-sister, forged from her reflections in a school bathroom mirror.\r\n\r\nPen's reflected twin is the only girl who really understands her. Then Parva is abducted and Pen makes a terrible bargain to track her down. In London-Under-Glass, looks are currency, and Pen's scars make her a rare and valuable commodity. But some in the reflected city will do anything to keep Pen from the secret of what happened to the sister who shared her face.\r\n\r\n\r\n\r\n03. Our Lady of the Streets [The Skyscraper Throne, #3] - Tom Pollock\r\n\r\n\r\nEver since Beth Bradley found her way into a hidden London, the presence of its ruthless goddess, Mater Viae, has lurked in the background. Now Mater Viae has returned with deadly consequences. Streets are wracked by convulsions as muscles of wire and pipe go into spasm, bunching the city into a crippled new geography; pavements flare to thousand-degree fevers, incinerating pedestrians; and towers fall, their foundations decayed. As the city sickens, so does Beth―her essence now part of this secret London. But when it is revealed that Mater Viae's plans for dominion stretch far beyond the borders of the city, Beth must make a choice: flee, or sacrifice her city in order to save it","torrent":{"xt":"urn:btih:5c5842acb2de5da695fd3ce582b05dc7ef8e4e43","amp;dn":"The+Skyscraper+Throne+Series+-+Tom+Pollock","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c5842acb2de5da695fd3ce582b05dc7ef8e4e43","infoHashBuffer":{"type":"Buffer","data":[92,88,66,172,178,222,93,166,149,253,60,229,130,176,93,199,239,142,78,67]},"announce":[],"urlList":[]}}