{"title":"musica eletronica","uid":14129281,"size":11598108160,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5ce503a2fd8a154668194d37a6cd303e6c9a1087&amp;dn=musica+eletronica&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"silva.com","files":1,"time":1459537795,"description":"A música eletrónica (português europeu) ou eletrônica (português brasileiro) é toda música que é criada ou modificada através do uso de equipamentos e instrumentos electrónicos,[1] tais como sintetizadores, gravadores digitais, computadores ou softwares de composição. Os softwares são desenvolvidos de forma a facilitar a criação. Por sua história passou de uma vertente da música erudita (fruto do trabalho de compositores visionários) a um elemento da música popular, primeiramente bastante relacionado ao rock e posteriormente discernindo-se como um gênero musical próprio (principalmente relacionado com a música popular nos sub-estilos considerados dançantes tais como o techno, acid, house, trance e drum 'n' bass, desenvolvidos a partir do auge da música disco no final da década de 1970). Atualmente existem várias ramificações do estilo, tanto eruditas como populares.\r\n\r\nOriginalmente relutada por ter sua tecnologia evoluída muito mais rapidamente que sua estética, só passou a ter princípios e tradição após a Segunda Guerra Mundial,[1] com o trabalho de franceses na música concreta e de alemães na Elektronische Musik.\r\n\r\nobs.: É importante salientar que, por definição, música eletrônica é toda música criada através do uso de equipamentos e instrumentos eletrônicos. Entretanto, a partir da grande popularização da música eletrônica dançante a partir da década de 1980, esta passou a ser conhecida pelo público geral pela denominação simples de música eletrônica, o que prevalece até hoje","torrent":{"xt":"urn:btih:5ce503a2fd8a154668194d37a6cd303e6c9a1087","amp;dn":"musica+eletronica","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ce503a2fd8a154668194d37a6cd303e6c9a1087","infoHashBuffer":{"type":"Buffer","data":[92,229,3,162,253,138,21,70,104,25,77,55,166,205,48,62,108,154,16,135]},"announce":[],"urlList":[]}}