{"title":"Digimon Adventure Tri 2 - Determination 1-4","uid":14331174,"size":726844649,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5ea341e9edbb3a5a366b1bc012bc49af08fe2206&amp;dn=Digimon+Adventure+Tri+2+-+Determination+1-4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"d0uble3dg3dflam3","files":1,"time":1460683691,"description":"From WIKIPEDIA:\r\nKetsui (&quot;Determination&quot;)\r\nWhile Joe stays home to study for his exams, the Digidestined and their Digimon go on a trip to a hot spring inn, where they come across Nishijima and Himekawa. During the trip, the girls get into a bit of a mishap when Biyomon and Meicoomon are separated from them and wind up in the mens' baths. Following the trip, Himekawa and Nishijima test out specialized weapons against an appearing infected Ogremon, who is taken back to the Digital World by Leomon. Later, as Mimi prepares for a cheer girl café for her class in the upcoming school festival, she tries to fight against the infected Ogremon when it appears in the hopes of improving the Digimon's reputation, only for Togemon's attacks to inadvertently cause a nearby news helicopter to crash, resulting in the opposite effect. While Leomon approaches the DigiDestined, explaining what happened to Ogremon when he became infected, Mimi is further scolded by her classmates for her seemingly selfish ideas. As Mimi laments how selfish she's been, she hears from Joe about how he's been avoiding battles with the Digimon to try and fit into adulthood, lamenting his own cowardice.\r\n\r\nAs Gomamon decides to run away from home, Koshiro receives an ominous message in digital code. On the day of the school festival, Meiko shows Mimi her support by wearing her cheer girl outfit for the café, while the Digimon sneak into the festival to try and win a costume contest for free food. Afterwards, Gomamon tells Joe that he ran away because he felt he didn't want to fight together anymore, leading Joe to get angry about having to fight and storming off. Just then, Meicoomon is captured by Ken Ichijouji, who appears to have once again become the Digimon Emperor. As Palmon and Gomamon, along with a partially infected Leomon, chase after them into the digital distortion, coming up against an infected Imperialdramon, Hikari urges Joe to fight by his partner's side. Overcoming his own worries for the sake of his partner, Joe manages to digivolve Gomamon into his Mega level form, Vikemon, while Mimi also manages to digivolve Palmon into her Mega level form, Rosemon. Although the Digimon manage to defeat Imperialdramon and return safely, Meicoomon suddenly becomes hostile, killing Leomon and escaping into the Digital World.\r\n\r\nWEBRip, 800*640, Jap. Dub, Eng. Sub\r\n\r\nJust to get everyone by until better quality torrents arrive :)","torrent":{"xt":"urn:btih:5ea341e9edbb3a5a366b1bc012bc49af08fe2206","amp;dn":"Digimon+Adventure+Tri+2+-+Determination+1-4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ea341e9edbb3a5a366b1bc012bc49af08fe2206","infoHashBuffer":{"type":"Buffer","data":[94,163,65,233,237,187,58,90,54,107,27,192,18,188,73,175,8,254,34,6]},"announce":[],"urlList":[]}}