{"title":"An Introduction Chemistry Of The Silicones - Eugene G. Rochow","uid":14417879,"size":7661941,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:635df6341d5aa97510c9043d5f29c9b9875eff94&amp;dn=An+Introduction+Chemistry+Of+The+Silicones+-+Eugene+G.+Rochow&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1461510134,"description":"An Introduction Chemistry Of The Silicones - Eugene G. Rochow (Wiley, 1947).pdf\r\n\r\nThe organic compounds of silicon, which have been the subject of many scholarly researches during the past 80 years, at last show promise of emerging from the laboratory and finding a place in industry. An understanding of the behaviour of organosilicon materials is necessary to their intelligent use and, inasmuch as the chemistry of these substances ordinarily is not treated in our textbooks, it is possible that a compact yet comprehensive survey of our present knowledge in this field would be of service to chemists, engineers, and industrial designers. This volume has just such a purpose. The first few chapters review the silanes and their derivatives in some detail, in order to provide an understanding of the fundamental chemistry of the nonsilicate compounds of silicon. The later chapters emphasize the silicone polymers which have achieved commercial importance and deal with the methods for their preparation, their chemical and physical properties, and their possible uses. The processes available for large-scale production are treated separately, and a review of methods of analysis is included","torrent":{"xt":"urn:btih:635df6341d5aa97510c9043d5f29c9b9875eff94","amp;dn":"An+Introduction+Chemistry+Of+The+Silicones+-+Eugene+G.+Rochow","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"635df6341d5aa97510c9043d5f29c9b9875eff94","infoHashBuffer":{"type":"Buffer","data":[99,93,246,52,29,90,169,117,16,201,4,61,95,41,201,185,135,94,255,148]},"announce":[],"urlList":[]}}