{"title":"De L'autre Cote 2002 DVDRip Sonata Premiere","uid":14271576,"size":1296365717,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:662ba54a5c3cbab1e5794e2434f8e3f4a8ed35c5&amp;dn=De+L%27autre+Cote+2002+DVDRip+Sonata+Premiere+++&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kleen2","files":2,"time":1460316354,"description":"The story is old as the hills, yet every day it continues to unfold, every day more terribly.Sometimes poor people, in an attempt to survive, risk their lives and leave everything behind to live elsewhere. But they're not wanted elsewhere. And if they are wanted it's for their labor, to do jobs that no one wants to do. Some will pay for others to do those jobs, but not much.In FROM THE OTHER SIDE, elsewhere is the United States and the poor are mostly Mexicans. Renowned filmmaker Chantal Akerman shifts her focus between the border towns of Agua Prieta, Sonora, where people from all over Mexico wait in limbo before crossing over, and neighboring Douglas, Arizona, a town ringed by mountains and desert plains.For years, immigrants passed through San Diego. But now the INS, using cutting edge technologies developed during the Vietnam War and perfected for the Gulf War, has managed to quell the flow of illegals there. This leaves only the mountains and deserts of Arizona for those desperate enough to try their luck.The film opens with a series of interviews with Mexicans in Agua Prieta, many of whom have family members that have perished while crossing the border. In another interview, a local sheriff in Arizona comments on the government's crackdown as &quot;a bad strategy and a bad plan,&quot; calling the elevated death toll &quot;a calculated consequence.&quot;The INS calculated that the hardship and danger, the cold and the heat in Arizona, would stop the crossings, but you can't stop someone who's hungry. But you fear him. Fear the other; fear his filth, the disease he may be bringing in. Fear invasion. But never fear to kill him. -- © First Run/Icarus Films","torrent":{"xt":"urn:btih:662ba54a5c3cbab1e5794e2434f8e3f4a8ed35c5","amp;dn":"De+L%27autre+Cote+2002+DVDRip+Sonata+Premiere+++","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"662ba54a5c3cbab1e5794e2434f8e3f4a8ed35c5","infoHashBuffer":{"type":"Buffer","data":[102,43,165,74,92,60,186,177,229,121,78,36,52,248,227,244,168,237,53,197]},"announce":[],"urlList":[]}}