{"title":"Cats.v.Dogs.Which.is.Best--BBC-2016-w.subs-468p","uid":13505623,"size":1327861691,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:69aba31b73b87aed4d85857090056ca6af1fd9a0&amp;dn=Cats.v.Dogs.Which.is.Best--BBC-2016-w.subs-468p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uggauga","files":4,"time":1455237306,"description":"Cats v Dogs: Which is Best?\r\n\r\nArmed with the latest global scientific research, Chris Packham and Liz Bonnin battle it out to find the definitive answer to the burning question - which are best, cats or dogs?\r\n\r\nBBC (2016) - 2 Episodes\r\n\r\n_______________________________________\r\n\r\n832x468 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nEpisode 1\r\nBased at one of Britain's largest cat and dog veterinary centres, Chris and Liz go head to head to test different aspects of each animal. A specially commissioned nationwide pet census also reveals exactly how the public feel about our canine chums and feline friends. Round one begins with intelligence as Chris and Liz find out whether either species can understand numbers. In Vienna, Chris is astonished to discover that dogs can discriminate between higher and lower numbers of dots and in a UK first, Liz tries out the test on cats with surprising results.\r\nRound two tests their sensory powers to work out which animal has the better vision, sense of smell and hearing. Our cats and dogs have to negotiate a maze in the dark, but which one will find their way through in the fastest time? Chris challenges top sniffer dog Boris to find him in a distracting busy city and discover which species has the widest range of hearing. The final round looks at whether cats or dogs are the most physically agile by testing which can jump the highest, which is the fastest sprinter and which the best endurance runner. With so many ground-breaking tests, who will be in the lead at the end of episode one?\r\nOn their search for answers, Chris comes face to face with a pack of wolves whilst Liz confronts an Arabian wild cat to discover how the relationships between cats and dogs and humans have evolved. Together, they put our favourite pets under the microscope to see what really makes them tick and crucially, how they compare with each other.\r\n\r\nEpisode 2\r\nChris Packham and Liz Bonnin battle it out over five more rounds as they put our favourite pets through their paces, beginning with which animal is easier to train. Chris uncovers brand new research in Budapest which suggests that dogs' brains may actually respond positively to our praise, which could make them easier to train. Not to be outdone, Liz meets an amazing cat called Cosmos who can choose his own TV channels.\r\nRound two looks at communication. Chris knows that humans can understand most dog barks, but how well do cat owners understand cat meows? Liz puts them to the test. Border collie Gable can recognise over 150 words, and in Vienna, Chris discovers whether dogs can distinguish between happy and sad human faces.\r\nIn round three, Liz runs her version of the 'stress factor' where, along with a team of researchers, she finds out which is better at reducing our stress, a cat or a dog.\r\nRound four is about independence. Liz meets Bob, a cheeky roving cat with several owners. Closer to home, Chris is dismayed to see his own poodles display signs of anxiety when he leaves the house.\r\nThe final round looks at the big question: do our cats and dogs really love us? The love hormone oxytocin has already been studied in dogs. But in a world first, the programme looks at oxytocin in cats too. Chris and Liz get the exclusive results of this groundbreaking new research at the end of the series and reveal some surprising new science about how we bond with our pets. Chris and Liz sum up their findings, but who will come out on top, the cats or the dogs?","torrent":{"xt":"urn:btih:69aba31b73b87aed4d85857090056ca6af1fd9a0","amp;dn":"Cats.v.Dogs.Which.is.Best--BBC-2016-w.subs-468p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69aba31b73b87aed4d85857090056ca6af1fd9a0","infoHashBuffer":{"type":"Buffer","data":[105,171,163,27,115,184,122,237,77,133,133,112,144,5,108,166,175,31,217,160]},"announce":[],"urlList":[]}}