{"title":"Best Laid Plans Series - Nathan Jones","uid":13553142,"size":1861941,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69b16cb7dd709f034e4dba692fbb484cddd9fb87&amp;dn=Best+Laid+Plans+Series+-+Nathan+Jones&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":9,"time":1455572853,"description":"01. Fuel [Best Laid Plans, #1] - Nathan Jones\r\n \r\nTrevor Smith has a pretty good idea of the razor's edge modern society walks, with the vast majority of people completely dependent on a reliable sources of electricity and gas with everything being shipped to them at the last possible instant. When a major attack cripples the US's oil refining capabilities and destroys a significant portion of US fuel reserves the nation practically runs out of gas overnight. It's time to see if the preparations he and his cousin Lewis Halsson have made in their hometown of Aspen Hill are enough to carry them through the disaster.\r\n\r\nHis friend Matt Larson isn't quite so fortunate, caught unprepared and unaware of the grim reality of the situation when a society completely dependent on fuel runs out. He finds himself struggling to adjust as everything falls apart around him and fleeing one step ahead of the chaos to reach Aspen Hill. Now he must depend on his own strength and ingenuity and the help of family and friends to see him through.\r\n\r\nYet even Matt can consider himself lucky compared to most, because the vast majority of people living in the nation's cities are on the move, fleeing population centers in all directions with no food and nowhere to go as starvation looms. Meanwhile emergency services scramble to stay ahead of the disaster with insufficient resources, faced with the impossible prospect of aiding tens or even hundreds of millions of desperate refugees.\r\n\r\nA number of those refugees are making their way to Aspen Hill, which presents a crisis of its own for a town that has nothing to spare and is struggling to care for its own.\r\n\r\n02. Shortage [Best Laid Plans, #2] - Nathan Jones\r\n \r\nMost of the major cities in the nation have been totally destroyed by riots. Millions upon millions of refugees flee population centers in every direction, desperate to find some safe haven before the first snows of winter. Organized relief efforts are breaking down due to lack of resources, leaving relief workers stranded wherever they've ended up, in the same plight as the refugees around them.\r\n\r\nTrevor Smith and his cousin Lewis Halsson have lost most of what they'd prepared to weather the disaster, including the shelter they built, and are making for the mountains. There they'll test their skills and ingenuity against far harsher conditions than they'd face in the valley below.\r\n\r\nMeanwhile their friend Matt Larson and his family, left behind in the small town of Aspen Hill, face their own worries. Thanks to Ferris and his soldiers the town's insufficient food supplies are being shared out to the nearby refugee camp, threatening to leave everyone starving before winter even begins. The gang operating out of the refugee camp is also causing trouble, harboring a deep bitterness for the town that wouldn't let them in.\r\n\r\nAnd over all other worries looms the approaching winter that few seem ready for. Those fortunate to survive it must then worry about planting crops and lasting until harvest, with potentially greater problems looming on the horizon.\r\n\r\n03. Invasion [Best Laid Plans, #3] - Nathan Jones\r\n \r\nWith the arrival of spring people are on the move again. That includes Trev, who faces the daunting trip from Utah to Michigan to reach his family. He has half the country to cross, racing the clock against the deadline of a possible Gold Bloc invasion from the north. If that happens his destination will be right in the path of advancing enemy forces.\r\n\r\nHe's left his cousin Lewis and their friends back in Aspen Hill facing a far more immediate threat, as well equipped raiders circle the town looking for an opportunity to attack. The enemy shows no signs of going anywhere, and townspeople already struggling with starvation and harsh conditions find themselves unable to worry about finding food or growing crops while facing this threat. Matt, in charge of the town's defenses, must find a way to defeat the raiders while there's still a town to protect.\r\n\r\nOver it all looms the specter of war, threatening everything the cousins and the people of Aspen Hill have worked for as they struggle to survive and protect those they care about","torrent":{"xt":"urn:btih:69b16cb7dd709f034e4dba692fbb484cddd9fb87","amp;dn":"Best+Laid+Plans+Series+-+Nathan+Jones","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69b16cb7dd709f034e4dba692fbb484cddd9fb87","infoHashBuffer":{"type":"Buffer","data":[105,177,108,183,221,112,159,3,78,77,186,105,47,187,72,76,221,217,251,135]},"announce":[],"urlList":[]}}