{"title":"Slime Jumper (NoCrack) - TheDarkKnight","uid":14316160,"size":94547967,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6d3c324b1b548eda1cef09b88d277e7600970dc9&amp;dn=Slime+Jumper+%28NoCrack%29+-+TheDarkKnight&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"batknight2016","files":1,"time":1460581352,"description":"I am uploading this for anyone who knows how to crack this please do so and share it with the community i bought it because no one else has shared it and now id like to give it to the people who want it. Its a decent very hard platformer with local multiplayer. The game needs a bit of fine tuning but will be fixed right up with a update.\r\n \nhttp://store.steampowered.com/app/408240/\r\n\r\nOverview\r\n\r\nSlime Jumper is a Jump 'n Run somewhere between Super Mario and Super Meat Boy. It is a cool platformer, where you have to dodge a lot of things, or you must not run into them. On the one hand there are for example spikes, which you have to avoid, on the other hand there are bullets, wrecking balls, etc you have to dodge or use cleverly to pass the level. \r\nGameplay\r\n\r\nIn these level there are 3 stars you can collect. When you pass the level you always get one star plus all collected stars. With these stars you can buy new slimes, which have different abilities, for example jumping higher. You also can place up to 3 (5 in boss level) checkpoints, so when you die, you don't have to start from the beginning. However you will loose all stars, when you die, even if you already collected them and placed a checkpoint, so there is still the attraction to complete (nearly) the whole level at once. \r\nThere are 15 level per world. The last level in each world is a boss level! \r\nTotally there are 6 worlds at the moment, so you can play 90 level in the story mode. \r\nControls\r\n\r\nIn contrast to many other platformers the controls are not floaty. Instead they are direct and nice. With your slime you can jump off either from the ground or from walls, which are not slidy. \r\nLeveleditor\r\n\r\nA leveleditor is also included with a Workshop-Integration, so you can create levels upload them and other users can play, rate, etc them. \r\nLocal Multiplayer\r\n\r\nAnother mode is the local multiplayer, which is a bit like Mario Party. You play against other player in up to (at the moment) 6 different minigames, like &quot;Capture the flag&quot; or &quot;Collect as many stars as you can&quot;. The clue here is, that every player can shoot bullets or balls (depending on the minigame), so that you also can play pretty destructive. \r\nUp to 4 players (max 2 on keyboard, max 4 on controllers)! \r\n\r\nPlease let me know if you manage to crack it and maybe share it or let me know how you did it so i can continue to give tot he community that has given so much to me. Thank you","torrent":{"xt":"urn:btih:6d3c324b1b548eda1cef09b88d277e7600970dc9","amp;dn":"Slime+Jumper+%28NoCrack%29+-+TheDarkKnight","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d3c324b1b548eda1cef09b88d277e7600970dc9","infoHashBuffer":{"type":"Buffer","data":[109,60,50,75,27,84,142,218,28,239,9,184,141,39,126,118,0,151,13,201]},"announce":[],"urlList":[]}}