{"title":"Pornstars Like It Black [Brazzers]","uid":14220800,"size":2492193188,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6e132a2c2c84447106dd1a030b751ec8d49b310e&amp;dn=Pornstars+Like+It+Black+%5BBrazzers%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"distinc","files":4,"time":1460039806,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=6319421064\r\n \nhttp://imagedisco.net/?g=7557668267\r\n\r\n\r\n\r\nPLOT:\r\n\r\nThe Hottest Pornstars Fucking The Biggest Black Cocks!\r\n\r\nMy Pussy Husband, My Whorish Wife\r\n\r\nThe arrival of her new personal trainer gave Romi Rain the exact chance she'd been looking for. When the husband showed up, and quickly fell over winded from the workout, Romi couldn't resist the chance to show him what happens to a poor schmuck who can't get it together to fuck his wife.\r\n\r\nPorstars Anonymous\r\n\r\nSummer Brielle decided to attend one of the weekly meetings of the 'Pornstars Anonymous' support group. But when Summer starts telling some of her stories, it gets her instructor Nat Turner so damn horny that he has to kick all the other students out to give Summer a taste of his big black cock!\r\n\r\nLisa's Big Secret\r\n\r\nBusty housewife Lisa Ann has a pretty big secret. Every time her loving husband heads off to work, she meets up with her boyfriend Isiah to satisfy her addiction to big black cock! Lisa sucked and fucked Isiah's big dick and then got a huge load of cum all over her big juicy titties!\r\n\r\nCheating Wife Loves Black Cock\r\n\r\nThe second her husband headed off to work, Katrina Jade invited in a specialist in pounding pussy. She needed a real swinging dick to stuff her box full of big black cock and only Sean Michaels could provide the ample inches she needed to be truly satisfied.\r\n\r\nTwo Bangz Vs Nancy\r\n\r\nNancy (Julia Ann) is a right-wing talk show host, and world-famous hip-hop mogul 2 Bangz (Isiah Maxwell) is on her show to defend big-dicked gentlemen everywhere. He gets sick of Nancy's interruptions and whips it out, right there on live television! Nancy wraps her pretty lips around that fat dick, letting 2 Bangz fuck her wet MILF pussy","torrent":{"xt":"urn:btih:6e132a2c2c84447106dd1a030b751ec8d49b310e","amp;dn":"Pornstars+Like+It+Black+%5BBrazzers%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e132a2c2c84447106dd1a030b751ec8d49b310e","infoHashBuffer":{"type":"Buffer","data":[110,19,42,44,44,132,68,113,6,221,26,3,11,117,30,200,212,155,49,14]},"announce":[],"urlList":[]}}