{"title":"Star Traders Elite v5.9.39","uid":14335280,"size":25858935,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:724e1a49b560f0b3431226930b5a6489ea846c9d&amp;dn=Star+Traders+Elite+v5.9.39&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":1,"time":1460703236,"description":"Command your officers and crew from the bridge of your star ship as you travel, trade, and battle across the immense Star Traders Quadrant. Employ a wide variety of strategies as an Assassin, Bounty Hunter, Trader, Pirate or Smuggler. Can you manage your resources, crew and officers well enough to turn a profit in the complex economy that’s sprawling across the on-going interstellar conflict?\r\n\r\nUpgrade and experience the Elite edition! You can copy all your captains to the paid edition! Elite includes more than 200 new planets, more than 2,000 new sectors in the massive galaxy, over 400 new ships, twice as many rumors and officers, and more unique art.\r\n\r\nThis epic space pirate RPG offers a deep and challenging world and economy to Star Trading captains. You must navigate the waters of Quadrant politics and choose sides among the competing Factions, or take a risk and stay independent. Enjoy endless replay value in this deep space civ and trading simulation which allows you to take any path you want as a captain. Act as a pirate against the merchants using the great shipping lanes, join the Solar War as a military captain, or hunt targets across the Quadrant as a fearsome bounty hunter!\r\n\r\nStar Traders is a turn-based strategy role playing game (RPG) inspired by games such as Space Trader, Master of Orion, Elite and many other classic titles. If you enjoy retro games, adventure and tactics games, Action RPG or Sci-fi RPG with complex depth like Master of Orion, you may enjoy the Star Traders space trading simulation.\r\n\r\nOur development team is actively continuing development and updates of this indie RPG based on your feedback and is regularly updated with new content, features, and fixes. Please email us with suggestions or bugs!\r\n\r\nAs a Star Trading captain in this strategy RPG you will:\r\n- Explore more than 300 planets\r\n- Trade in and manipulate the complex and deep economy in our economic simulator\r\n- Buy, sell, and battle over 600 unique starcraft\r\n- Customize and design your space craft with more than 60 upgrades\r\n- Fully customize your captain (picking from 6 classes), officers and space ships\r\n- Read over the comments to see Star Traders is rated as one of the best RPGs by many players\r\n\r\nExperience the Elite upgrade: the epic new content includes 2,000 new sectors, 200 additional planets, and hundreds of additional ships, more rumors, art board, and officers. And you can copy any captain from Star Traders (free) to Elite!\r\nYour command of the ship is under constant threat, both internal and external. Can you manage your resources, crew, officers well to enough to turn a profit?\r\n\r\nWhat’s new:\r\nThank you for playing the Star Traders RPG!\r\nFor support, e-mail   \r\nv5.9.39 - 4/4/2016\r\n- New Ship: Outworld Cruiser\r\n- New Ship: Havok Dragoon\r\n- Improve Bounty Hunter AI\r\n- Long Range Torp Attacks 5% Less Hull Damage Chance w/ Armor &gt; 0\r\n- 25% Boost for Tradesman Officer Negotation Bonus\r\n- Improved performance for map on XXDPI and XXXDPI\r\nv5.9.37 - 3/22/2016\r\n- Improved Support for 420 and 560 DPI Devices (Note 5)\r\n- Increased Contract Reputation Bonus from Alliances\r\n\r\nRequires Android OS 1.6 and up","torrent":{"xt":"urn:btih:724e1a49b560f0b3431226930b5a6489ea846c9d","amp;dn":"Star+Traders+Elite+v5.9.39","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"724e1a49b560f0b3431226930b5a6489ea846c9d","infoHashBuffer":{"type":"Buffer","data":[114,78,26,73,181,96,240,179,67,18,38,147,11,90,100,137,234,132,108,157]},"announce":[],"urlList":[]}}