{"title":"PetiteBallerinasFucked - Candee Licious (Sweet And Innocent) NEW","uid":14270588,"size":207265702,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:72e6ad879ff3a839b9e34e172fc9d5ebab4ed266&amp;dn=PetiteBallerinasFucked+-+Candee+Licious+%28Sweet+And+Innocent%29+NEW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1460306508,"description":"Hot blonde Candee Licious wants to get her ballet routine just right, so she spends lots of time practicing. As Candee's coach, Max Dior understands his student's drive for perfection, but he also needs her to chill out. Fortunately, he can help with that by offering his cock for her to suck and fuck.After taking plenty of time to enjoy the treat of Max's stuffue with plenty of licking and sucking, Candee climbs onto his face so that they can mutually indulge in a 69. Since her pussy is so close to Matt's member, Candee soon slides forward so that she can come down with him buried deep inside of her. That kicks off a lusty fuck fest where they explore a variety of different positions, many of which require the help of Candee's ballet bar for balance.By the time Max has brought her all the climaxes she craves, Candee knows just how she's going to repay his kindness and help him get off, too. Back on her knees, she uses her magic hands and talented mouth to tease Max until he blasts his load all over her waiting open mouth and tits. Smiling and relaxed, Candee now knows she can go back to her practice with a clear head.\r\nTags: Medium Boobs, Shaved Pussy, Blonde, Long hair, Hardcore, Tan Lines, Girl-Boy, Blowjob, European, Pussy Licking, Ballerina\r\n \nhttp://imgdone.com/viewer.php?file=51129810807863183883.jpg\r\n \nhttp://imgdone.com/viewer.php?file=35395638870701848408.jpg","torrent":{"xt":"urn:btih:72e6ad879ff3a839b9e34e172fc9d5ebab4ed266","amp;dn":"PetiteBallerinasFucked+-+Candee+Licious+%28Sweet+And+Innocent%29+NEW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72e6ad879ff3a839b9e34e172fc9d5ebab4ed266","infoHashBuffer":{"type":"Buffer","data":[114,230,173,135,159,243,168,57,185,227,78,23,47,201,213,235,171,78,210,102]},"announce":[],"urlList":[]}}