{"title":"Train Journey - Driver-Engineer-eye-view - New Zealand","uid":14175894,"size":2590866708,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7acb5c4d01632be05282a07c664c4db2805f9d7a&amp;dn=Train+Journey+-+Driver-Engineer-eye-view+-+New+Zealand&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jdylan","files":3,"time":1459805120,"description":"Train Journey - Driver-Engineer-eye-view - New Zealand - Christchurch to Greymouth - 3 videos\r\n\r\nI recorded this off TV in Germany. All 3 videos are in this torrent.\r\n\r\nm4v format \r\n\r\n720 x 575 format\r\n\r\nEach video @ 1hr:15min\r\n\r\n------------------\r\n\r\nJust 1.25 hours of a freight train slowing moving through a beautiful portion of New Zealand. \r\n\r\nNot HD! This was recorded in the cab by a video recorder, through the window of the cab, so if you're used to HD, you won't find it here. There are dead bugs and crap on the windows, for example. However, the quality is pretty good, imo.\r\n\r\nNo music, just the sound of the train and engineer/radio, etc.\r\n\r\nScreenshots: http://imgur.com/a/KqgcS\r\n\r\nCheck my account for other train videos like this, many more to come.\r\n------------------------\r\n\r\nFrom Wikipedia\r\n\r\nThe most beautiful railway lines in Germany was a regular television program that the night program of the First German Television (ARD)was broadcast.\r\n\r\nThe consignment was not moderated, usually took maximum half an hour and consisted of only a cab ride on railway lines in Germany .Sometimes were entitled The most beautiful railway lines in Europe or the most beautiful train journeys in the world also train routes shown from around the world. At the beginning of the show a graph was displayed with the route and usually a short Exterior from the starting station and / or the locomotive shown. Then you could see the worn railroad track from the perspective of the engine driver . The view was always only directly onto the busy route; a conceivable &quot;pivot&quot; in a next to the track object located / landscape (eg Cologne Cathedral or the Rhine Valley) did not take place. Longer driving through tunnels were mostly reduced, then an appropriate insertion pointed.\r\n\r\nThe program was first broadcast on September 3, 1995 and ended on October 28, 2013. They aired usually 3:30 to 5:30 at night. When transmitting, it was a filling program to different lengths of films compensate or any program changes. This has ensured that the program of the following day could always start at the scheduled time. At the time of commencement of the next program, the railways broadcast was canceled without comment and abruptly when needed. In 2013, an average of 80,000 people watched the program","torrent":{"xt":"urn:btih:7acb5c4d01632be05282a07c664c4db2805f9d7a","amp;dn":"Train+Journey+-+Driver-Engineer-eye-view+-+New+Zealand","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7acb5c4d01632be05282a07c664c4db2805f9d7a","infoHashBuffer":{"type":"Buffer","data":[122,203,92,77,1,99,43,224,82,130,160,124,102,76,77,178,128,95,157,122]},"announce":[],"urlList":[]}}