{"title":"Tara Tainton - Shh! We Don't Want Daddy to Know...","uid":13537781,"size":764559954,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7c2aafc5714d8907b37b1a91227e9731a9b51085&amp;dn=Tara+Tainton+-+Shh%21+We+Don%27t+Want+Daddy+to+Know...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxsunset","files":1,"time":1455451238,"description":"Screenshots: \nhttp://imgur.su/image/MpGw\r\n\r\nOh, dear... it looks like somebody has a hard on completely unexpectedly. Now, how did that happen?? OH... you were watching Mommy while she was trying to fix the desk drawer that your father refuses to help me with? Mommy's boobies are nice? Mommy's the prettiest woman in the world? OH! You like looking at Mommy's bum while she's bent over the desk?! Oh, my... well, I do love the compliments but... you're really not supposed to look at Mommy like that. You're not supposed to... oh, but we better do something about that. Are you in pain, honey? Does it hurt? It aches? Oh, you poor thing! Well... Mommy's just going to try to brush the dust off of it... off the front of your pants. Okay? Is that helping? Mommy just brushing her hand over it... to dust it off. Oh, dear. It's not working. It's so... very... incredibly... HARD! Oh, dear, oh, dear... Okay, how about if Mommy bends over again. Does looking at Mommy's bottom help at all? You can put your hand on it if you want; we'll see if that works. OH! No, not like that! Why did you slide your hand between... !!!!! Oh, gosh, you're even HARDER now! Oh, dear, oh, dear, oh, dear... Your father hasn't even touched me like that in... Okay, baby, Mommy's going to bend over again and... you can do that with your hand if you want. Oh... OH... OHHH! Ooooohhhhh! Yes!!! Oh... SHHHHHHHH!!!!!!!! Your daddy's in the next room! We don't want daddy to know!!! Oh, my gosh, that felt... Mommy's just going to turn around and, slip down her jeans and panties, and take your.... ooooh... how does that feel? Better, baby? You're so HARD! Just... keep it... ahhhh!!! Shhhhhh!!!!!! Oh, oh, oh, YEAH!!!!","torrent":{"xt":"urn:btih:7c2aafc5714d8907b37b1a91227e9731a9b51085","amp;dn":"Tara+Tainton+-+Shh%21+We+Don%27t+Want+Daddy+to+Know...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c2aafc5714d8907b37b1a91227e9731a9b51085","infoHashBuffer":{"type":"Buffer","data":[124,42,175,197,113,77,137,7,179,123,26,145,34,126,151,49,169,181,16,133]},"announce":[],"urlList":[]}}