{"title":"FantasyMassage - Karlie Montana, Jayme Langford (Fear of Touch)","uid":13546980,"size":387018175,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7f6bf739619e7519e2c70d1e343d64ed2a969c11&amp;dn=FantasyMassage+-+Karlie+Montana%2C+Jayme+Langford+%28Fear+of+Touch%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1455527771,"description":"Jayme Langford's therapist thinks the best way for her to deal with her fear of being touched is to get a hands on massage. Massage therapist Karlie Montana promises to be gentle and make Jayme's visit as comfortable as possible. Karlie leaves the room allowing Jayme to undress privately, but she sneaks in a quick glance from afar, unnoticed. Karlie tries to soothe her fearful client but Jayme is caught in a panic unable to help herself from screaming in angst. Karlie touches Jayme's feet, thighs, butt and boobs, rewarding Jayme for her outstanding courage. Jayme reveals that she's never been touched, kissed or has had sexual intercourse because of her phobia. Karlie takes the initiative to spread Jayme's thighs apart and show this virgin what it feels like to have a lesbian orgasm! Jayme allows Karlie to gently rub the outside of her pussy nurturing a deep sexual intensity within her loins, her pussy becoming more and more wet as she experiences her first lesbian orgasm. Jayme kisses Karlie on her lips, wanting more of this new and exciting feeling, leading up to her first time eating out another girl's pussy and engaging in a deep and sensual 69 position, breaking her free from all her past inhibitions!\r\nCategories Kissing, Pussy Licking, Big Tits, FaceSitting, Blonde, Body Massage, 69, Foot Massage, Lesbians, Fingering, Natural Tits, Massage, Ass Massage, Cunilingus, HD Porn, Redhead\r\n \nhttp://imgdone.com/viewer.php?file=21422266964210745738.jpg\r\n \nhttp://imgdone.com/viewer.php?file=65690116071544362604.jpg","torrent":{"xt":"urn:btih:7f6bf739619e7519e2c70d1e343d64ed2a969c11","amp;dn":"FantasyMassage+-+Karlie+Montana%2C+Jayme+Langford+%28Fear+of+Touch%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f6bf739619e7519e2c70d1e343d64ed2a969c11","infoHashBuffer":{"type":"Buffer","data":[127,107,247,57,97,158,117,25,226,199,13,30,52,61,100,237,42,150,156,17]},"announce":[],"urlList":[]}}