{"title":"Jack In The Ass (Vouyer Media)","uid":13552839,"size":1458565120,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:802efb5c9c6ca4158b853aa833e779ceabc99206&amp;dn=Jack+In+The+Ass+%28Vouyer+Media%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"roflcopter2110","files":2,"time":1455568184,"description":"Description:\r\n\r\nThe horse hung Jack Napier, both directs and stars in the first volume of what is sure to be a hit series! Jack has handpicked some of the hottest, nastiest girls in the business that has that special something. That special something is the ability to take his massive cock anally! \r\n\r\nFirst up is a 'dynamic duo', Sandra Romain and Maya Gates! Both of these ladies are pros and can hold their own when it comes to anal. However, when confronted with Jacks sizeable sausage both girls know they are in for an ass pounding like never before! Dana Dearmon, is one hot chick who needs to see how much man meat she can cram in her keister! You can hear her scream, 'Jack you broke my butt hole!' The very nasty ,99, is up next and this wild girl gets her ass destroyed! She rides Jack's awesome appendage with a ferocious appetite and twists, convulses, and screams her way thru multiple orgasms! Audrey Elson is next, and all she craves is cock in her ass but she just didn't know how much Jack had to offer! \r\n\r\nNext up, is our cover girl Annette Schwarz, who flew all the way from Germany just to meet Jack and his colossal cock. Nervous at first about the backdoor blasting she will be getting; she warms up with something we have never seen. For the first time in history she deep throats Jack's entire mammoth man meat and lives to talk about it! Annette continues to surprise everybody as she bounces up and down with Jack in her ass like it's a pogo stick! Bonus Core girl, Aline, gives us some very nasty ATM action as she takes Jack in her ass all the way to the balls and then down her hatch!","torrent":{"xt":"urn:btih:802efb5c9c6ca4158b853aa833e779ceabc99206","amp;dn":"Jack+In+The+Ass+%28Vouyer+Media%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"802efb5c9c6ca4158b853aa833e779ceabc99206","infoHashBuffer":{"type":"Buffer","data":[128,46,251,92,156,108,164,21,139,133,58,168,51,231,121,206,171,201,146,6]},"announce":[],"urlList":[]}}