{"title":"La.guerre.des.tuques.1984.1080p.BluRay.Remux.AVC.DD2.0-NCmt.mkv","uid":14222138,"size":15023462651,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:80bd267de4ef6b3d77836a15c4f45e6ff54bf1d7&amp;dn=La.guerre.des.tuques.1984.1080p.BluRay.Remux.AVC.DD2.0-NCmt.mkv&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"claudiatannahill","files":1,"time":1460055461,"description":"La Guerre des tuques 1984 aka The Dog Who Stopped the War\r\n\r\nFrench - English soundtracks\r\n\r\n\r\nC'est le congé des Fêtes qui commence. Luc Chicoine a apporté pour le dernier jour le clairon militaire de son grand-père, et ses camarades se moquent de son air martial. En revenant de l'école, Luc propose de passer leurs vacances à jouer à la guerre, avec un butin qui sera partagé par les vainqueurs. Il réunit les garçons dans la grange où ils conservent leurs &quot;armes&quot;, et met sur papier les règles de la guerre :\r\n\r\n    les ennemis ne se parlent plus des vacances, sauf pour s'envoyer des vacheries ;\r\n    la guerre commence au petit matin et s'arrête à la nuit tombante, durant toutes les vacances d'hiver ;\r\n    les moins nombreux vont construire un fort, et l'équipe qui sera dans le fort à la fin des vacances aura gagné.\r\n\r\nLes jeunes sont ensuite séparés en deux équipes, mais, à la suite d'une suggestion de Pierre, l'autre leader, chacun choisit son camp : Jean-Louis Lapierre et François « Les lunettes » dans l'équipe de Pierre, les jumeaux Leroux (Georges et Henry), Chabot, Ti-Jacques (puis sa sœur France), Maranda, Lagacé font partie quant à eux de l'équipe de Luc. Pierre et ses compères, désavantagés dès le départ, décident de ne pas jouer à la guerre, mais changeront d'idée sur les conseils de Sophie Tremblay, la nouvelle voisine de Pierre, qui se joint à eux, ainsi que sa sœur Lucie. Ti-Guy La Lune le pacifique, ainsi que son cousin Daniel Blanchette de Victoriaville restent en dehors de cette guerre.\r\n\r\nPierre a également d'autres soucis que la guerre. Sa chienne Cléo est malade, et ses parents ne veulent plus qu'elle reste dans la maison parce qu'elle urine partout et qu'elle grogne maintenant après les gens. Quant à Luc, surnommé par Sophie &quot;le boss des bécosses&quot;, il a du mal à concilier son rôle de chef et son attirance pour sa nouvelle voisine, attirance d'ailleurs réciproque. La guerre des tuques est lancée, et l'assaut final a lieu le dernier jour des vacances. Mais c'est Cléo qui en est la victime, ensevelie par l'éboulement du fort. Les enfants l'enterreront dans la grange, à la place de leurs armes ; avec elle est enterrée avec le clairon de Luc.\r\n\r\nPierre et ses équipiers, bientôt rejoints par Luc et Sophie, retournent au fort, qu'ils détruisent.\r\n\r\n\r\n\r\nThe film involves a huge snowball fight between the children of a town who split into two rival gangs, one defending a snow castle, the other attacking it. The attackers are led by a boy who styles himself as &quot;General Luc&quot; and has a reputation for being bossy. The defenders are outnumbered and led by Marc, who owns a dog named Cleo. They also have the genius boy Francois on their side.\r\n\r\nFrancois designs a massive, elaborate snow fortress, and Marc's group constructs it. Luc arrives with his army, wearing makeshift armour and wielding wooden swords. They attempt to scale the walls with a ladder, but Luc is injured in the battle and orders a retreat. They regroup and stage a second, more covert attack, but they are spotted and beaten back again with snowballs soaked in ink.\r\n\r\nLuc counters by attacking a third time, this time with his army dressed in garbage bags as protection from the ink. They overwhelm the fort's defences, and Marc and Francois escape via toboggan through a secret tunnel. The two groups meet and agree to have one final battle to determine the winner.\r\n\r\nLuc shows up for the final siege with an even larger army, having recruited additional (younger) children with chocolate. They also possess new weapons such as slingshots and a snowball cannon. Luc orders them to charge, and despite being slowed by barricades, they eventually breach the fortress walls and engage in melee combat with the defenders. Marc's dog Cleo comes after her owner, and one of the fortress walls collapses, killing her. The war ends, as both sides help bury her.\r\n\r\nThe song at the end of the movie is performed by Nathalie Simard","torrent":{"xt":"urn:btih:80bd267de4ef6b3d77836a15c4f45e6ff54bf1d7","amp;dn":"La.guerre.des.tuques.1984.1080p.BluRay.Remux.AVC.DD2.0-NCmt.mkv","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80bd267de4ef6b3d77836a15c4f45e6ff54bf1d7","infoHashBuffer":{"type":"Buffer","data":[128,189,38,125,228,239,107,61,119,131,106,21,196,244,94,111,245,75,241,215]},"announce":[],"urlList":[]}}