{"title":"Big Tits Round Asses - Jazmyn","uid":14386654,"size":457825800,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:817046af92d341d149ffaea8ff2718104759a23b&amp;dn=Big+Tits+Round+Asses+-+Jazmyn&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"hunter534","files":1,"time":1461280109,"description":"So things have been rough and i wanted to unwind. I been following a particular girl for a long time and am a huge fan of hers. The day i found out she did house calls I was so fucking excited. I called her up and arranged a meet up and she was more than obliged to do so. So the day comes and she is at the door the boobacious Jazmyn this girl i tell you i have been wanting for so long this girl is so fucking gorgeous perfect body and all amazing natural tits and a luscious fats and she latin and I’m really into latin chicks. We head up to the bedroom and she wants to freshen up so she does and next thing i see is Jazmyn in her underwear and sexy ones at that. I can’t take it anymore but know not to go savage on her. I take my time and play with her breasts and feel her lips then its just too much and i put my dick right in her pussy. Wow i tell you the minute i stuck my dick in her i was in heaven this girl is so tight and warm inside its crazy hell i almost came after sticking it in. I would go as far as to say its better than my wife’s. So she starts giving me a boobj ob and man they are soft as fuck and we get back to grinding oh it was the best sex i have had in so long Jazzmen was great and i can’t wait to have her again.\r\n\r\nSize: 436.62 MiB\r\nTime: 00:55:38\r\nFormat:MP4\r\nGenre: Alberto Blanco, Big Ass, Big Dick, Big Tits, Blonde, Blowjob, Cumshot, Deep Throat, Handjob, Hardcore, Pornstar\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-571941203b541.html \r\n \nhttp://photo-up.info/img-5719412b9af6e.html","torrent":{"xt":"urn:btih:817046af92d341d149ffaea8ff2718104759a23b","amp;dn":"Big+Tits+Round+Asses+-+Jazmyn","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"817046af92d341d149ffaea8ff2718104759a23b","infoHashBuffer":{"type":"Buffer","data":[129,112,70,175,146,211,65,209,73,255,174,168,255,39,24,16,71,89,162,59]},"announce":[],"urlList":[]}}