{"title":"Krater für den Frieden.2016.DOCU.WebRip.720p","uid":14158672,"size":1250113948,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:81a2541cbff87da06f325a898a48b25854e40d4f&amp;dn=Krater+f%26uuml%3Br+den+Frieden.2016.DOCU.WebRip.720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"crisisofcivilization","files":2,"time":1459692291,"description":"Krater für den Frieden\r\n\r\nWie der militärisch-industrielle Komplex die Abrüstung überlebte\r\n\r\n1959 forderte der sowjetische Staatschef, Nikita Chroustschow, vor den Vereinten Nationen ein Ende des Rüstungswettlaufs und ein Ende aller Atomtests. Die Atmosphäre war radioaktiv verseucht. Und er wollte einen Friedensvertrag für ein vereinigtes und neutrales Deutschland. Diese Vorschläge sollten auf einer Gipfelkonferenz im Mai 1960 in Paris von den alliierten Siegermächten beschlossen werden. Doch die US-Regierung und der „militärisch-industrielle Komplex“ waren dagegen. Ein Ende des Kalten Krieges hätte an ihrer Vormachtstellung gerüttelt. Wie gelang es ihnen, die Abrüstung und ein neutrales Gesamtdeutschland zum Scheitern zu bringen? Dazu gibt es eine offizielle Version und eine Geschichte, die in dem Dokumentarfilm „Krater für den Frieden“ zum ersten Mal erzählt wird.\r\n\r\nLaut der offiziellen Geschichtsschreibung ist die Pariser Gipfelkonfernenz an Chroutschows Wutausbrüchen gescheitert, wegen des CIA-Spionageflugzeugs U-2. Nach offizieller Lesart tragen die Sowjets die Alleinschuld an der deutschen Teilung. Die Atomversuche in Patagonien werden verschwiegen aber eine „heldenhafte Entführung“ eines Nazi-Kriegsverbrechers durch den Mossad erfunden. In der offiziellen Geschichtsschreibung ist das Erdbeben in Chile eine Naturkatastrophe.\r\n\r\nDoch in den Archiven der USA, der Bundesrepublik, Argentiniens und der Katholischen Kirche finden sich Dokumente, die ein Licht auf die wahren Ereignisse werfen, auf die Provokationen von CIA und Pentagon während der Gipfelkonferenz, wie Geiselnahme und illegale Atomtests in Argentinien. Letztere endeten in einer Katastrophe. Die Weltöffentlichkeit wird dazu bis heute belogen. \r\n\r\n \nhttp://www.gabyweber.com/werke_krater.php","torrent":{"xt":"urn:btih:81a2541cbff87da06f325a898a48b25854e40d4f","amp;dn":"Krater+f%26uuml%3Br+den+Frieden.2016.DOCU.WebRip.720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81a2541cbff87da06f325a898a48b25854e40d4f","infoHashBuffer":{"type":"Buffer","data":[129,162,84,28,191,248,125,160,111,50,90,137,138,72,178,88,84,228,13,79]},"announce":[],"urlList":[]}}