{"title":"The Flash - Season 1 - 2014","uid":14364044,"size":9705582488,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:82d6a97f2d37be9c96e788ceccc8e448da41e399&amp;dn=The+Flash+-+Season+1+-+2014&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":46,"time":1461112161,"description":"Description\r\n\r\nS1, Ep1\r\n7 Oct. 2014\r\nPilot\r\nCSI investigator Barry Allen awakens from a coma, nine months after he was hit by lightning, and discovers he has superhuman speed.\r\n\r\n\r\nFastest Man Alive\r\nS1, Ep2\r\n14 Oct. 2014\r\nFastest Man Alive\r\nBarry takes on a group of armed men at an awards ceremony, but side effects from his new super power catch up with him.\r\n\r\n\r\nThings You Can't Outrun\r\nS1, Ep3\r\n21 Oct. 2014\r\nThings You Can't Outrun\r\nBarry and Joe track a deadly metahuman with toxic gas powers, and Caitlin relives the night of the explosion that killed her fiancé.\r\n\r\n\r\nGoing Rogue\r\nS1, Ep4\r\n28 Oct. 2014\r\nGoing Rogue\r\nTo steal a priceless diamond, Captain Cold acquires a specialized gun that can slay the Flash. Joe disapproves of Eddie and Iris dating.\r\n\r\n\r\nPlastique\r\nS1, Ep5\r\n11 Nov. 2014\r\nPlastique\r\nWhile trying to get Iris to stop blogging about the Flash, Barry investigates a general's connection to an explosive metahuman.\r\n\r\nThe Flash Is Born\r\nS1, Ep6\r\n18 Nov. 2014\r\nThe Flash Is Born\r\nBarry takes on his childhood bully, who can now turn himself into steel. Iris finally coins the moniker &quot;the Flash.&quot;\r\n\r\nPower Outage\r\nS1, Ep7\r\n25 Nov. 2014\r\nPower Outage\r\nUsing his metahuman power to siphon electricity, Blackout robs Barry of his speed, then sets his sights on S.T.A.R. labs and Dr. Wells.\r\n\r\nFlash vs. Arrow\r\nS1, Ep8\r\n2 Dec. 2014\r\nFlash vs. Arrow\r\nThe Arrow arrives to help the Flash investigate a series of homicides, but a metahuman who can control emotions turns them against each other.\r\n\r\nThe Man in the Yellow Suit\r\nS1, Ep9\r\n9 Dec. 2014\r\nThe Man in the Yellow Suit\r\nThe Flash must confront the Reverse-Flash, the man who killed his mother. Caitlin gets surprising news about her fiancé, Ronnie.\r\n\r\nRevenge of the Rogues\r\nS1, Ep10\r\n20 Jan. 2015\r\nRevenge of the Rogues\r\nWhile the Flash prepares to vanquish the Reverse-Flash, Captain Cold and Heat Wave team up to kidnap Caitlin.\r\n\r\nThe Sound and the Fury\r\nS1, Ep11\r\n27 Jan. 2015\r\nThe Sound and the Fury\r\nA former protégé of Dr. Wells uses sound waves to attack the Flash, while Iris faces trouble in her new job.\r\n\r\nCrazy for You\r\nS1, Ep12\r\n3 Feb. 2015\r\nCrazy for You\r\nCaitlin brings Barry out to a karaoke bar, hoping they both meet someone new; Cisco thinks about Hartley's dangerous proposition; Henry's snooping gets him into trouble.\r\n\r\nThe Nuclear Man\r\nS1, Ep13\r\n10 Feb. 2015\r\nThe Nuclear Man\r\nAfter Ronnie attacks a physicist, Barry and the team go after him. Joe enlists Cisco's help in the reinvestigation of Nora Allen's murder. Barry struggles with his relationship and his duties as The Flash.\r\n\r\nFallout\r\nS1, Ep14\r\n17 Feb. 2015\r\nFallout\r\nAfter the nuclear explosion separates Ronnie and Dr. Stein, Barry and the team believe both men are safe. Barry gets some important information about time travel.\r\n\r\nOut of Time\r\nS1, Ep15\r\n17 Mar. 2015\r\nOut of Time\r\nMark Mardon, having survived his apparent death during the dark matter explosion, returns seeking revenge on Joe for the death of his brother Clyde and has the same weather-manipulation powers as his deceased sibling.\r\n\r\nRogue Time\r\nS1, Ep16\r\n24 Mar. 2015\r\nRogue Time\r\nThe Flash learns that Captain Cold and Heat Wave have returned to Central City. This time Snart has brought along his baby sister Lisa aka Golden Glider to help wreak havoc on the city.\r\n\r\nTricksters\r\nS1, Ep17\r\n31 Mar. 2015\r\nTricksters\r\nA copy-cat-killer who goes by the name The Trickster starts setting off bombs in Central City. In order to stop the villain, Barry and Joe meet with the original Trickster, a criminal mastermind named James Jesse, who has been imprisoned for 20 years. Things quickly go from bad to worse when the Tricksters unite and take Henry prisoner. Meanwhile, Iris asks Eddie for help with a case, and flashbacks show how Harrison Wells came up with the idea for the particle accelerator.\r\n\r\nAll Star Team Up\r\nS1, Ep18\r\n14 Apr. 2015\r\nAll Star Team Up\r\nFelicity Smoak and Ray come to Central City seeking help with Ray's suit; a meta-human releases deadly robotic bees; a group dinner does not go as planned.\r\n\r\nWho Is Harrison Wells?\r\nS1, Ep19\r\n21 Apr. 2015\r\nWho Is Harrison Wells?\r\nJoe and Cisco visit Starling City and ask Captain Lance for help with their investigation into Dr. Wells; Laurel asks Cisco for a favor; Barry faces a new foe who can disguise himself as anyone he touches.\r\n\r\nThe Trap\r\nS1, Ep20\r\n28 Apr. 2015\r\nThe Trap\r\nBarry, Caitlin, Cisco, and Joe set a trap for Wells. Cisco uses himself as bait which puts him in great danger. Meanwhile, Eddie makes a decision regarding Iris, which leaves Joe a bit unsettled.\r\n\r\nGrodd Lives\r\nS1, Ep21\r\n5 May 2015\r\nGrodd Lives\r\nBarry deals with the latest threat from the Reverse-Flash; Dr. Wells distracts the team by releasing Grodd on the city; Iris and Barry have a serious talk.\r\n\r\nRogue Air\r\nS1, Ep22\r\n12 May 2015\r\nRogue Air\r\nDr. Wells reactivates the particle accelerator and Barry has to move the Meta humans away. To do that, he needs help and he chooses to ask Captain Cold for it.\r\n\r\n\r\nFast Enough\r\nS1, Ep23\r\n19 May 2015\r\nFast Enough\r\nWhen the particle accelerator is back online, Barry will have to go back in time to stop Eobard Thawne on the night of his mother's murder 15 years ago","torrent":{"xt":"urn:btih:82d6a97f2d37be9c96e788ceccc8e448da41e399","amp;dn":"The+Flash+-+Season+1+-+2014","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82d6a97f2d37be9c96e788ceccc8e448da41e399","infoHashBuffer":{"type":"Buffer","data":[130,214,169,127,45,55,190,156,150,231,136,206,204,200,228,72,218,65,227,153]},"announce":[],"urlList":[]}}