{"title":"Hidden Secrets - Part 94 - UFOs and the Great Last Days Decept..","uid":13513211,"size":5779036761,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:82dbe2daf29cd78795b3e724c818de3eb5de3eaf&amp;dn=Hidden+Secrets+-+Part+94+-+UFOs+and+the+Great+Last+Days+Decept..&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":52,"time":1455304631,"description":"UFO’s - The Great Last Days Deception:\r\nUFO’s: The Great Last Days Deception seeks to equip you with the truth concerning extraterrestrial visitors and their demonic hidden agenda. After an extensive journey through The History of UFO’s you’ll discover how UFO’s Lie Like Demons, Teach Like Demons, Travel Like Demons, Feel Like Demons, Act Like Demons, Possess Like Demons and Deceive Like Demons. People please be ready. One of the biggest lies in the history of mankind is about to be foisted upon the whole world. The rapture of the church is going to happen, but it won’t be from a liftoff in UFO’s. It will be from Jesus Christ coming to get His bride. Please don’t fall for the lie. Discover the truth about UFO’s: The Great Last Days Deception and whatever you do...don’t be left behind!\r\n\r\nThe videos in this series include...\r\nThe History of UFO's - Part 1\r\nThe History of UFO's - Part 2\r\nThe History of UFO's - Part 3\r\nThe History of UFO's - Part 4\r\nUFO's Lie &amp; Teach Like Demons\r\nUFO's Teach Like Demons - Part 2\r\nUFO's Travel &amp; Feel Like Demons\r\nUFO's Act &amp; Possess Like Demons\r\nUFO's Deceive Like Demons\r\nA Condensed Study on UFO's\r\n\r\n\r\nP.S.  This video series expounds more on the upcoming deception that will play on the world and building upon the current deception that is plaguing the modern church.  Not covered in this series, the POtHS torrent &quot;The Armory of Truth&quot; series sheds light on this deception within our church that will continue to increase as we head into the end-times and the upcoming greater deception as disclosed in this current upload.  You are all encouraged to download the other POtHS torrent called &quot;POtHS - End Times - 78 - Walking By Faith in the Armory of Truth&quot; to better understand these troubles leading the church into the end-times and why this later great deception is able to convinve so many believers of the grander Lie, falling victim to the miracles and wonders of the antichrist.  This is highly recommended for all believers as your future rests on this wisdom.  God bless and may the Lord Jesus Christ light your way.\r\n------------------------------------------------------------------------\r\n\r\nSigns - Part 61:\r\nA folder compiled of various short clips presenting recent apocalyptic signs occurring around the world today to help us identify the state of affairs ushering the end of days.  View what's been happening in our time and descern for yourself the onset of Revelations and what may lay ahead. \r\n------------------------------------------------------------------------\r\n\r\nAlso included are our End-Times and Xtras folders","torrent":{"xt":"urn:btih:82dbe2daf29cd78795b3e724c818de3eb5de3eaf","amp;dn":"Hidden+Secrets+-+Part+94+-+UFOs+and+the+Great+Last+Days+Decept..","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82dbe2daf29cd78795b3e724c818de3eb5de3eaf","infoHashBuffer":{"type":"Buffer","data":[130,219,226,218,242,156,215,135,149,179,231,36,200,24,222,62,181,222,62,175]},"announce":[],"urlList":[]}}