{"title":"Coast to Coast April 1 UFOs Thunderbirds","uid":14142327,"size":54809802,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:83683c32a07cec8a0138442c73f265be18ef9458&amp;dn=Coast+to+Coast+April+1+UFOs+Thunderbirds&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kirkmoron","files":4,"time":1459624228,"description":"UFOs, Thunderbird Sighting &amp; 3-Headed Person Interview\r\nCoast to Coast April 1, 2016\r\n\r\nDate:\tFriday - April 1, 2016\r\nHost:\tGeorge Noory\r\nGuests:\tOpen Lines, Buck Wolf\r\nThe last two hours of the program featured Open Lines. Jim, who works as a third-shift security officer in Myrtle Beach, South Carolina, shared his eyewitness account of what he described as &quot;a big, bright, orange light in the sky over the horizon.&quot; A duplicate appeared beside it, he reported, noting how the two objects reminded him of large rubber balls. All of sudden one light went out followed by the other, he added. &quot;There are a lot of things in the skies over Myrtle Beach that are weird,&quot; Jim said.\r\n\r\nJeff from South Dakota described a UFO encounter he had as a child in late 1960s, when his father had taken he and his siblings across the Missouri River into Nebraska. According to Jeff, while they were stopped at a store, a round object hovered over the road about 100 feet above the ground. He recalled seeing rotating lights underneath it and a capsule on top like cockpit. &quot;I can promise you it was no airplane, no helicopter, because you could hear no noise at all,&quot; Jeff stressed. A light beam shined down for a few moments and then the object flew away, he disclosed.\r\n\r\nMike in Boonville, Missouri, told George about a strange experience he and his son had on a fishing trip. Mike described hearing what sounded to him like herd of running horses and feeling accompanying vibrations through his feet. While he did not see anything, Mike's son reported seeing a giant bird with a 25-feet wingspan. &quot;I now know why they call them a thunderbird because of the noise and the feeling they cause in the ground,&quot; Mike said. Another interesting call came in from Captain Angel in Port Arthur, Texas, who suggested lost nuclear subs in the depths of the ocean could be contaminating the seas similar to the Fukushima disaster.\r\n\r\nApril Fools' Day Pranks\r\nIn the second hour, Buck Wolf, senior correspondent and weird news editor for the Huffington Post, talked about April Fools' Day pranks. According to Wolf, one of the greatest pranks of all-time was pulled off in 1957 by BBC correspondents who broke a fake news story on a record-setting Spaghetti Tree harvest in Switzerland. He reported on KING-TV's 1989 false announcement of the collapse of Seattle's famed Space Needle as well as shock jocks Opie and Anthony, who got into serious trouble with a Boston radio station after announcing Mayor Tom Menino had been killed in a Florida car crash. Wolf also provided some background on the origins of April Fools' Day, noting how it started in 1564 when King Charles IX of France adopted the Gregorian calendar, moving the start of the year from the end of March to January 1.\r\n\r\nThree-Headed Person Loses Head\r\nIn the first hour of the April 1 show, George welcomed back to the program the world's only three-headed person (photo). Elvira and Bobo announced the tragic loss of middle sibling, Walter, who they said died in his sleep of an aneurysm. The two explained their decision to keep Walter connected to their body, even though having the lifeless head between them causes some issues. &quot;He's just kind of flopping,&quot; Elvira complained, noting how Walter's head will not decompose because it continues receiving blood and nutrients from their body. Bobo pointed out that Walter's dead head gets covered with a custom hoodie jacket whenever they go out in public.\r\n\r\nWebsite(s):\r\nhuffingtonpost.com/weird-news\r\nBook(s):\r\nThe Wolf Files: Adventures in Weird News","torrent":{"xt":"urn:btih:83683c32a07cec8a0138442c73f265be18ef9458","amp;dn":"Coast+to+Coast+April+1+UFOs+Thunderbirds","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83683c32a07cec8a0138442c73f265be18ef9458","infoHashBuffer":{"type":"Buffer","data":[131,104,60,50,160,124,236,138,1,56,68,44,115,242,101,190,24,239,148,88]},"announce":[],"urlList":[]}}