{"title":"32W10","uid":14339750,"size":2979469312,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:83ce65f59b24dd69f1d66827aa8261353d15952e&amp;dn=32W10&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1460747085,"description":"El siguiente Torrent contiene una imagen ISO del sistera operativo Windows 10.\r\n\r\nLa misma funciona y está probada en varios dispositivos.\r\n\r\n\r\n¿Cómo instalar este SO en un pendrive con windows?\r\n\r\n\r\n1- Ejecutamos el comando CMD de esta forma: En el buscador del inicio tipeamos cmd y le damos enter.\r\n \r\n\r\n2- Se les abrirá una ventana. Ahí deben escribir &quot;diskpart&quot; sin las comillas: \r\n\r\n\r\n4- Se les va a abrir la aplicacion &quot;diskpart&quot; \r\n\r\n\r\n5- Ahora escribiremos &quot;list disk&quot; sin las comillas. \r\n\r\n\r\n6- Una vez escrito &quot;list disk&quot; les va a tirar una lista con sus discos rigidos y extraibles.\r\n\r\n\r\n7- Seleccionaremos nuestro pendrive, que reconoceremos por la cantidad de memoria que posee, y pasaremos a escribir &quot;select disk (el numero que dé contando desde el primero hasta donde está el pendrive que bootearemos)&quot; sin las comillas.\r\nPara no confundirnos, tener en cuenta que siempre los pendrives son los que se marcan en MB (mega bytes) \r\n\r\n8- Ahora una vez seleccionado el pendrive, escribiremos el comando &quot;clean&quot; sin las comillas. \r\n \r\n9- Ahora creamos la particion primaria. Para ello escribiremos &quot;create parition primary&quot; sin las comillas.\r\n \r\n10- Ahora escribiremos &quot;active&quot; siempre sin las comillas para activar la particion creada. \r\n\r\n11- ahora lo que vamos a hacer es formatear el pendrive. Para eso escribiremos &quot;format fs=fat32 quick&quot; SIN COMILLAS RECUERDEN ESO SIEMPRE. \r\n\r\n12- Una vez formateado escribiremos &quot;assign&quot; para assignarle una letra de unidad al pendrive. \r\n\r\n13- Si todo salio bien, les va a decir un mensaje que se asignó una letra de unidad correctamente y luego escribiremos exit para salir de la aplicacion diskpart.\r\nNo cierren la ventana del cmd y, si la cierran vuélvanla a abrir. \r\n\r\n14- Bien ya tenemos al pendrive formateado y listo para copiar los archivos del SO (sistema operativo) para copiar los archivos al pendrive. \r\nPrimero, montamos la imagen del SO, luego escribiremos este comando en la ventana del CMD: xcopy E:*.* /s/e/f G: ( &quot;E&quot; VENDRÍA A SER LA UNIDAD DONDE ESTA MONTADA EL ISO Y &quot;G&quot; EL PENDRIVE) recuerden cambiar sus letras de unidad por las de ustedes)  \r\n\r\nUna vez hecho esto empezara el copiado de los archivos que están en el ISO al pendrive, y una vez terminado tendrán su pendrive booteable!   \r\n\r\n\r\n\r\n\r\n¿Instalar Windows 10 como único SO?\r\n\r\nCuando estés realizando la instalación del SO ejecutar una ventana DOS pulsando con las teclas Shift + F10 al momento de llegar a la elección de la partición en donde instalar el SO. Con la siguiente ventana DOS vamos a ejecutar Diskpart junto con una serie de comandos.\r\n\r\nEn la ventana DOS (consola) hay que escribir los siguientes pasos tal como aparecen en negrita y uno detrás de otro:\r\n\r\n1- diskpart (Pulse tecla Intro)\r\n\r\n2- list disk (Pulse tecla Intro)\r\n\r\n3- select disk 0 (Pulse tecla Intro) (El número asignado a su unidad)\r\n\r\n4- clean (Pulse tecla Intro)\r\n\r\n5- create partition primary (Pulse tecla Intro)\r\n\r\n6- active (Pulse tecla Intro)\r\n\r\n7- format fs=ntfs quick (Pulse tecla Intro)\r\n\r\n8- assign (Pulse tecla Intro)\r\n\r\n9- exit (Para salir de la consola)","torrent":{"xt":"urn:btih:83ce65f59b24dd69f1d66827aa8261353d15952e","amp;dn":"32W10","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83ce65f59b24dd69f1d66827aa8261353d15952e","infoHashBuffer":{"type":"Buffer","data":[131,206,101,245,155,36,221,105,241,214,104,39,170,130,97,53,61,21,149,46]},"announce":[],"urlList":[]}}