{"title":"Bounty Stars v1.0.148 full + data","uid":14391657,"size":189248529,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:8739e6fb692cc2ad977b710af75252e5da001fea&amp;dn=Bounty+Stars+v1.0.148+full+%2B+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":368,"time":1461307878,"description":"Explore the depths of the galaxy’s colorful underbelly and join a comical world of scheming bounty hunters in this action-packed Adventure RPG - where no hunt is ever the same! \r\n\r\nAssume the role of a rookie bounty hunter where you must assemble a roguish crew and a fleet of deadly starships to capture the galaxy’s most notorious criminals. Blast, charm, and cheat your way through the farthest corners of the galaxy to gain valuable intelligence and track down the baddest of the bad.\r\n\r\nEngage in explosive shoot-outs, prove your tactical prowess in strategic ship-to-ship battles, and upgrade your crew to unlock powerful abilities. Explore wormholes that transports you to uncharted areas of the galaxy &amp; compete with other players to bring home the biggest haul. Create your own unique journey of adventure (and money) and fame (and more money)!\r\nDo you have what it takes to become a Bounty Star?\r\n\r\n* Features * \r\n· Explore a Richly Populated Galaxy: No two Bounties are the same! Embark on a rich narrative journey with variety of different challenges, from roving fleets of space pirates to black market vendors and rival bounty hunter crews.\r\n· Assemble an Elite Team: Amass a powerful fleet and recruit a team from over 160 different characters, each with their own unique set of traits and attacks to successfully complete a mission. Successfully capture criminals and recruit them for your crew!\r\n· Devise Unique Strategies: Encounter crafty factions that can aid or hinder your quest. Understand their dynamics, assemble a diverse crew, and visit vendors to stock up on consumable items that can tip the tide of battle.\r\n· Experience Explosive, Tactical Battles: Pair crew members with an upgradable fighter ship to take down foes! Plot trajectories of ships and watch decisions play out in real-time. \r\n· Compete for Powerful Rewards: Rank up &amp; compete with other players from across the galaxy in daily and monthly prize pools featuring rare and powerful items.\r\n\r\nWhat’s new:\r\nWe've added Wormhole Bounties where you can obtain items to Promote your Crew Members. The Wormhole locations change each day so give them a try!\r\n\r\nRequirements: Android OS 4.2+\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play","torrent":{"xt":"urn:btih:8739e6fb692cc2ad977b710af75252e5da001fea","amp;dn":"Bounty+Stars+v1.0.148+full+%2B+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8739e6fb692cc2ad977b710af75252e5da001fea","infoHashBuffer":{"type":"Buffer","data":[135,57,230,251,105,44,194,173,151,123,113,10,247,82,82,229,218,0,31,234]},"announce":[],"urlList":[]}}