{"title":"Xev Bellringer: Assistant Will Do Anything To Keep Her Job 1080","uid":13504192,"size":1883675133,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:879d093bb9958cc43f404ab1f3c3b686efb68c11&amp;dn=+Xev+Bellringer%3A+Assistant+Will+Do+Anything+To+Keep+Her+Job+1080&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxsunset","files":1,"time":1455232656,"description":"Screenshots: \nhttp://imgur.su/image/pMQ1\r\n\r\nYour new little assistant is so keen on pleasing you, as she should be. The only reason you hired her was for that voluptuous, little body - Xev was otherwise completely under qualified for the job. She owed you her gratitude... which is why your mind was made up before her first day at work was over: you were going to make Xev your personal slut. It was obvious this woman never had a job of this status before, and would do almost anything to retain it... no matter what you asked of her. You present Xev with a vibrator belt to wear under her skirt. Shocked and embarrassed, your assistant tries to refuse the gift, but you threaten her with job termination. Predictably, the little slut bends to your will and slips on the vibrator belt. As soon as the device is switched on, her body crumples in pleasure. You inform her that she is to sit in on a meeting with a very important client while wearing it. She squirms in reluctant pleasure and accepts your terms... By the time your client leaves, Xev is on the edge of orgasm... she gives into waves and waves of intense pleasure and you feel yourself getting hard. You then hand her a skimpy micro bikini and demand she attend a company dinner party with you after work, wearing only the bathing suit. Incredulous, the assistant insists she won't humiliate herself like that, so you up the ante: if Xev doesn't give into your every desire, you'll make sure she'll never find work in this city again. She submits. At the party, your assistant is totally vulnerable to the leering eyes of other men. Her juicy breasts are barely contained in the tiny top, she tries to cover her exposed body. Flustered, Xev retreats to the bathroom to collect herself. You can't resist anymore, this is your opportunity. You intrude as she's on a call with her boyfriend and push her up on the counter. She can't repel you while maintaining a facade on the phone, so you take what you want... you finally make her your slut","torrent":{"xt":"urn:btih:879d093bb9958cc43f404ab1f3c3b686efb68c11","amp;dn":"+Xev+Bellringer%3A+Assistant+Will+Do+Anything+To+Keep+Her+Job+1080","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"879d093bb9958cc43f404ab1f3c3b686efb68c11","infoHashBuffer":{"type":"Buffer","data":[135,157,9,59,185,149,140,196,63,64,74,177,243,195,182,134,239,182,140,17]},"announce":[],"urlList":[]}}