{"title":"Stargate SG-1 - Season 07 - Episodes 12 thru 22","uid":14258555,"size":7235106182,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8abaa8e4113ac4b1302b47c5a9acbcab9821b869&amp;dn=Stargate+SG-1+-+Season+07+-+Episodes+12+thru+22&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":38,"time":1460224796,"description":"Stargate SG-1 - Season 07 - Episodes 12 thru 22\r\n\r\n\r\n Evolution: Part 2 S7, Ep12\r\n9 Jan. 2004 Evolution: Part 2\r\nThe Tau'ri and Tok'ra have used their captured super-soldier to determine his planet of origin. Though with Daniel, Dr. Lee, and the Ancient device they found in the hands of Honduran kidnappers, SGC must find a way to retrieve them if they are to have any chance of defeating the newly encountered super- soldiers.\r\n\r\nGrace S7, Ep13\r\n16 Jan. 2004 Grace\r\nDuring an engine cool down break from hyperspace travel the crew of the Prometheus, with Major Carter as an advisor, encounter a space craft of unknown configuration. They hail the ship to no avail; the unknown craft opens fire upon the Prometheus. Carter attempts to override the safety protocols on the hyperdrive to make a short jump into a gas cloud, but in the attempt is knocked unconscious. She awakes to find the ship devoid of all its crew and, as she tries to escape the gas cloud by herself, she begins to hallucinate.\r\n\r\nFallout S7, Ep14\r\n23 Jan. 2004 Fallout\r\nJonas Quinn returns to SGC to ask for assistance in saving his nation. He explains that the Naquadriah was originally Naquadah and a Goa'uld started a chain reaction to transform all of his planet's Naquadah into Naquadriah. A large vein of Naquadah has just been affected and the Kelownan scientists believe that the transformation will cause this large a deposit to explode, taking their entire nation with it.\r\n\r\nChimera S7, Ep15\r\n30 Jan. 2004 Chimera\r\nMaj. Carter has been set up with her brother Mark's friend Pete Shanahan, a cop from Denver who thinks Carter works for the Air Force in a simple research capacity. Daniel Jackson is being visited in his dreams by his former lover, Sarah Gardner, who was possessed by the Goa'uld system lord Osiris.\r\n\r\nDeath Knell S7, Ep16\r\n6 Feb. 2004 Death Knell\r\nAt the new Alpha site, Sam Carter and Selmak (the symbiote carried by Jacob Carter, her father) are working on a new weapon to defeat the Anubis superdrones when the planet is attacked by a fleet of Goa'uld ships. Carter escapes with the prototype weapon before the base auto-destruct is activated but finds herself being pursued by a superdrone.\r\n\r\nHeroes: Part 1 S7, Ep17\r\n13 Feb. 2004 Heroes: Part 1\r\nThe president has asked a documentarian to SGC to create a film about its operations. His arrival is unwelcome to most and he begins to clash with the base personnel. Nevertheless, he conducts his interviews with SG-1 and the scientists in the employ of SGC. Meanwhile, an off-world SG team finds the remains of an Ancient city.\r\n\r\nHeroes: Part 2 S7, Ep18\r\n20 Feb. 2004 Heroes: Part 2\r\nThe documentarian still a thorn in their side, SGC encounters an unforeseen predicament. With half of SG-13 off-world engaging enemy Jaffa, SG teams 1, 5, and 7 go in as backup. In the midst of heavy fire, O'Neill takes a staff blast to the chest. Many deaths from the encounter hit SGC hard and Senator Kinsey orders a full investigation into the matter.\r\n\r\nResurrection S7, Ep19\r\n27 Feb. 2004 Resurrection\r\nAgent Barrett of the NID calls SG-1 to Los Angeles for a consult on a mass murdering of a rogue sleeper cell by a young woman. There they find many Goa'uld artifacts relating to Sekhmet, a subordinate of Ra. But how this operation is related to the Goa'uld eludes SG-1.\r\n\r\nInauguration S7, Ep20\r\n5 Mar. 2004 Inauguration\r\nThe newly inaugurated President of the United States is briefed by the Head of the Joint Chiefs of Staff on the Stargate program. Former Senator, now Vice President, Kinsey attempts to get his running mate to back his policies for the program, but the president decides to look into the situation himself. Kinsey gets Richard Woolsey to convince the president of his agenda.\r\n\r\nLost City: Part 1 S7, Ep21\r\n12 Mar. 2004 Lost City: Part 1\r\nVice President Kinsey briefs Dr. Weir on the Stargate program before her meeting with the president. SG teams 1, 3, and 5 go off-world to attempt the extraction of a newly found Ancient repository device. Upon arriving at the location of the device, SG-1 comes under fire from Goa'uld ships. With no other way to disallow Anubis from claiming the knowledge for himself, Jack submits himself to the dangerous device.\r\n\r\nLost City: Part 2 S7, Ep22\r\n19 Mar. 2004 Lost City: Part 2\r\nWith Jack having the knowledge of the Ancient repository once again in his mind, he and Daniel attempt to unearth the location of the lost city of the Ancients. Bra'tac, bringing with him the news of an impending attack on the Tau'ri by Anubis, takes Teal'c to help him acquire ships and warriors for the defense of Earth. Dr. Weir attempts to cope with the overwhelming nature of her new job, while also dealing with the unrelenting ego of Vice President Kinsey","torrent":{"xt":"urn:btih:8abaa8e4113ac4b1302b47c5a9acbcab9821b869","amp;dn":"Stargate+SG-1+-+Season+07+-+Episodes+12+thru+22","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8abaa8e4113ac4b1302b47c5a9acbcab9821b869","infoHashBuffer":{"type":"Buffer","data":[138,186,168,228,17,58,196,177,48,43,71,197,169,172,188,171,152,33,184,105]},"announce":[],"urlList":[]}}