{"title":"Xev Bellringer - Ring Turns Frumpy Secretary into Hot and Horny","uid":13511349,"size":196560569,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:8b7d42d6f9f18524892ebd2a6d198b3898d2a3b4&amp;dn=Xev+Bellringer+-+Ring+Turns+Frumpy+Secretary+into+Hot+and+Horny&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxsunset","files":1,"time":1455286957,"description":"Screenshots: \nhttp://imgur.su/image/pVO0\r\n\r\n I always hated how men can be such pigs, hitting on those office sluts. My negative feelings backfire as soon as a mysterious ring appears on my desk. As I put it on my finger, I quickly realize that it's stuck and my body begins to feel different, but I don't let it get in the way of my work. I go to my boss's office to discuss business as usual, however I become distracted by the sudden appearance of heels on my feet and my inability to stop crossing my legs. I try to continue with my notes, but the changes occur more and more rapidly. Soon I discover that my baggy, unattractive outfit has been replaced by a figure accentuating skirt and blouse. And just like that, the reserved, frumpy secretary is transformed into a sexually charged, smoking hot slut - the very person I used to despise. What I never understood, was the immense control of arousal that my new body had over men. This newfound power is very quickly realized as I notice a large bulge in my boss's pants. I had never experienced this kind of reception from a man before so I greedily instruct him to take his cock out and stroke for me~(HD 720p, 60fps)Fantasy includes: transformation, secretary, boss/employee, crossed legs, stockings, heels, blouse, skirt, masturbation encouragement","torrent":{"xt":"urn:btih:8b7d42d6f9f18524892ebd2a6d198b3898d2a3b4","amp;dn":"Xev+Bellringer+-+Ring+Turns+Frumpy+Secretary+into+Hot+and+Horny","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b7d42d6f9f18524892ebd2a6d198b3898d2a3b4","infoHashBuffer":{"type":"Buffer","data":[139,125,66,214,249,241,133,36,137,46,189,42,109,25,139,56,152,210,163,180]},"announce":[],"urlList":[]}}