{"title":"Run City London v2.12.46 full and data","uid":14218170,"size":801684394,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:8bc5f6c58c854e59a295334c37c58617970341d1&amp;dn=Run+City+London+v2.12.46+full+and+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1460011328,"description":"Travel back 500 years to a city under curfew. London 1545. City Run London requires stealth and intuition to win. With a bittersweet cast of characters to entertain you in a beautifully re-imagined landscape of Tudor London, this game offers a time travel immersion inside it's smoky soundscape bridging the 16th and 21st centuries inside a comic book aesthetic. Deep plot, cinematic visuals. \r\n\r\nTHE SETTING\r\nExhausted by demanding wives and civil unrest, the uneasy king has a web of spies across the capital looking for opposition. Say the wrong thing and you’ll hang for it! In an era as famous for it’s majesty as it’s gore, we bring you a tale of one man who spoke out, and the amazing adventure of another on a night-long mission to save him.\r\n\r\nGAME PLAY\r\nPlayers guide heroine Willa - known to the authorities only as The Moth - making use of her skills of invisibility and stealth in her quest to rescue the outspoken monk. She’s his only hope of escape, so when the curfew bell tolls and the streets empty, it’s up to her to to race against the coming dawn and his inevitable execution. With spies all around and a price on her head players must keep the Moth hidden from danger, opposing character cones of vision to avoid dismissal to the last checkpoint. Her route is above the streets along the London wall which is pierced by 8 themed gate tower/game levels requiring intuition, timing and stealth to win.\r\n\r\nThe artists behind City Run London come from the worlds of music and film, having worked with the likes of Audio Slave to Monty Python, Stephen Spielberg to Muse and Nirvana to Human League, Tina Turner and Pink Floyd.\r\n\r\nGAME FEATURES\r\n• 47 locations to explore;\r\n• Soundtrack by multi award-winning composer fusing voice, choir and instrumental music;\r\n• Fully animated and voiced story-telling;\r\n• 30+ hand-drawn, animated cut-scenes.\r\n\r\nWhat’s new:\r\nThis remastered version steps up the drama and gameplay with a new opening sequence, characters and scenes throughout to give a greater sense of the sinister undercurrents in the plot to immerse players in the strange and beautiful re-imagination of Tudor London.\r\n* New cut-scenes and voice acting.\r\n* New levels and improvements to the existing games flow.\r\n\r\nBuild 46:\r\n* Xiaomi and Tegra K1 compatibility fixes\r\n* Prevents some devices getting hot\r\n* Minor performance improvements\r\n* Google Play fixes\r\n\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play.\r\nRequires Android OS 2.3 and up","torrent":{"xt":"urn:btih:8bc5f6c58c854e59a295334c37c58617970341d1","amp;dn":"Run+City+London+v2.12.46+full+and+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bc5f6c58c854e59a295334c37c58617970341d1","infoHashBuffer":{"type":"Buffer","data":[139,197,246,197,140,133,78,89,162,149,51,76,55,197,134,23,151,3,65,209]},"announce":[],"urlList":[]}}