{"title":"Field Confirmation Testing for Suspicious Substances","uid":14531511,"size":5294042,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e5f8c3b380b8af69ed835ce34eb7517277ecbd3&amp;dn=Field+Confirmation+Testing+for+Suspicious+Substances&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1462448350,"description":"Field Confirmation Testing for Suspicious Substances - Rick Houghton (CRC, 2009).pdf\r\n\r\nISBN 978-1-4200-8615-7\r\n\r\nFrequently a substance found at a port of entry, waste site, laboratory triage facility, or even in a hazardous materials emergency will be labeled and purportedly identified. But law enforcement and other first responders cannot take this claim at face value, as the accuracy is not confirmed and must be verified. A comprehensive handbook for on-the-spot investigations, Field Confirmation Testing for Suspicious Substances provides those who confront suspicious substances with the tools to confirm or deny a labeled identity.\r\n\r\nA Complete Range of Testing Protocols\r\n\r\nDivided into three sections, the book begins by exploring physical confirmation tests which use methods that involve measurement of temperature, vapor density, radioactivity, and other factors. The author then examines chemical confirmation tests suitable for field use, providing over 400 different analyses, most of which provide a colorimetric result. The book also includes a section on instrumentation. It offers an overview of the technologies used to analyze materials and presents the strengths and weaknesses of the technology so that the corresponding weak or strong result can be used in the overall analysis. The appendix provides two detailed sections on drug and explosives tests.\r\n\r\nThe tests in this book can immediately generate valuable information in the field which can be used to save lives, conserve property, provide environmental protection, and assist law enforcement in apprehending those responsible for disseminating hazardous substances","torrent":{"xt":"urn:btih:8e5f8c3b380b8af69ed835ce34eb7517277ecbd3","amp;dn":"Field+Confirmation+Testing+for+Suspicious+Substances","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e5f8c3b380b8af69ed835ce34eb7517277ecbd3","infoHashBuffer":{"type":"Buffer","data":[142,95,140,59,56,11,138,246,158,216,53,206,52,235,117,23,39,126,203,211]},"announce":[],"urlList":[]}}