{"title":"Human and Organizational Factors in Nuclear Safety","uid":14542204,"size":5004588,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:903957a28df5c520632702567b8963ff0e43d2e3&amp;dn=Human+and+Organizational+Factors+in+Nuclear+Safety&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1462539598,"description":"Human and Organizational Factors in Nuclear Safety - Grégory Rolina (CRC, 2013).pdf\r\n\r\nISBN 978-1-138-00035-3\r\n\r\nThis book discusses the specifics of safety regulations regarding nuclear risk and how experts contribute to the safety of nuclear installations. Drawing on research conducted in collaboration with the French Institute for Radiological Protection and Nuclear Safety (IRSN), the ideas that are put forward rely on a review of the practices of specialists in human and organizational factors concerning nuclear safety. The author shows that the French approach depends on maintaining a technical dialogue between the regulatory authority (ASN), IRSN and nuclear operators. This method of risk management is known as &quot;French cooking&quot; in the Anglo-Saxon world, where a more formal regulatory approach is taken. This technical dialogue does however hold certain benefits, particularly in the field of human and organizational factors, where it allows an advancement of the state of knowledge, which remains incomplete. After the Fukushima accident, in the face of an ongoing European and global re-evaluation of the safety of nuclear power and alignment towards the Anglo-Saxon standard, the French cooking approach may yet be able to make a significant contribution. This work will be of interest to all involved in nuclear power engineering and in the field of risk management and nuclear safety","torrent":{"xt":"urn:btih:903957a28df5c520632702567b8963ff0e43d2e3","amp;dn":"Human+and+Organizational+Factors+in+Nuclear+Safety","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"903957a28df5c520632702567b8963ff0e43d2e3","infoHashBuffer":{"type":"Buffer","data":[144,57,87,162,141,245,197,32,99,39,2,86,123,137,99,255,14,67,210,227]},"announce":[],"urlList":[]}}