{"title":"Windows Firewall Control 4.6.1.0 +Activator","uid":13520257,"size":361440,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:92ef5abaca9bf1a18922dc5bd2402800486ba39c&amp;dn=Windows+Firewall+Control+4.6.1.0+%2BActivator&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubberboy37","files":1,"time":1455354541,"description":"Windows Firewall Control is a tool that provides fast access to the Windows Firewall settings and enhances functionality by letting you manage networking rules for each application. It mainly caters to experienced users, such as Network Administrators.\r\n\r\n\r\n\r\nQuick access from the tray icon\r\n\r\nOnce intialized, the app created an icon in the system tray area and allows you to select the security profile, ranging from no filtering (turns of Windows Firewall) to high filtering mode (blocks all inbound and outbound connections).\r\n\r\n\r\n\r\nThorough management of application connections\r\n\r\nWhen it comes to rules management, you can allow or deny access to any application, disable, delete it from the list or create a duplicatwe. The list shows names, groups, programs, locations, statuses, actions, directoins, locate and remote ports, remote addresses, protocols and services.\r\n\r\n\r\n\r\nPopulate permission lists with custom apps\r\n\r\nIt is possible to sort items by statusd or direction (inbound, outbound, all, user-created), use a search function, view recently blocked programs, as wel as switch to a simplified viewing mode for enabling and disabling program access, as well as for adding a new app to the list.\r\n\r\n\r\n\r\nRich settings to work with\r\n\r\nWindows Firewall Control features a control panel where you can make additional tweaks. You can integrade the tool into the Explorer Context menu, set it to autorun at startup, sisable other programs from adding Firewall rules, activate global hotkeys for the control panel and rules management area, adjust the frame's hue, import and export rules as wel as access some Windows tools (Firewall with Advanced SAecurity, Command Prompt, Evernt Viewer, Resource Monitor, Windows Registry ect.).\r\n\r\n\r\n\r\nTo end with\r\n\r\nAll in asll, the application has a fair reaction speed and work very smoothly, without causing any problems to the OS. It quickly applies rule changes. Windows Firewall Control is and excellent utility for a better control over your Windows Firewall options from Microsoft, especially when it comes to setting up rules for each program.\r\n\r\n\r\n\r\nChangelog:\r\n\r\n- New: Security Tab was added in the Main Panel which contains the Secure Boot and the new improved Secure Rules feature which automatically removes the rules that are added to a different group than the defined list of authorized group names. This adds the possibility to the Windows Operating System to add required rules without being deletwed anymore by Windows Firewall Control, because Secure Rules was enabled. Also, unwanted Firewall Rules that may have been added before the start of Windows Firewall Control service can be detected this way.\r\n\r\n- Updated: The internal logging mechanism was simplified and updated to offer more information about the events that are logged.\r\n\r\n- Updated: A new rule created from the notification dialog without customizing it, is created for any protocol. From now on it will be created for the protocol that appears in the notification. This change applies also for the rules created automatically for digitally signed programs when Low Notification Level is used.\r\n\r\n- Fixed: The search from Connections Log works very slow compared to the search from Manage Rules.\r\n\r\n\r\n\r\nScreenshot:\r\n \nhttp://imgbay.mobi/di/ProductActivated-ruu5p.jpg","torrent":{"xt":"urn:btih:92ef5abaca9bf1a18922dc5bd2402800486ba39c","amp;dn":"Windows+Firewall+Control+4.6.1.0+%2BActivator","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92ef5abaca9bf1a18922dc5bd2402800486ba39c","infoHashBuffer":{"type":"Buffer","data":[146,239,90,186,202,155,241,161,137,34,220,91,210,64,40,0,72,107,163,156]},"announce":[],"urlList":[]}}