{"title":"Biochemical Aspects of Reactions on Solid Supports","uid":14547236,"size":7057918,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:940e51475021424ab824033e527c3751fcf8db51&amp;dn=Biochemical+Aspects+of+Reactions+on+Solid+Supports&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1462600526,"description":"Biochemical Aspects of Reactions on Solid Supports - George R. Stark (AP, 1971).pdf\r\n\r\nBiochemical Aspects of Reactions on Solid Supports focuses on water-soluble enzyme derivatives and their possible use as heterogeneous specific catalysts in research and industry. It discusses the four fundamental methods used for the preparation of water-insoluble derivatives of biologically active proteins.\r\nOrganized into five chapters, the book starts by reviewing the methods available for the immobilization of proteins, which includes enzymes adsorption, occlusion in cross-linked polymeric matrices, covalent binding to water-insoluble carriers, and intermolecular cross-linking. It then discusses the principle of affinity chromatography, which can be applied to a wide range of macromolecular-ligand systems. Other chapters consider the developments in the use of solid support and reagents in peptide synthesis. In addition, the book discusses the various methods used in the production of cation-exchange resins for amino acid chromatography and water softening.\r\nThis book is a valuable resource for biochemists, chemical biologists, scientists, students, and researchers whose interests span a variety of fields","torrent":{"xt":"urn:btih:940e51475021424ab824033e527c3751fcf8db51","amp;dn":"Biochemical+Aspects+of+Reactions+on+Solid+Supports","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"940e51475021424ab824033e527c3751fcf8db51","infoHashBuffer":{"type":"Buffer","data":[148,14,81,71,80,33,66,74,184,36,3,62,82,124,55,81,252,248,219,81]},"announce":[],"urlList":[]}}