{"title":"NubileFilms - Amber Nevada (Bang Bang) NEW 04 April 2016","uid":14172292,"size":441355453,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:969eeefc37b240f7b3cb6377a0b0a887ec9d306b&amp;dn=NubileFilms+-+Amber+Nevada+%28Bang+Bang%29+NEW+04+April+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1459769405,"description":"Amber Nevada is on an interesting date, where her boyfriend Kendo Ortiz is showing her how to shoot a gun. Despite Amber's distracting kisses and licks, Kendo is able to hit the first target. Determined now to get her guy's attention, Amber wraps her arms around Kendo's waist and slips her hands down his pants.Kendo gets off one more shot before Amber gets serious about taunting him. Dropping to her knees in front of her lover, Amber pulls out his stiffie and starts sucking him off like a Hoover. When Kendo tries to put the gun down, Amber makes it clear that she wants him to keep shooting so that she can enjoy the way she affects his concentration as she treats his dick like her own personal lollipop.Turning the tables on Amber, Kendo helps her to her feet and then hands her the gun. He comes up from behind her as he explains to her how to aim the weapon, and then slides his hand down her pants so that he can fondle her clit while she shoots. In only a few moments Amber decides that she's no longer interested in playing this game, so she drops the gun to the ground and spins around to give Kendo a true, loving kiss...\r\nTags: Small Boobs, Shaved Pussy, Tall Girls, Brunette, Long hair, Hardcore, Outdoors, Latina, Girl-Boy, Blowjob, Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=40207655538766290781.jpg\r\n \nhttp://imgdone.com/viewer.php?file=74976622493490733879.jpg","torrent":{"xt":"urn:btih:969eeefc37b240f7b3cb6377a0b0a887ec9d306b","amp;dn":"NubileFilms+-+Amber+Nevada+%28Bang+Bang%29+NEW+04+April+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"969eeefc37b240f7b3cb6377a0b0a887ec9d306b","infoHashBuffer":{"type":"Buffer","data":[150,158,238,252,55,178,64,247,179,203,99,119,160,176,168,135,236,157,48,107]},"announce":[],"urlList":[]}}