{"title":"MasterChef-S12--BBC-2016-w.subs-360p","uid":14545985,"size":7493465256,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:985f6ad5b8af23d2ca8c7b7e2f37e5c4e08e1000&amp;dn=MasterChef-S12--BBC-2016-w.subs-360p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"uggauga","files":50,"time":1462582135,"description":"\nMasterChef - Season 12\r\n\r\nAmateur cooks compete to win the coveted MasterChef title. With John Torode and Gregg Wallace.\r\n\r\nBBC (2016) - 25 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b006t1k5\r\n_______________________________________\r\n\r\n640x360 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nMasterChef, Series 12 Episode 1 of 25\r\n\r\nThe pressure cookers are out, the table has been laid and the trophy has been polished - MasterChef is back, opening its doors to a new batch of aspiring chefs all battling to become Britain's best amateur cook. Across twenty-five episodes spread over seven weeks on BBC One, the contestants face extraordinary culinary challenges, expert critique and the trusted MasterChef faces, as John Torode and Gregg Wallace return to the judging table on the hunt for the twelfth champion.\r\n\r\nOut of the hundreds that auditioned, forty amateur cooks are through to battle it out over four weeks of heats, producing some of the most inspiring, exceptional and unusual food ever seen on the series.\r\n\r\nIn this episode, the first five hopefuls try to prove to judges John Torode and Gregg Wallace that they have the potential to be the 2016 MasterChef champion.\r\n\r\nThe contestants are first given just 75 minutes to impress Gregg and John with their calling card, a practiced dish that represents who they are as a cook and showcases their talent. After tasting all five dishes, John and Gregg, without telling each other, each pick their favourite dish. If they both choose the same dish then they will select their second preference. The two lucky cooks will be safe - for now - and sail straight through to the second test.\r\n\r\nThey remaining three contestants must cook again in a 'sweet or savoury' invention test, at the end of which one amateur is sent home. The four remaining cooks must then create two courses to excite not only John and Gregg but also 2015 finalists Emma Spitzer and Tony Rodd and 2015 champion Simon Wood. After the four hopefuls have cooked, John and Gregg decide which three contestants deserve to take the next step in the competition and go through to the first quarter-final","torrent":{"xt":"urn:btih:985f6ad5b8af23d2ca8c7b7e2f37e5c4e08e1000","amp;dn":"MasterChef-S12--BBC-2016-w.subs-360p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"985f6ad5b8af23d2ca8c7b7e2f37e5c4e08e1000","infoHashBuffer":{"type":"Buffer","data":[152,95,106,213,184,175,35,210,202,140,123,126,47,55,229,196,224,142,16,0]},"announce":[],"urlList":[]}}