{"title":"Ariborn by Kenneth Oppel","uid":14320947,"size":157837119,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:989bb004042c00f068c3bf47fca30090f0dec008&amp;dn=Ariborn+by+Kenneth+Oppel+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Beanhh123","files":34,"time":1460603208,"description":"ailing toward dawn, and I was perched atop the crow's nest, being the ship's eyes. We were two nights out of Sydney, and there'd been no weather to speak of so far. I was keeping watch on a dark stack of nimbus clouds off to the northwest, but we were leaving it far behind, and it looked to be smooth going all the way back to Lionsgate City. Like riding a cloud. . . .\r\n\r\nMatt Cruse is a cabin boy on the Aurora, a huge airship that sails hundreds of feet above the ocean, ferrying wealthy passengers from city to city. It is the life Matt's always wanted; convinced he's lighter than air, he imagines himself as buoyant as the hydrium gas that powers his ship. One night he meets a dying balloonist who speaks of beautiful creatures drifting through the skies. It is only after Matt meets the balloonist's granddaughter that he realizes that the man's ravings may, in fact, have been true, and that the creatures are completely real and utterly mysterious.\r\n\r\nIn a swashbuckling adventure reminiscent of Jules Verne and Robert Louis Stevenson, Kenneth Oppel, author of the best-selling Silverwing trilogy, creates an imagined world in which the air is populated by transcontinental voyagers, pirates, and beings never before dreamed of by the humans who sail the skies","torrent":{"xt":"urn:btih:989bb004042c00f068c3bf47fca30090f0dec008","amp;dn":"Ariborn+by+Kenneth+Oppel+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"989bb004042c00f068c3bf47fca30090f0dec008","infoHashBuffer":{"type":"Buffer","data":[152,155,176,4,4,44,0,240,104,195,191,71,252,163,0,144,240,222,192,8]},"announce":[],"urlList":[]}}