{"title":"Elle India - May 2016 (gnv64)","uid":14533189,"size":54163763,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98fd007342e691958eda8a46e2a9408ed82842fd&amp;dn=Elle+India+-+May+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gnv65","files":4,"time":1462470726,"description":"Elle India - May 2016\r\nEnglish | 206 pages | True PDF | 51.6 mb\r\n\r\nCONTENTS\r\n24 __ VOICES\r\n28 __ ELLE MAIL\r\n31 __ EDITOR’S LETTER\r\n32 __ BEHIND THE SCENES\r\n34 __ ELLE ONLINE\r\n\r\nEDITS\r\n38 __ RUFFLE EFFECT Be a frill seeker this summer. By Malini Banerji\r\n40 __ SO FANCY Dial up the drama with newseason swimwear\r\n54 __ AY, CARAMBA! Find your courage through brave Spanish couture\r\n56 __ TWIN PEAKS No more hiding your prime physical assets. By Nidhi Jacob\r\n58 __ THE SLASH Try cut-out details to sharpen your look\r\n60 __ INSIDE OUT Beat the heat with bra tops\r\n62 __ TAKE IT OFF Bare shoulders are back\r\n64 __ MESH UP All the ways to make net work for the summer\r\n66 __ ELLE STREET Bodycon fashion is all about confidence — take cues from these real girls\r\n72 __ WILD ONES Make sure your brow game is on-point\r\n74 __ NECK LINE Take chokers by the throat\r\n76 __ CINDERELLA STORY Sandra Choi looks back at 20 glamorous years of Jimmy Choo\r\n78 __ GET NAKED Stand taller with these leglengthening nude heels\r\n80 __ GOOD EVENING Everything you need to nail cocktail dressing\r\n82 __ PAST PRESENT Crafts revivalist Madhu Jain on her new ikat obsession\r\n84 __ WORK SPY Meet the spiffy team at Godrej India Culture Lab\r\n86 __ SHOW &amp; TELL All the highlights from Amazon India Fashion Week Fall/Winter 2016-17. By Nidhi Jacob\r\n94 __ NEW LOOK Sofia Cappola’s iconic bag for Louis Vuitton gets a light-hearted makeover\r\n96 __ FASHION UPDATES Style buzz, fresh picks and shop talk\r\n\r\nFEATURES\r\n101 __ RADAR Books, movies, art, pop culture and people to keep your eye on\r\n110 __ GRACE UNDER FIRE Tahmima Anam wraps up her political Bengal trilogy with a tender love story. By Deepa Menon\r\n112 __ FAT LOT A writer goes on a quest to make peace with her size. By Marisa Meltzer\r\n114 __ ROLE MODELS Our favourite supermodels on 20 years of striking poses with ELLE\r\n118 __ REI OF LIGHT Rei Kawakubo of Comme des Garçon reveals why she may be the last of the true iconoclasts. By Jacques Hyzagi\r\n\r\nFASHION\r\n124 __ FREE STYLE Padma Lakshmi on her fiery new memoir and the road ahead. By Vatsala Chhibber. Photographed by R Burman. Styled by Malini Banerji\r\n136 __ ART PARTY Play with artsy sequins, 3D texture and blurry patterns. Photographed by Michael Sanders. Styled by Benedetta Dell’orto\r\n\r\nBEAUTY\r\n148 __ IRON MAIDEN These muscular women toss out all delicate notions of femininity. By Mamta Mody. Photographed by Taras Taraporvala. Styled by Nidhi Jacob\r\n156 __ NOW TRENDING Buzzwords to add to your beauty vocab. By Mamta Mody\r\n162 __ SKINNY COW Being thin is not all it’s cracked up to be. By Kermin Bhot\r\n166 __ SKIN TONE Your ultimate beach beauty kit\r\n173 __ PARTY ANTHEM A fun, new collection from Lakmé is bringing shimmer back\r\n176 __ CROWN PRINCE Celebrated hairstylist Eugene Souleiman on why bad taste is good. By Aishwarya Subramanyam\r\n180 __ BEAUTY UPDATES News, reviews and best buys\r\n\r\nLIFESTYLE\r\n190 __ PEAK SEASON Cool off with a dreamy Italian holiday amid lakes and mountains. By Parul Menezes\r\n192 __ GO WEST Three ways to explore British Columbia. By Arshie Chevalwala\r\n194 __ SUN KISSED Sri Lanka is exactly the slice of paradise you might be expecting\r\n196 __ LIFESTYLE UPDATES Top tables, design ideas and travel hacks\r\n200 __ ALL HEART Picture-perfect moments from ELLE’s Carnival For A Cause in Delhi\r\n202 __ NIGHT WATCH See what went down at the ELLE and FDCI after-party at AIFW\r\n204 __ ADDRESS BOOK\r\n208 __ ASTRO\r\n210 __ NUMEROLOGY\r\n212 __ ELLE LOVES Girly meets edgy in Fendi’s embellished bag\r\n\r\nON THE COVER: MODEL PADMA LAKSHMI\r\nLycra swimsuit, Hermès. Cotton shirt, Missoni.\r\nGold-plated necklace with black onyx pendant, Zariin.\r\nRhodium-plated metal necklace, Shoplune.com.\r\nPHOTOGRAPH: R BURMAN\r\nSTYLING: MALINI BANERJI\r\nART DIRECTION: RESHMA RAJIWDEKAR\r\nMAKE-UP &amp; HAIR: ROSARIO BELMONTE/ANIMA CREATIVE MANAGEMENT\r\n \nhttps://s32.postimg.org/8agiv5uph/Elle_India_May_2016.jpg","torrent":{"xt":"urn:btih:98fd007342e691958eda8a46e2a9408ed82842fd","amp;dn":"Elle+India+-+May+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98fd007342e691958eda8a46e2a9408ed82842fd","infoHashBuffer":{"type":"Buffer","data":[152,253,0,115,66,230,145,149,142,218,138,70,226,169,64,142,216,40,66,253]},"announce":[],"urlList":[]}}