{"title":"Battlestar Galactica fanedit Boomer and Chief 1080p 6ch x265","uid":13502692,"size":4311271604,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:9b37563b9cb9942e39da13f62551c07465d036d5&amp;dn=Battlestar+Galactica+fanedit+Boomer+and+Chief+1080p+6ch+x265&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bsg4you","files":15,"time":1455220039,"description":"Battlestar.Galactica.fanedit.Boomer.and.Chief.1080p.6ch.x265.HEVC\r\n\r\nTHIS TORRENT USES X265 HEVC (High Efficiency Video Coding) VIDEO\r\nPLEASE USE A PLAYER THAT SUPPORTS X265 HEVC VIDEO LIKE VLC, POTPLAYER, ETC\r\n\r\nTHIS SHARE IS A FANEDIT FEATURING BOOMER AND HER RELATIONSHIP WITH CHIEF\r\nEVERY SCENE WITH BOOMER IS INCLUDED AND MANY SCENES WITH CHIEF\r\nSOURCE WAS 1080P/SURROUND BLURAY FOR THE MINI-SERIES, EPISODES, AND THE PLAN\r\nSOURCE WAS 360P/STEREO BLURAY FOR DELETED SCENES\r\n\r\nBattlestar Galactica Boomer and Chief fanedit\r\nparts1to5 Handbrake0.10.2.7286 5hours 00minutes 51seconds 4.01GB (inc. alt parts)\r\nvideo: 1920x1080 HEVC crf=24.00to25.50 preset=medium (video ~1498Kbps to ~2255Kbps)\r\naudio: 6-channel surround HE-AAC 256Kbps\r\n4hours 16minutes 03seconds - Chronological: view part1-part5\r\n3hours 58minutes 24seconds - Alt1: view part0.alt-start, part1-part4, part5.alt-end\r\n3hours 44minutes 58seconds - Alt2: view part1-part4, part5.alt-end\r\n\r\nBattlestar Galactica fanedit Boomer and Chief 1080p 6ch x265 HEVC:\r\npart0alt: 415to419 29m.06s crf25.25 (~1498Kbps) 383,599,597bytes\r\npart1: 100to102 54m.25s crf25.00 (~1573Kbps) 747,606,335bytes\r\npart2: 103to113 47m.48s crf24.00 (~1535Kbps) 642,965,255bytes\r\npart3: 201to220 58m.23s crf25.50 (~1522Kbps) 780,008,237bytes\r\npart4: 301to414 48m.40s crf25.50 (~2255Kbps) 917,612,176bytes\r\npart5: 415to419 46m.45s crf24.75 (~1524Kbps) 625,112,605bytes\r\npart5alt: 415to419 15m.40s crf24.00 (~1561Kbps) 214,019,858bytes\r\n100: mini-series\rx=season yz=episode\r\n\r\nThis is an x265 HEVC video, HE-AAC audio encode of the 5-part fanedit Boomer and Chief from the new Battlestar Galactica (2003-2009). This x265 HEVC version was encoded using constant quality of crf 24.00 to 25.50 with a target average bitrate per episode of 1500-1600Kbps. Deleted scenes from the blu-rays were 360p/2.0 so there is a notable change in video quality when they appear and the sound is only stereo during those scenes.\r\n\r\nWhy download this FANEDIT? Because you like ...\r\n1. Grace Park and/or Aaron Douglas\r\n2. the characters Boomer and/or Chief\r\n3. Battlestar Galactica 2003-2009 and you want to watch a FANEDIT\r\n4. the earlier x264 encodes of Boomer.and.Chief and want a smaller x265 version\r\n\r\nBoomer.and.Chief is a 1080p video, 5.1 surround sound audio FANEDIT of Battlestar Galactica 2003-2009 that includes all of Boomer's story and her relationship with Chief covered in 7 episodes with 3 different viewing options using 5-6 episodes each. The material was sourced from the the mini-series, episodes, deleted scenes, and the movie The Plan. Almost every scene where Boomer has a line and almost every frame of when Boomer was on screen are included. Additionally, Boomer.and.Chief includes all non-Boomer Eights that are on the Basestars with Boomer or around Chief, e.g. Athena meeting Chief on Kobol or the non-Boomer Eights involved in the Cylon Civil War. This began as an edit with every Battlestar Galactica scene Grace Park was in and developed into Athena.and.Helo and Boomer.and.Chief. There is a standalone release for The Face Of The Enemy webisodes. Note that Boomer.and.Chief has stretches of just Chief material or only snippets of Boomer, e.g. between 2.04 Resistance to 2.18 Downloaded and during Cavil and Ellen conversations from No Exit. Also, non-Boomer Eights are included even if it's for a small part of a scene.\r\n\r\nTHERE ARE 3 VIEWING OPTIONS FOR BOOMER.AND.CHIEF:\r\n\r\n1) CHRONOLOGICAL VIEWING ORDER: has all of Boomer's lines and almost all of her screen time plus all Boomer related stuff with Chief in mostly chronological order. The last episode ends with Boomer's death and Chief walking off alone on Earth followed by an upbeat montage of Boomer and Chief.\r\nWATCH:\r\npart1: 100to102\r\npart2: 103to113\r\npart3: 201to220\r\npart4: 301to414\r\npart5: 415to419\r\nSKIP:\r\npart0alt: 415to419.alt-start\r\npart5alt: 415to419.alt-end\r\n\r\n2) ALTERNATE VIEWING ORDER INCLUDING OPTIONAL FLASH FORWARD: this option starts with Chief pleading with President Roslin not to extradite Boomer through Chief walking away alone on Earth as a flash forward which has the following removed: SonjaSix requesting Boomer's extradition in front of Chief and Chief's arguing in Joe's Bar with Tory/Tigh/Ellen about saving Boomer. It ends with Boomer and Chief sharing dream house projections followed by an upbeat montage of Boomer and Chief.\r\nWATCH:\r\npart0alt: 415to419.alt-start\r\npart1: 100to102\r\npart2: 103to113\r\npart3: 201to220\r\npart4: 301to414\r\npart5alt: 415to419.alt-end\r\nSKIP:\r\npart5: 415to419\r\n\r\n3) ALTERNATE VIEWING ORDER WITHOUT THE FLASH FORWARD: this viewing is the most upbeat and ends with Boomer in the brig and Chief sharing her dream house projection followed by the upbeat montage. The montage includes an edited sequence of the dream house but it's set to &quot;Two Boomers&quot; from the soundtrack so its a little different then the dream house scenes just before it. Despite being the most upbeat viewing option, all of Boomer's tragedies are on display from the episodes, deleted scenes, and The Plan. Only the extradition discussions, Boomer's escape, Boomer's death, and Chief walking away on Earth alone are removed. This is a &quot;what if&quot; ending that was completely possible and not so incredibly tragic: what if extradition never came up or never happened, Chief never broke out Boomer from the brig, Boomer never kidnapped Hera, and Earth was found anyway?\r\nWATCH:\r\npart1: 100to102\r\npart2: 103to113\r\npart3: 201to220\r\npart4: 301to414\r\npart5alt: 415to419.alt-end\r\nSKIP:\r\npart0alt: 415to419.alt-start\r\npart5: 415to419\r\n\r\nPlease check out other releases of Battlestar Galactica, Gotham, MST3K, Rifftrax, DC Comics, documentaries, Star Trek Enterprise and more at:\r\n  https://thepiratebay.se/user/bsg4you/  \r\n  https://kat.cr/user/bsg4you/uploads/  \r\nand leave any corrections, criticism, comments and requests.\r\n\r\nThanks, bsg4you","torrent":{"xt":"urn:btih:9b37563b9cb9942e39da13f62551c07465d036d5","amp;dn":"Battlestar+Galactica+fanedit+Boomer+and+Chief+1080p+6ch+x265","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b37563b9cb9942e39da13f62551c07465d036d5","infoHashBuffer":{"type":"Buffer","data":[155,55,86,59,156,185,148,46,57,218,19,246,37,81,192,116,101,208,54,213]},"announce":[],"urlList":[]}}