{"title":"Tara Tainton - I Had No Idea My Karate Play and Foot Skills Turn","uid":13520892,"size":822055538,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:9e475a1fc29e6c5b272c73670efd8cdbcb6eb4e4&amp;dn=Tara+Tainton+-+I+Had+No+Idea+My+Karate+Play+and+Foot+Skills+Turn&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxsunset","files":1,"time":1455362453,"description":"Screenshots: \nhttp://imgur.su/image/pjxt\r\n\r\nI can’t wait for the workday to end so I can head off to karate class. It’s so much fun! I mean, look at these tits and ass… I HAVE to take to karate just to be able to defend myself! hee hee I love practicing my karate chops, my fighting stance, and my high kicks right in front of the mirror. HI-YAA!\r\nWhoa, when did YOU get home, honey?! Oh, well, you’re probably wondering why I’m dressed in this karate outfit… well, I’ve been taking karate classes for a few years now… I’m a black belt! Wanna see my moves? Wanna me to use them on you?? hee hee\r\nOh, you should love how fit and limber my training has made me. Watch how far I can stretch… and how high I can kick! My… is your cock hard?? Why is that?! Oh, so you like karate girls… do you? Want me to pose for you? Want me to show you more of what my sexy bare feet can do?\r\nYou know I’m going to want to play with you knowing you’re that hard for me… I’m going to exploit your new turn on and give you the best views while I suck you off… and give you a tender footjob… and ask you to satisfy my own desires…. Now, I’m so turned on now; I want you to watch me come while you jerk and come with me!","torrent":{"xt":"urn:btih:9e475a1fc29e6c5b272c73670efd8cdbcb6eb4e4","amp;dn":"Tara+Tainton+-+I+Had+No+Idea+My+Karate+Play+and+Foot+Skills+Turn","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e475a1fc29e6c5b272c73670efd8cdbcb6eb4e4","infoHashBuffer":{"type":"Buffer","data":[158,71,90,31,194,158,108,91,39,44,115,103,14,253,140,219,203,110,180,228]},"announce":[],"urlList":[]}}