{"title":"Space Grunts v1.3.11 APK (Android)","uid":14259380,"size":16155395,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:9e5f023f96c97a9ecae5832e50b2ea56a918af3f&amp;dn=Space+Grunts+v1.3.11+APK+%28Android%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pahly","files":1,"time":1460236554,"description":"Space Grunts combines fast paced arcade action with turn-based gameplay!\r\n\r\nThe year 2476, Earth's space-federation has been building moon-bases across the galaxy. One of those moon-bases has been sending a distress signal. Space Grunts are a group of intergalactic &quot;problem&quot; solvers, sent to investigate..\r\n\r\nYou play one, out of a team, of Space Grunts, and your mission is simple: find your way into the moon-base, and figure out what has happened. You'll have to fight your way through aliens, robots, security drones and base-systems. Find the lower levels of the moon-base, and get to the core of the problems.\r\n\r\nConsumables\r\nA large collection of consumables can be found all over the moon base from weapon enhancers, to destructive toys, armor, explosives, system-hacks, and more. Use the items wisely to advance deeper into the moon-base.\r\n\r\nWeapons\r\nStarting with three standard Grunt weapons, you will be able to enhance them for more fire-power and range. On your way you'll also find alternate weapons, and melee weapons.\r\n\r\nSecrets\r\nThere are various ways to complete the game, anomalies leading to weird places, underground routes, and mysterious items to transport you to other area's of the moon-base. On top of these there are secret rooms and area's located all over the base, so never a dull moment!\r\n\r\nCan you find the core of the problems?\r\n\r\nWhat's new in this version : (Updated : 22 March 2016)\r\nsupport http://www.orangepixel.net/forum/\r\n- small fix: secret cave entrance now has a bigger chance of appearing\r\nRequired Android O/S : 2.3+","torrent":{"xt":"urn:btih:9e5f023f96c97a9ecae5832e50b2ea56a918af3f","amp;dn":"Space+Grunts+v1.3.11+APK+%28Android%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e5f023f96c97a9ecae5832e50b2ea56a918af3f","infoHashBuffer":{"type":"Buffer","data":[158,95,2,63,150,201,122,158,202,229,131,46,80,178,234,86,169,24,175,63]},"announce":[],"urlList":[]}}