{"title":"Cognitive Behavioural Therapy Workbook For Dummies - Gooner","uid":13536854,"size":132252882,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a184b0b022a40546b3351eef44a19e0424162da8&amp;dn=Cognitive+Behavioural+Therapy+Workbook+For+Dummies+-+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1455445426,"description":"Cognitive Behavioural Therapy Workbook For Dummies - 2nd Edition (2012) (Pdf &amp; Epub) Gooner\r\n\r\nPublisher: For Dummies; 2 edition (February 20, 2012)\r\nLanguage: English\r\nISBN-10: 1119951402\r\nISBN-13: 978-1119951407\r\n\r\nDozens of practical exercises and easy to perform techniques for banishing negative thoughts before they take hold\r\nWhether you're trying to overcome anxiety and depression, boost self-esteem, beat addiction, lose weight, or simply improve your outlook, cognitive behavioural therapy (CBT) offers a practical, sensible approach to mastering your thoughts and thinking constructively. In this updated and expanded edition of the companion workbook to their bestselling Cognitive Behavioural Therapy For Dummies, professional therapists Rhena Branch and Rob Wilson show you, step-by-step, how to put the lessons provided in their book into practice. Inside you'll find a huge number of hands-on exercises and techniques to help you remove roadblocks to change and regain control over your life.\r\n\r\nCognitive Behavioural Therapy Workbook For Dummies, Second Edition:\r\n\r\nDevelops the ideas and concepts that presented in the bestselling Cognitive Behavioural Therapy For Dummies, Second Edition and provides exercises to put those ideas into practice\r\nFeatures a range of hands-on CBT exercises and techniques for beating anxiety or depression, boosting your self-esteem, losing weight, or simply improving your outlook on life\r\nRhena Branch and Rob Willson are CBT therapists at the Priory Clinic in London, and the authors of Cognitive Behavioural Therapy For Dummies","torrent":{"xt":"urn:btih:a184b0b022a40546b3351eef44a19e0424162da8","amp;dn":"Cognitive+Behavioural+Therapy+Workbook+For+Dummies+-+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a184b0b022a40546b3351eef44a19e0424162da8","infoHashBuffer":{"type":"Buffer","data":[161,132,176,176,34,164,5,70,179,53,30,239,68,161,158,4,36,22,45,168]},"announce":[],"urlList":[]}}