{"title":"Anne Fortier - Julia / Zaginione Wojowniczki [PL]","uid":14298209,"size":1140698381,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a22deb0e5ea0c26ffd9715c75d76fdf3ed734990&amp;dn=Anne+Fortier+-+Julia+%2F+Zaginione+Wojowniczki+%5BPL%5D+MP3%40VBR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"everdarksoul","files":130,"time":1460470231,"description":"Paczka audiobook'ów dwóch powieści przygodowych dla młodzieży, autorstwa Anne Fortier. Jest to literatura ukierunkowana głównie na odbiorców wśród młodych dziewcząt, ale nie tylko - rodzinne sekrety, rozwiązywanie zagadek i odkrywanie tajemnic z przeszłości, poszukiwania skarbów i wreszcie: pyszna przygoda oraz wątki romantyczne, skuszą zapewne również sporą część chłopców, a pewnie i wielu dorosłych czytelników, którzy nie zatracili w sobie młodzieńczej pasji odkrywania świata i jego tajemnic, na zawsze pozostając poszukiwaczami przygód.\r\nPaczka zawiera:\r\n\r\n1. Anne Fortier - Julia (powieść romantyczno-przygodowa)\r\nMłodej Amerykance, Julii, ciotka zapisuje w testamencie list. Wynika z niego, że jej rodzina pochodzi z Włoch, gdzie niegdyś zginęła też jej matka - próbując rozwikłać ważną tajemnicę... Tam, w Sienie, ponoć czeka na nią drogocenny spadek.\r\nAle po przyjeździe Julia znajduje tylko stare papiery i... krewnych, o istnieniu których nie miała pojęcia. Okazuje się, że szacowny ród wydał przed wiekami inną Julię - tę uwiecznioną przez Szekspira...\r\nPodczas pobytu we Włoszech, Julia pozna rodzinną tajemnicę i prawdziwe losy swej średniowiecznej imienniczki, uniknie śmiertelnego niebezpieczeństwa, a w końcu - zakocha się… \r\n\r\nDane:\r\n\r\n414 MB / 54x MP3-VBR / czas: 15:56:45 / czyta: Agata Kulesza\r\n_______________________________________________________________________\r\n\r\n2. Anne Fortier - Zaginione Wojowniczki (powieść sensacyjno-przygodowa)\r\nPracująca w Oxfordzie młoda uczona, Diana Morgan, specjalizuje się w językach starożytnych. Od dzieciństwa fascynuje się mitologią grecką, a w szczególności - za sprawą swej babki - tematem starożytnych wojowniczek, Amazonek. Ekscentryczna babka Diany, nim pewnego dnia zniknęła bez śladu, opowiadała wnuczce, że sama jest jedną z nich. Współpracownicy Diany z politowaniem kręcą głową nad jej obsesją - jednak pewnego dnia, tajemnicza fundacja składa jej propozycję nie do odrzucenia...\r\nDiana udaje się do Afryki Północnej i dołącza do poszukiwacza skarbów - Nicka Barrana. Na ścianie świątyni ukrytej dotąd pod piaskami pustyni odkrywa imię pierwszej królowej Amazonek  - Myriny. Kierując się wskazówkami z inskrypcji, Diana i Nick ruszają na poszukiwania legendarnego skarbu, który Amazonki wywiozły z oblężonej Troi. Diana nie domyśla się, jakiej natury jest ów skarb, wie natomiast, że Nick realizuje swój własny plan. Nie mogąc zaufać nikomu i nieustannie czując czyjś oddech na plecach, Diana zbliża się do odkrycia prawdy, która zmieni jej świat...\r\n&quot;Zaginione Wojowniczki&quot; przenoszą nas z Anglii do Afryki Północnej, do Grecji i Turcji, ze starożytności do współczesności - to zapierająca dech w piersiach, oszałamiająca podróż dwóch kobiet na równoległych wyprawach, Diany Morgan i Myriny. Nieustraszone bohaterki walczą o życie, lecz także o to, by dziedzictwo Amazonek nie przepadło na wieki...\r\n\r\nDane:\r\n\r\n672 MB / 69x MP3-64 Kbps / czas: 24:21:30 / czyta: Weronika Nockowska","torrent":{"xt":"urn:btih:a22deb0e5ea0c26ffd9715c75d76fdf3ed734990","amp;dn":"Anne+Fortier+-+Julia+%2F+Zaginione+Wojowniczki+%5BPL%5D+MP3%40VBR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a22deb0e5ea0c26ffd9715c75d76fdf3ed734990","infoHashBuffer":{"type":"Buffer","data":[162,45,235,14,94,160,194,111,253,151,21,199,93,118,253,243,237,115,73,144]},"announce":[],"urlList":[]}}