{"title":"Later with Jools Holland S48E01 720P WEBrip.mp4","uid":14383317,"size":539656049,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a25c9230f097126bc762ed282a876d6e16ee2ac4&amp;dn=Later+with+Jools+Holland+S48E01+720P+WEBrip.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JohnRumOh","files":1,"time":1461251810,"description":"720p hd webrip from the BBC iPlayer\r\nAired: 19 April 2016, 10pm.\r\n\r\nJoining Jools on the first show of the series is Birmingham-born Laura Mvula, who returns to the show with tracks from her upcoming second album The Dreaming Room, which builds on the rich sound of her big-selling debut Sing to the Moon and sees her working with the likes of Nile Rodgers and John Scofield.\r\n\r\nJools also welcomes singer-songwriter Paul Simon for a rare solo appearance as he launches his latest solo album Stranger to Stranger on the eve of a major American tour. He performs a new song and a classic. From east London, acclaimed British grime MC Kano returns to the Later... studio to run through tracks from his recent top 10 album Made in the Manor, his first album in six years which has been described as 'as much a love letter to his East End roots as it is a forensic portrayal of inner city England today, with just the merest hint of dark prophecy about what trouble may lie round the corner.'\r\n\r\nMaking his debut on the show is singer-songwriter and guitarist Jason Isbell. A former member of alt-country band Drive By Truckers, he performs a couple of tracks from his recent Grammy award-winning album Something More Than Free. Also performing on the show are psych rock band The Coral, who return to the show to perform tracks from their recent seventh album Distance Inbetween, the Wirral quintet's first set of new songs in five years. Completing the line-up are Boston's harmony-driven and hard-gigging Lake Street Dive, who will be making their UK TV debut. Lead by vocalist Rachael Price, their new album Side Pony develops their swing-jazz take on the 60s of Motown and The Beatles","torrent":{"xt":"urn:btih:a25c9230f097126bc762ed282a876d6e16ee2ac4","amp;dn":"Later+with+Jools+Holland+S48E01+720P+WEBrip.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a25c9230f097126bc762ed282a876d6e16ee2ac4","infoHashBuffer":{"type":"Buffer","data":[162,92,146,48,240,151,18,107,199,98,237,40,42,135,109,110,22,238,42,196]},"announce":[],"urlList":[]}}