{"title":"Midnight.Cowboy.1969.1080p.Bluray.x264.DTS-SARTRE","uid":14119450,"size":4998548210,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a2e9a8f2e34a736f5273b9125c10a4d4690218ca&amp;dn=Midnight.Cowboy.1969.1080p.Bluray.x264.DTS-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sartre7","files":10,"time":1459463421,"description":"Based on a James Leo Herlihy novel, British director John Schlesinger's first American film dramatized the small hopes, dashed dreams, and unlikely friendship of two late '60s lost souls. Dreaming of an easy life as a fantasy cowboy stud, cheerful Texas rube Joe Buck (Jon Voight) heads to New York City to be a gigolo, but he quickly discovers that hustling isn't what he thought it would be after he winds up paying his first trick (Sylvia Miles). He gets swindled by gimpy tubercular grifter Rico &quot;Ratso&quot; Rizzo (Dustin Hoffman) but, when Joe falls in the direst of straits, Ratso takes Joe into his condemned apartment so that they can help each other survive. Things start to look up when Joe finally lands his first legit female customer (Brenda Vaccaro) at a Warhol-esque party; Ratso's health, however, fails. Joe turns a final trick to get the money for one selfless goal: taking Ratso out of New York to his dream life in Miami. \r\n\r\nOne of the first major studio films given the newly minted X rating for its then-frank portrayal of New York decadence, Midnight Cowboy was critically praised for Schlesinger's insight into American lives, with the intercut mosaic of Joe's memories and Ratso's dreams lending their characters and actions greater psychological complexity. While they may have been drawn by the seamy content (tame by current standards), the young late '60s audience responded to Joe's and Ratso's confusion amidst turbulent times and to the connection they make with each other despite their alienation from the surrounding culture. \r\n\r\nMidnight Cowboy became one of the major financial and artistic hits of 1969, winning Oscars for Best Picture (the first for an X-rated film), Best Director, and former blacklistee Waldo Salt's screenplay. Though the one-two punch of Midnight Cowboy and The Graduate (1967) proved Hoffman's range and Voight's Joe Buck made him a star, both lost Best Actor to classical cowboy John Wayne for True Grit. The film was later re-rated R by the MPAA.\r\n\r\n\r\n\r\n\r\nSTARS.........: Dustin Hoffman, Jon Voight, Sylvia Miles\r\nDIRECTOR......: John Schlesinger\r\nWRITERS.......: Waldo Salt (screenplay), James Leo Herlihy (novel)\r\nGENRE.........: Drama\r\nRATING........: 7.9/10  74,560 votes\r\nIMDB link.....: http://www.imdb.com/title/tt0064665\r\nRUNTIME.......: 1h 53mn\r\nSIZE..........: 4.63 GiB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x1040\r\nASPECT RATIO..: 1.85:1\r\nBITRATE.......: 5000 Kbps (3-Pass)\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO1........: English DTS 5.1 768Kbps\r\nAUDIO2........: Commentary with John Schlesinger &amp; Jerome Hellman\r\nSUBTITLES.....: ENG, DAN, PER \r\nCHAPTERS......: Yes\r\nSOURCE........: Blu Ray Remux\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2016-03-28\r\n\r\n\r\n\r\n\r\n\r\nScreenshots\r\n \nhttp://postimg.org/gallery/20y91fvkk/","torrent":{"xt":"urn:btih:a2e9a8f2e34a736f5273b9125c10a4d4690218ca","amp;dn":"Midnight.Cowboy.1969.1080p.Bluray.x264.DTS-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2e9a8f2e34a736f5273b9125c10a4d4690218ca","infoHashBuffer":{"type":"Buffer","data":[162,233,168,242,227,74,115,111,82,115,185,18,92,16,164,212,105,2,24,202]},"announce":[],"urlList":[]}}