{"title":"John-Batchelor-syria-russia-offensive--euphrates.mp3","uid":14118356,"size":19415122,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a455fee560892bbaf03722316040db40bb6a33c2&amp;dn=John-Batchelor-syria-russia-offensive--euphrates.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1459451198,"description":"Syria/Russia Offensive Aims for the Euphrates River Valley -- Raqqa to Mosul. US Participation? ISIS Boasts of Recruiting Airport Staff for Operations. Aaron Klein, Breitbart Jerusalem.\r\n\r\n Syria/Russia Offensive Aims for the Euphrates River Valley -- Raqqa to Mosul. US Participation? ISIS Boasts of Recruiting Airport Staff for Operations. Aaron Klein, Breitbart JJerusalem. Russia and the United States are discussing &quot;concrete&quot; military coordination to liberate the Islamic State stronghold of Raqqa in Syria, Interfax news agency cited Russian Deputy Foreign Minister Oleg Syromolotov as saying on Wednesday. http://www.reuters.com/article/us-mideast-crisis-syria-raqqa-idUSKCN0WW1HD ____________ TEL AVIV – For the second time in recent days, Abu al-Ayna al-Ansari, a top jihadi operative in the Gaza Strip, claimed that the Islamic State has recruited agents among airport personnel worldwide. Ansari was speaking to Breitbart Jerusalem on Tuesday from the Gaza Strip. He made the comments in the wake of the hijacking of an EgyptAir plane forced to land in Cyprus by a passenger claiming to be wearing an explosive suicide belt. The alleged hijacker, named by Cypriot officials as Seif Eldin Mustafa, has been taken into custody amid conflicting reports about his motivation. Some are saying the hijacker was seeking to talk to his estranged wife who lives in Cyprus, while other reports are claiming the man presented political demands, including the release of female prisoners in Egypt. Ansari stressed that he does not know the hijacker or his motives. However, the jihadist warned that, regardless of today’s incident, the Islamic State “has successfully recruited collaborators among airport personnel around the world. http://www.breitbart.com/jihad/2016/03/29/top-gaza-jihadi-doubles-down/","torrent":{"xt":"urn:btih:a455fee560892bbaf03722316040db40bb6a33c2","amp;dn":"John-Batchelor-syria-russia-offensive--euphrates.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a455fee560892bbaf03722316040db40bb6a33c2","infoHashBuffer":{"type":"Buffer","data":[164,85,254,229,96,137,43,186,240,55,34,49,96,64,219,64,187,106,51,194]},"announce":[],"urlList":[]}}