{"title":"Over 9000 Zombies! - TheDarkKnight","uid":14317401,"size":95982263,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a56db033f961aefa699809d475a4df8aea804dce&amp;dn=Over+9000+Zombies%21+-+TheDarkKnight&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"batknight2016","files":1,"time":1460588289,"description":"http://store.steampowered.com/app/273500/\r\n\r\n&lt;iframe width=&quot;560&quot; height=&quot;315&quot;frameborder=&quot;0&quot; allowfullscreen&gt;&lt;/iframe&gt;\r\n\r\nAbout This Game\r\n\r\nOver 9000 Zombies! is top-down arcade action blown out of all reasonable proportions. An endless horde of zombies is coming your way, how long can you survive? \r\n\r\nSo you might have already sussed out that there’s a lot of undead after you. To stay alive you’re going to need this arsenal of over 20 weapons. Some you might recognize but others are very experimental. Whether you want to shoot, burn, blow up or microwave the zombies there’ll be a weapon for you. \r\n\r\nKeeping the barrel of a gun between you and the zombies is a good start but you’ll want to stay out of the open when things get especially crazy. Scavenge scrap metal to build barricades for protection and deploy automated turrets for extra crowd control. \r\n\r\nYou don’t have to go it alone. Bring both trusted friends and talented strangers into your fold and team up against the hordes with 2 player online co-op and 4 player local co-op. \r\n\r\nThis level of slaughter needs some decent beats. Using cutting edge research techniques we have been able to isolate the optimum audio for efficient undead butchery. Scratch that trigger-finger itch to the sound of intense electro-rock from Clearside. \r\n\r\nThe zombies will never stop. They’re only going to get faster and nastier. Keep your eyes peeled for flaming zombies, highly poisonous zombies, zombie animals, giant eyeballs and even the risen remains of political figures. You’re going to die out there so make sure you leave with a bang. \r\n\r\nCreate your own unique levels to test your mettle and the power of the zombie hordes. Upload them to the Steam Workshop and show the world your creations","torrent":{"xt":"urn:btih:a56db033f961aefa699809d475a4df8aea804dce","amp;dn":"Over+9000+Zombies%21+-+TheDarkKnight","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a56db033f961aefa699809d475a4df8aea804dce","infoHashBuffer":{"type":"Buffer","data":[165,109,176,51,249,97,174,250,105,152,9,212,117,164,223,138,234,128,77,206]},"announce":[],"urlList":[]}}