{"title":"John-Batchelor-us-prc-nuclear-arsenals-escalation.mp3","uid":14383729,"size":20686858,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a596db23f674ec3a3c29f4d5256feebf16065537&amp;dn=John-Batchelor-us-prc-nuclear-arsenals-escalation.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1461255249,"description":"US &amp; PRC Nuclear Arsenals: Engagement or Escalation? @elbridgecolby CNAS. @gordongchang, Daily Beast\r\n\r\nEXECUTIVE SUMMARY\r\n\r\nThis essay lays out U.S. and Chinese views on and interests in the nuclear weapons domain, describes how the stability model could serve as an appropriate framework for bilateral engagement, proposes specific collaborative initiatives the two nations could profitably pursue, and identifies remaining disagreements that will need to be managed.\r\n\r\nMAIN ARGUMENT\r\n\r\nNuclear weapons play an important role in Sino-U.S. relations. In light of changing strategic dynamics and the potential for deeper competition between China and the U.S., that role could grow. While the two sides differ on a range of issues and in their perspectives on the appropriate role of strategic forces, both countries profit from intelligent and constructive interaction on strategic matters and would benefit from deeper and more focused engagement grounded in a stability model. In particular, such engagement could help diminish the chances that relations deteriorate or even of crisis or conflict due to essentially mistaken, misperceived, or accidental causes. Given the consequences of a substantial deterioration in relations, let alone the outbreak of war, it is important and of common benefit for the two states to pursue such initiatives.\r\n\r\nPOLICY IMPLICATIONS\r\n\r\n•\tThe U.S. and China should base their relations in the nuclear weapons domain on the concept of strategic stability.\r\n\r\n•\tThe U.S. and China should focus dialogue on eliciting greater insight into how the other thinks about the role and potential use of nuclear weapons, its red lines, its perception of vital interests, its conception of escalation, and related topics.\r\n\r\n•\tThe U.S. and China should pursue a range of specific initiatives focused on developing agreed-upon concepts of and frameworks for strategic stability, enabling the two sides to demonstrate that their military programs are consistent with such frameworks, and generating mechanisms to help avoid accidental escalation and de-escalate crises if they arise.\r\n\r\n•\thttp://www.nbr.org/publications/specialreport/pdf/Free/06192016/SR57_US-China_April2016.pdf.\r\n\r\nThe John Batchelor Show","torrent":{"xt":"urn:btih:a596db23f674ec3a3c29f4d5256feebf16065537","amp;dn":"John-Batchelor-us-prc-nuclear-arsenals-escalation.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a596db23f674ec3a3c29f4d5256feebf16065537","infoHashBuffer":{"type":"Buffer","data":[165,150,219,35,246,116,236,58,60,41,244,213,37,111,238,191,22,6,85,55]},"announce":[],"urlList":[]}}