{"title":"Taboo Casting Calls 5 XXX (NEW) DVDRip x264","uid":14206054,"size":2260645498,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:a7d9940b15919e46c160c5ea580102e844ea94c2&amp;dn=+Taboo+Casting+Calls+5+XXX+%28NEW%29+DVDRip+x264+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LucasCar","files":3,"time":1459971132,"description":"Category: Double Oral, Blowjobs, Handjobs, Threesome, Facials, Cumshots, Interracial, Auditions, POV\r\n\r\nCast: Dava Foxx, Gina West, Akira Shell, Jenni Bliss, Camille Black, Penny Nichols, Sierra Simmons, Violet Monroe\r\n\r\n.:Description:.\r\nWhen a girl that looks this good walks through our door, of course, we're going to try to get her to suck a dick! 8 girls get tricked into making us cum! Gina West - We heard from a little blue bird that fitness model and MILF Gina West was looking to get back into porn after a short hiatus. Gina's agent sent her our friend's way in hopes she could make some cash shooting with them, but when we caught her before they did we took the opportunity to trick her into our &quot;Blow Job Challenge.&quot; Gina was very confident with her years of cock sucking experience that she said yes to our offer! After getting her to show us her very sexy, firm and fit naked body she dropped to her knees and went to town! Although Gina did have some pretty amazing blowjob skills, our guy managed to hold out past the 4 minutes, her to take out the penalty shot... right to the face! Imagine her surprise after taking a facial only to find out it was for nothing! Dava Foxx - Some days we really get lucky and this was one of them. Sexy MILF Dava Foxx was in town for some shoots and we managed to get in on her audition set before the staff arrived. We convinced Dava it was legit and totally duped her with an awesome blowjob challenge. I can't wait for you to see her reaction when she finds out she sucked dick for nothing. Violet Monroe - Sexy redhead Violet came through our door looking for the casting department, and I immediately decided she needed to take the blowjob challenge! After I got her naked it was way too easy to get her to accept the challenge. She hit her knees like a pro and blew more than my mind. She gives amazing head. But the real question is did she get me to cum before time was up? Jennifer Bliss - Jenni Bliss has been around for a bit so when we heard she was in town we decided to giver her a shot. After stripping and showing off for the &quot;casting&quot; she was told we had everything we needed which got her asking for extra work. Well that made it pretty easy to get her to do the challenge for sure. Jenni sucked and stroked trying to beat the cock. Did she?\r\nTake a look at screenshots! Enjoy!\r\n \nhttp://naughtyimage.com/img-570547f892578.html\r\n \nhttp://naughtyimage.com/img-570547fe00e35.html\r\n\r\n\r\n\r\n* * * For more stuff please visit * * *                                \nhttps://thepiratebay.se/user/LucasCar/","torrent":{"xt":"urn:btih:a7d9940b15919e46c160c5ea580102e844ea94c2","amp;dn":"+Taboo+Casting+Calls+5+XXX+%28NEW%29+DVDRip+x264+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7d9940b15919e46c160c5ea580102e844ea94c2","infoHashBuffer":{"type":"Buffer","data":[167,217,148,11,21,145,158,70,193,96,197,234,88,1,2,232,68,234,148,194]},"announce":[],"urlList":[]}}