{"title":"Xev Bellringer Taming Your Goddess [1080p]","uid":13512429,"size":2308199037,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:a8bd939c9c5fd8109eb3499cd54f76c67f96af41&amp;dn=Xev+Bellringer+Taming+Your+Goddess+%5B1080p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"xxxsunset","files":1,"time":1455297763,"description":"Screenshots: \nhttp://imgur.su/image/p3cZ\r\n\r\n&quot;The funniest thing just happened, I almost forgot you existed. And yet, here you are...bound and gagged in my house. You look pathetic struggling against your restraints. There's no use, Goddess Xev is always one step ahead of you. The sooner you accept your fate as my slave, the easier life will become for you.&quot;&quot;Would you like to review the rules? The slave's primary objective is always to please his Goddess. Your cock is now the property of Goddess Xev. To receive pleasure the slave must earn it. You are nothing more than object to be used by your Goddess. A slave will worship his Goddess. Would you like a tour of the divine body you are unworthy of?&quot;&quot;Oh you can hardly handle this, you're about to explode...pathetic. I'm not done with you yet...how agonizing it must be watching my wet tongue barely flick the tip of your throbbing cock. Your Goddess can be so generous...and so cruel. I've had enough fun with my slave today, haha! &quot;Goddess Xev shoves the black hood back over your head, shrouding you in darkness once again, and laughs as she strides out of the room. Little did she know, you've been steadily loosening yourself from your binds and finally manage to free your hands. The slave will get what he wants now....Goddess Xev wakes up to find herself completely at the mercy of her sexually frustrated, disobedient slave. She struggles fruitlessly against her restraints, cursing you. &quot;Release me now! I knew there was something wrong with you - constantly failing to obey your Goddess's will, resisting all of my training. I will NOT suck your cock, this is NO way to treat a Goddess! Just let me go and you won't be a slave under my roof ever again. You are vile...&quot;Defeated and bound, Goddess Xev squirms across the bed to you. You relish the moment as the desperate dominatrix clumsily works your cock with just her wet mouth. There is fire in her eyes, Goddess Xev is utterly humiliated by serving an unworthy slave. You can barely contain yourself and cum all over your mistress's face. Fuming, Xev demands to be let go, but you are not finished debasing her yet.Xev has been stripped of her dress and tied to a chair. Her legs are spread and a vibrator has been secured to her pussy. Xev's face drips sexily with cum and she is forced to taste your seed as the cleave gag parts her lips - it is the ultimate insult. Dirty panties have been placed over her head and 'SLUT' written across her chest with lipstick. Goddess Xev silently simmers, planning her revenge. That changes as soon as you turn on the vibrator, sending waves of intense pleasure throughout her body. Xev's favorite instrument of pleasure is being forced upon her by an unworthy slave. Your Goddess resists with all her might, determined to refuse you the satisfaction of inducing an unwanted orgasm. She fails, climaxing hard and loud. You take pictures of of her broken, debased state for blackmail. You'll make sure Goddess Xev remains your personal sex slave","torrent":{"xt":"urn:btih:a8bd939c9c5fd8109eb3499cd54f76c67f96af41","amp;dn":"Xev+Bellringer+Taming+Your+Goddess+%5B1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8bd939c9c5fd8109eb3499cd54f76c67f96af41","infoHashBuffer":{"type":"Buffer","data":[168,189,147,156,156,95,216,16,158,179,73,156,213,79,118,198,127,150,175,65]},"announce":[],"urlList":[]}}