{"title":"Mark Knopfler-Guitar Stories-2012-10-16-Proshot AVCHD","uid":13527802,"size":3754956459,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b0a42f95d0a496152f6f6db7079dab5b8c70b3ca&amp;dn=Mark+Knopfler-Guitar+Stories-2012-10-16-Proshot+AVCHD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GRNS3","files":27,"time":1455398512,"description":"Here is a nice bootleg. Check my account for more classic bootlegs.\r\n\r\nPlease enjoy, share with friends and please seed :)\r\n\r\n\r\nMark Knopfler\r\nGuitar Stories\r\nSky Arts HD Broadcast\r\n16th Oct 2012\r\n\r\nProshot AVCHD\r\n\r\nMark Knopfler takes his former Dire Straits band mate John Illsley on a journey to discover the six guitars that defined his sound and music \r\n\r\n\r\nIt begins in the music shops in Central Arcade in Newcastle, where Knopfler spent many a childhood hour staring longingly through the shop window at a Fender Stratocaster. There, Knopfler unveils his first-ever guitar, a Höfner V2 that cost his dad £50 in 1964.\r\n \r\nUnable to afford an amp, Knopfler recalls blowing up several family radios before he landed a job as reporter and moved to Leeds in 1969. Heading to nearby Robin Hood's Bay, Knopfler introduces Illsley to blues artist Steve Phillips, with whom he used to regularly jam and who sold Knopfler his second guitar, a louder and more garish National that would be made famous by the cover of the Dire Straits' fifth album Brothers in Arms.\r\n\r\n As Knopfler moved to London in 1973 and formed Dire Straits, he splashed out on the Fender Stratocaster he had wanted since his school days. He and Illsley reminisce about the early days of Dire Straits as they visit the house that was originally Pathway Studios where they, along with Elvis Costello, Madness and The Squeeze, put down tracks. They recall gigs they played on the path outside their flat in Deptford as well as the first time one of their songs was played on the radio - an event they missed because they were moving furniture.\r\n\r\n As Dire Straits' success grew, so did Knopfler's guitar collection. Next he turned to the Gibson Les Paul to perfect his iconic style, used on hits including Money For Nothing as well as album Brothers in Arms. As Knopfler grew tired of countless guitar changes per concert, he met Rudy Pensa, a luthier and guitar shop owner in New York. In his famous store on 48th Street, Knopfler recalls how they designed a new guitar with a wider range of sounds on a napkin in a cafe in 1980: The Pensa MK1.\r\n\r\n Finally, the most recent chapter in Knopfler's journey as a guitarist takes him and Illsley to the workshop of John Monteleone. He crafted Knopfler's Monteleone Isabella in 2008, a guitar Knopfler considered so exquisite, he made it the subject of one of his songs.\r\n\r\nLineage&gt;DVB-S2&gt;HDD&gt;Videredo&gt;MultiAVCHD&gt;You\r\nThis is a direct clone of the transport stream,no re encoding at all\r\n\r\nMenu and Chapters\r\nRunning Time 44 Min\r\n\r\nVideo-10.2Mbps 1920x1080(16:9) 25fps AVC\r\nAudio 384Kbps 48Khz 16bit 2 channel AC-3","torrent":{"xt":"urn:btih:b0a42f95d0a496152f6f6db7079dab5b8c70b3ca","amp;dn":"Mark+Knopfler-Guitar+Stories-2012-10-16-Proshot+AVCHD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0a42f95d0a496152f6f6db7079dab5b8c70b3ca","infoHashBuffer":{"type":"Buffer","data":[176,164,47,149,208,164,150,21,47,111,109,183,7,157,171,91,140,112,179,202]},"announce":[],"urlList":[]}}