{"title":"Chemical Vapour Deposition - Precursors, Processes and Applicati","uid":14522114,"size":80920819,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1e44253b30d483e8ff5d600286aaba7be81aa78&amp;dn=Chemical+Vapour+Deposition+-+Precursors%2C+Processes+and+Applicati&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1462400243,"description":"Chemical Vapour Deposition - Precursors, Processes and Applications - Anthony C. Jones, Michael L. Hitchman (RSC, 2009).pdf\r\n\r\nISBN 978-0-85404-465-8\r\n\r\nChemical Vapour Deposition (CVD) involves the deposition of thin solid films from chemical precursors in the vapour phase, and encompasses a variety of deposition techniques, including a range of thermal processes, plasma enhanced CVD (PECVD), photon- initiated CVD, and atomic layer deposition (ALD). The development of CVD technology owes a great deal to collaboration between different scientific disciplines such as chemistry, physics, materials science, engineering and microelectronics, and the publication of this book will promote and stimulate continued dialogue between scientists from these different research areas. The book is one of the most comprehensive overviews ever written on the key aspects of chemical vapour deposition processes and it is more comprehensive, technically detailed and up-to-date than other books on CVD. The contributing authors are all practising CVD technologists and are leading international experts in the field of CVD. It presents a logical and progressive overview of the various aspects of CVD processes. Basic concepts, such as the various types of CVD processes, the design of CVD reactors, reaction modelling and CVD precursor chemistry are covered in the first few chapters. Then follows a detailed description of the use of a variety CVD techniques to deposit a wide range of materials, including semiconductors, metals, metal oxides and nitrides, protective coatings and functional coatings on glass. Finally and uniquely, for a technical volume, industrial and commercial aspects of CVD are also discussed together with possible future trends, which is an unusual, but very important aspect of the book. The book has been written with CVD practitioners in mind, such as the chemist who wishes to learn more about CVD processes, or the CVD technologist who wishes to gain an increased knowledge of precursor chemistry. The volume will prove particularly useful to those who have recently entered the field, and it will also make a valuable contribution to chemistry and materials science lecture courses at undergraduate and postgraduate level","torrent":{"xt":"urn:btih:b1e44253b30d483e8ff5d600286aaba7be81aa78","amp;dn":"Chemical+Vapour+Deposition+-+Precursors%2C+Processes+and+Applicati","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1e44253b30d483e8ff5d600286aaba7be81aa78","infoHashBuffer":{"type":"Buffer","data":[177,228,66,83,179,13,72,62,143,245,214,0,40,106,171,167,190,129,170,120]},"announce":[],"urlList":[]}}