{"title":"Geoengineering - A War Against HumanPORTANT! LETS STOP IT!","uid":14362644,"size":159666236,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b386a6c0b95fbb074193ff9257bf84b4950ec089&amp;dn=Geoengineering+-+A+War+Against+HumanPORTANT%21+LETS+STOP+IT%21&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TruthB0mb","files":1,"time":1461107148,"description":"This is important we are only 15,308 people away from getting a popular activism website to launch a campaign to put an immediate stop to what's happening in our skies! There's no time to doubt this anymore as the evidence is overwhelming! Look at Naza earth view you can see the chemical trails in the satellite imagery. You can look up and see them spraying everyday in the skies. You can see the plants and trees dying from aluminum, barium, strontium and other metals and toxic chemicals drifting down after being released into the sky! These aerosols are also burning holes in the ozone layer along with causing respiratory illnesses within people!\r\n\r\nPlace immediately a world wide ban on this harmful to humans harmful to the planet practice: \nhttps://secure.avaaz.org/en/petition/A_world_wide_ban_on_illegal_Chemtrail_spraying/?pv=83\r\n\r\nFor humanity we must take action now, or the powers that shouldn't be in their quest to kill us off, just may very well kill the planet in their delusional quest for power!\r\n\r\nIn this video is a quick and nicely said call to action pertaining to this issue! Respiratory failure has over taken heart disease as the #3 killer, we can't afford to wait any longer we must act now!\r\n\r\nPeople of the world, for humanity, let's put an end to this massive culling of our populations! \r\n\r\nFor the full video of the &quot;People for Change Rally, CA State Capitol, 4-6-16&quot; \r\nIt's here:\r\n\r\nThank you, and may your humanity guide you!","torrent":{"xt":"urn:btih:b386a6c0b95fbb074193ff9257bf84b4950ec089","amp;dn":"Geoengineering+-+A+War+Against+HumanPORTANT%21+LETS+STOP+IT%21","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b386a6c0b95fbb074193ff9257bf84b4950ec089","infoHashBuffer":{"type":"Buffer","data":[179,134,166,192,185,95,187,7,65,147,255,146,87,191,132,180,149,14,192,137]},"announce":[],"urlList":[]}}