{"title":"Dalton Fury-One Killer Force","uid":14347444,"size":312983026,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b3e75edbeec9fd0fdd56c9e13147ee0fcadde468&amp;dn=Dalton+Fury-One+Killer+Force&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"twocows","files":32,"time":1460991947,"description":"One Killer Force\r\nby Dalton Fury\r\n\r\nStill recovering from his near fatal wounds suffered at the Yellow Creek Nuclear Plant, Delta Force Commander, Major Kolt &quot;Racer&quot; Raynor, is thrust into a new battle with some of the toughest killers he's ever faced - US Navy SEALs. Government austerity measures have the Joint Chiefs of Staff contemplating the unthinkable - combining Delta Force and the SEALs into a single unit or eliminate one entirely. Kolt's career is in jeopardy and worst of all, the final say rests in the hands of men who have reasons to want to see Kolt gone.\r\nRecovered from her own wounds, Cindy &quot;Hawk&quot; Bird is closing in on becoming the first official female operator in the history of the US militaryShe only has to survive an insertion into the most repressive regime on earth.\r\n\r\nMeanwhile, a new terrorist threat looms on the horizon in the form of not one, but possibly two mushroom clouds. Kolt earns his call sign as the action has him racing to the world's hottest combat zones from Syria to Ukraine on hunter-killer missions to eliminate the terrorists before they can enact their deadly mission.\r\n\r\nHalf a world away, a spy deep in the secretive North Korean regime sends a desperate call for help. A new danger to world peace and security is growing in the heart of the increasingly unstable Communist country and no amount of sanctions or political negotiations are going to stop it. Violently applied force is needed, and needed now before it's too late","torrent":{"xt":"urn:btih:b3e75edbeec9fd0fdd56c9e13147ee0fcadde468","amp;dn":"Dalton+Fury-One+Killer+Force","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3e75edbeec9fd0fdd56c9e13147ee0fcadde468","infoHashBuffer":{"type":"Buffer","data":[179,231,94,219,238,201,253,15,221,86,201,225,49,71,238,15,202,221,228,104]},"announce":[],"urlList":[]}}