{"title":"REM (NEW 2016 VIVTHOMAS - METART) [DVD RIP ALL 4 SPLIT SCENES]","uid":14420220,"size":787523590,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b6b99592696c0c4d011b3e5066934b04dae693ee&amp;dn=+REM+%28NEW+2016+VIVTHOMAS+-+METART%29+%5BDVD+RIP+ALL+4+SPLIT+SCENES%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TechLatina","files":4,"time":1461535974,"description":"\nREM (NEW 2016 VIVTHOMAS - METART) [DVD RIP ALL 4 SPLIT SCENES]\r\n\r\n\r\n\r\n\r\nCAST\r\nCandy Sweet\r\nLauren (II)\r\nAlexa Tomas\r\nAnina Silk\r\nAngelina Brill\r\nDiana Dolce\r\nKitty Lovedream\r\n\r\nDESCRIPTION\r\n&quot;REM&quot; - written by a VivThomas.com member - explores the unsettling and arousing nature of erotic dreams, straddling a blurred line between subconscious desires and reality. In episode one, Lauren dreams she is walking into a classroom, and in her trance-state encounters Alexa Tomas at the blackboard. Alexa lies back on the desk, parting her thighs so Lauren can lick and finger her, then goes face down, ass up as Lauren spreads her luscious pussy and eats her from behind. When Lauren adds a finger in her ass, Alexa cums like crazy. Now Alexa kneels to lick Lauren's puffy clit and finger her pussy and ass. She stuffs Lauren's panties in her mouth as she gives her an intense orgasm. Lauren awakens, masturbating... but was it really just a dream? Episode two finds Anina Silk falling aas she sunbathes naked. In her dream, she sees herself spreadeagled and bound at the wrists and ankles, but when she enters the bedroom it's Angelina Brill she finds tied to the bed. Anina sucks her captive's stiffening nipples, then finger-bangs her, waiting until she's pulling hard against her restraints before releasing one of her hands so she can rub her own clit and work up to a climax. Angelina binds Anina's wrists with her panties and fingers her to a mind-blowing orgasm. When Anina wakes from her dream she is still in the throes of ecstasy; that's if it was really a dream? In episode three, Candy Sweet is reading when she dozes off. In her dream, she wakes on a hospital bed and finds she can't move her limbs. Lauren sits beside Candy, lifting her skirt and pulling off her panties. She straddles Candy's face, getting a thorough licking, then spins around into a pussy, making her writhe against her restraints, then fingers her ass until she orgasms. She releases Kitty and sits on her face, spreading her pussy open for Kitty to lick. Kitty binds Diana's wrists and tongues her clit teasingly, then eats her to a powerful climax. Whether these sixty-nine so an .y can finger her ass too. Both girls enjoy powerful orgasms; and as Candy wakes from her erotic dream, something makes her question whether it was a dream at all. Diana Dolce drifts off to in the bathtub, in the final episode. In her dream world she discovers Kitty Lovedream, who is bound by her wrists and ankles, her thighs splayed open. Diana eats Kitty's succulent gorgeous girls are experiencing dreams, fantasies or something more mysterious is left up to you to decide, but one thing's for sure: &quot;REM&quot; is a dream come true for lovers of sizzling lesbian erotica!","torrent":{"xt":"urn:btih:b6b99592696c0c4d011b3e5066934b04dae693ee","amp;dn":"+REM+%28NEW+2016+VIVTHOMAS+-+METART%29+%5BDVD+RIP+ALL+4+SPLIT+SCENES%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6b99592696c0c4d011b3e5066934b04dae693ee","infoHashBuffer":{"type":"Buffer","data":[182,185,149,146,105,108,12,77,1,27,62,80,102,147,75,4,218,230,147,238]},"announce":[],"urlList":[]}}