{"title":"Xev Bellringer: Staying After Class [1080p]","uid":13504324,"size":1425624875,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b70ecfc662c8f39d63ee706aae7948c15a47f5ef&amp;dn=+Xev+Bellringer%3A+Staying+After+Class+%5B1080p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"xxxsunset","files":1,"time":1455232980,"description":"Screenshots: \nhttp://imgur.su/image/p6MF\r\n\r\nClass is dismissed for the day - don't forget to prepare for your presentations next week. Not you, you stay right there in your seat until everyone leaves. We are going to have a little talk. What was that stunt you just pulled? Nothing you say? Well what I saw was not nothing. While the whole class was reading silently, you were busy staring at my cleavage. You see, I can't have any of my students getting distracted... no matter how tempted you are. So how do you propose we solve this issue? You don't think you're distracted in my class? Oh well in that case, you should be able to pass this little test I have to measure your level of focus. All you have to do is complete this written form, the questions are not the slightest bit challenging. Go on, fill in the blanks. If you aren't easily distracted by my presence, you shouldn't have any trouble answering the prompts... with my bosom inches from your face. Ohh, you've barely finished the first question. I wonder how hard this would be for you if I just... sat on your lap. Oh dear, your hands are shaking and... oh! What on earth is that in your pants? Go on, continue with the form... shhh, you naughty boy. You asked for this. If you take away anything from this class, it should be that you don't go half way with a woman... that's it... put it in. Ohhh!! Mmm we don't have much time before the next class shows up... we better hope they don't catch us","torrent":{"xt":"urn:btih:b70ecfc662c8f39d63ee706aae7948c15a47f5ef","amp;dn":"+Xev+Bellringer%3A+Staying+After+Class+%5B1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b70ecfc662c8f39d63ee706aae7948c15a47f5ef","infoHashBuffer":{"type":"Buffer","data":[183,14,207,198,98,200,243,157,99,238,112,106,174,121,72,193,90,71,245,239]},"announce":[],"urlList":[]}}