{"title":"Intimate Bum Bugger with Slim Fresh Asian","uid":14531565,"size":467603344,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bd628106183f63fe44e11d9fbe75aa589d66f1d6&amp;dn=Intimate+Bum+Bugger+with+Slim+Fresh+Asian+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sarah.jensen","files":1,"time":1462449120,"description":"Having realized that she could pay for her dental treatment by offering herself round a bit, Pantip now feels she can afford many more essentials and luxuries in life, as all she has to do is graciously accept donations from married foreigners that want to fuck her. And she quite obviously does not see herself as a whore, because she enjoys sex and has the natural figure for it. She has also decided that if she uses her anus instead of her vagina, there can be nothing immoral at all. This also has the advantages that the men who fuck her up the ass give her more money, and importantly, she really enjoys the feeling. She loves getting buggered up the bum, the intimacy, the light aroma, and the knowledge that her sweet perfect figure is being used for good purpose. She is quite happy to have men ejaculate in her rectum, and then treat her with a fist full of spending vouchers. Pantip will quite merrily take a guy to the shopping mall to buy small sexy panties, which she does not wear anyway, and walk around the shop together, mingling with the other customers, while his his sperm is securely locked in her bowels. However, for your special delectation, I have fucked and come in her ass, and Pantip has ejected some of my seminal fluid back through her ring piece while smiling contentedly, all on video","torrent":{"xt":"urn:btih:bd628106183f63fe44e11d9fbe75aa589d66f1d6","amp;dn":"Intimate+Bum+Bugger+with+Slim+Fresh+Asian+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd628106183f63fe44e11d9fbe75aa589d66f1d6","infoHashBuffer":{"type":"Buffer","data":[189,98,129,6,24,63,99,254,68,225,29,159,190,117,170,88,157,102,241,214]},"announce":[],"urlList":[]}}