{"title":"Ghosts of Memories v1.0.5","uid":13573866,"size":101729379,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:bdb9266fb51c0937496765a59c7b3ced3b334f45&amp;dn=Ghosts+of+Memories+v1.0.5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiropitaki","files":1,"time":1455691022,"description":"This is an adventure puzzle game located in 4 stunningly beautiful worlds.\r\n\r\nIn Ghosts of Memories you will explore the lands of ancient civilizations, full of undiscovered paths and mysterious puzzles based on tricky tiles. Think logically to solve all the quests and puzzles on your journey!\r\n\r\n======\r\n\r\nENJOY: \r\n- Beautiful graphics - 2.5-D isometric perspective that combines the details of 2-D artwork with many functionalities of a 3-D environment. \r\n\r\n- Unique sound effects - the background music was composed specifically for Ghosts of Memories, and creates an atmosphere as you find your way to your destination by overcoming a series of puzzles. Use headphones to get the best experience. \r\n\r\n- Gameplay experience - Carefully designed gameplay will provide you with engaging and demanding experiences, full of unexpected solutions.\r\n\r\n&quot;The game looks bewitching, and every single aspect of its visual representation is a masterpiece.\r\nGhosts of Memories is definitely a must-have this season.&quot; - Pocketmeta\r\n\r\n&quot;if you like these types of games, and coming up with unique solutions to puzzles, then this should be a treat for you - Android Community\r\n\r\n&quot;The game essentially uses adventure-puzzle structure to advance, but the real hook is the story.&quot; - Android Police\r\n\r\n======\r\n\r\n*Ghosts of Memories requires a device with at least 768 MB of RAM\r\n**Ghosts of Memories is designed for phones and tablets that run Android 4.1 (Jelly Bean) and above.\r\n***Ghosts of memories does NOT support Android small screens\r\n\r\nWhat’s new:\r\nIf you have lost progress after an update please contact us at:\r\n  \r\nThere is a solution to your issue!\r\nThe issue may reappear after updating to the latest version of the game, however this build should ensure no lost progress issues on update for the future releases. Sorry for the inconvenience!\r\n*****\r\nThis version also introduces several UI improvements.\r\n\r\nRequires Android: 4.1 and up","torrent":{"xt":"urn:btih:bdb9266fb51c0937496765a59c7b3ced3b334f45","amp;dn":"Ghosts+of+Memories+v1.0.5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdb9266fb51c0937496765a59c7b3ced3b334f45","infoHashBuffer":{"type":"Buffer","data":[189,185,38,111,181,28,9,55,73,103,101,165,156,123,60,237,59,51,79,69]},"announce":[],"urlList":[]}}