{"title":"OKC Bombing &amp; Timothy McVeigh coasttocoast","uid":14370835,"size":28124113,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bf1fe5810fc6c9a184a272f3f20e0196ba838d0e&amp;dn=OKC+Bombing+%26amp%3B+Timothy+McVeigh+coasttocoast&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1461159446,"description":"OKC Bombing &amp; Timothy McVeigh\r\nCoast to Coast April 19, 2016\r\n2 mp3\r\n\r\nIn the first half, freelance investigative researcher Wendy S. Painting, PhD, and writer/producer Holland Van den Nieuwenhof discussed their extensive research into the 1995 Oklahoma City bombing and Timothy McVeigh, revealing startling new biographical details about McVeigh, and the stark contradictions and errors contained in previous depictions of the 'All-American Terrorist.' Van den Niewenhof stated there is much evidence to indicate the government was lying about the case, while Painting pointed out that numerous eyewitnesses said they saw McVeigh with a 'John Doe' accomplice on the day of the bombing, and yet surveillance tapes were missing in the court case. In public, McVeigh was changing his story to fit with the prosecutors, but in private, he was telling a different account that mixed five different narratives, which she outlined:\r\n\r\nMcVeigh was the mastermind, and acted as a lone wolf, and drove alone to the Murrah building on April 19, 1995.\r\nMcVeigh had help from 3-8 people, but took the fall.\r\nMcVeigh and a group of people were being monitored by informants and intelligence agents who had some idea/warning that the event was going to happen.\r\nMcVeigh himself was an undercover operative.\r\nMcVeigh was a Manchurian Candidate, under some type of mind control.\r\nOne account suggested that a chemist was connected to the bombing, and there were claims that McVeigh had been implanted with a microchip. Around 2010, this chemist showed up on the UFO lecture circuit talking about alien implants, Painting reported. Van den Niewenhof said he was following up on leads that the OKC bombing was originally supposed to be tied to Middle Eastern terrorism and a Neo-Nazi connection.\r\n\r\nDate:\tTuesday - April 19, 2016\r\nHost:\tGeorge Noory\r\nGuests:\tWendy Painting, Holland Van den Nieuwenhof, Varla Ventura\r\n \nhttp://www.coasttocoastam.com/show/2016/04/19","torrent":{"xt":"urn:btih:bf1fe5810fc6c9a184a272f3f20e0196ba838d0e","amp;dn":"OKC+Bombing+%26amp%3B+Timothy+McVeigh+coasttocoast","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf1fe5810fc6c9a184a272f3f20e0196ba838d0e","infoHashBuffer":{"type":"Buffer","data":[191,31,229,129,15,198,201,161,132,162,114,243,242,14,1,150,186,131,141,14]},"announce":[],"urlList":[]}}