{"title":"Environmental Degradation of Advanced and Traditional Engineerin","uid":14542194,"size":13669177,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c011c2fb4d9602d6f5ee0d05aa5e913672361322&amp;dn=Environmental+Degradation+of+Advanced+and+Traditional+Engineerin&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1462539396,"description":"Environmental Degradation of Advanced and Traditional Engineering Materials - Lloyd H. Hihara et al. (CRC, 2014).pdf\r\n\r\nISBN 978-1-4398-1927-2\r\n\r\nOne of the main, ongoing challenges for any engineering enterprise is that systems are built of materials subject to environmental degradation. Whether working with an airframe, integrated circuit, bridge, prosthetic device, or implantable drug-delivery system, understanding the chemical stability of materials remains a key element in determining their useful life.\r\n\r\nEnvironmental Degradation of Advanced and Traditional Engineering Materials is a monumental work for the field, providing comprehensive coverage of the environmental impacts on the full breadth of materials used for engineering infrastructure, buildings, machines, and components. The book discusses fundamental degradation processes and presents examples of degradation under various environmental conditions. Each chapter presents the basic properties of the class of material, followed by detailed characteristics of degradation, guidelines on how to protect against corrosion, and a description of testing procedures.\r\n\r\nA complete, self-contained industrial reference guide, this valuable resource is designed for students and professionals interested in the development of deterioration-resistant technological systems constructed with metallurgical, polymeric, ceramic, and natural materials","torrent":{"xt":"urn:btih:c011c2fb4d9602d6f5ee0d05aa5e913672361322","amp;dn":"Environmental+Degradation+of+Advanced+and+Traditional+Engineerin","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c011c2fb4d9602d6f5ee0d05aa5e913672361322","infoHashBuffer":{"type":"Buffer","data":[192,17,194,251,77,150,2,214,245,238,13,5,170,94,145,54,114,54,19,34]},"announce":[],"urlList":[]}}