{"title":"Dense Phase Carbon Dioxide - Food and Pharmaceutical Application","uid":14577541,"size":6005890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0662610a126307ab203278966dbef3cb443839f&amp;dn=Dense+Phase+Carbon+Dioxide+-+Food+and+Pharmaceutical+Application&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1462843715,"description":"Dense Phase Carbon Dioxide - Food and Pharmaceutical Applications - M. O. Balaban, G. Ferrentino (Blackwell, 2012).pdf\r\n\r\nISBN 978-0-8138-0649-5\r\n\r\nDense phase carbon dioxide (DPCD) is a non-thermal method for food and pharmaceutical processing that can ensure safe products with minimal nutrient loss and better preserved quality attributes. Its application is quite different than, for example, supercritical extraction with CO 2 where the typical solubility of materials in CO 2 is in the order of 1% and therefore requires large volumes of CO 2. In contrast, processing with DPCD requires much less CO 2 (between 5 to 8% CO 2 by weight) and the pressures used are at least one order of magnitude less than those typically used in ultra high pressure (UHP) processing. There is no noticeable temperature increase due to pressurization, and typical process temperatures are around 40°C.\r\n\r\nDPCD temporarily reduces the pH of liquid foods and because oxygen is removed from the environment, and because the temperature is not high during the short process time (typically about five minutes in continuous systems), nutrients, antioxidant activity, and vitamins are much better preserved than with thermal treatments. In pharmaceutical applications, DPCD facilitates the production of micronized powders of controlled particle size and distribution. Although the capital and operating costs are higher than that of thermal treatments, they are much lower than other non-thermal technology operations.\r\n\r\nThis book is the first to bring together the significant amount of research into DPCD and highlight its effectiveness against microorganisms and enzymes as well as its potential in particle engineering. It is directed at food and pharmaceutical industry scientists and technologists working with DPCD and other traditional or non-thermal technologies that can potentially be used in conjunction with DPCD. It will also be of interest to packaging specialists and regulatory agencies","torrent":{"xt":"urn:btih:c0662610a126307ab203278966dbef3cb443839f","amp;dn":"Dense+Phase+Carbon+Dioxide+-+Food+and+Pharmaceutical+Application","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0662610a126307ab203278966dbef3cb443839f","infoHashBuffer":{"type":"Buffer","data":[192,102,38,16,161,38,48,122,178,3,39,137,102,219,239,60,180,67,131,159]},"announce":[],"urlList":[]}}