{"title":"Shin Getter Robot Vs Neo Getter Robot OVA 01-04 7th STARS TEAM","uid":14190976,"size":5094609240,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c274c381c35f5caba1a8bc9b7360c9ab4965b538&amp;dn=+Shin+Getter+Robot+Vs+Neo+Getter+Robot+OVA+01-04+7th+STARS+TEAM&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"foll01","files":4,"time":1459891719,"description":"Shin Getter Robot Vs Neo Getter Robot OVA 01-04, [BD 1080p - H264 - Ita Jap Ac3 - SoftSub Ita] -completa-the seven stars' team\r\n\r\nTRAMA\r\n\r\nL'Impero del Dinosauri, guidato da Gool, fa ritorno sulla superficie terrestre per annientare la razza umana e rivendicare il possesso della Terra: infatti, in un'epoca remota, a causa di misteriose radiazioni provenienti dallo spazio, i raggi Getter, il popolo degli uomini-rettile fu costretto a rifugiarsi nelle profondità del nostro pianeta per evitare l'estinzione. La squadra Getter, coordinata dal professor Saotome, rimane l'unica speranza per l'umanità.\r\nMentre il professore tenta di attivare un nuovo tipo di Getter Robot con a bordo Ryoma e Hayato, il Getter-1 pilotato da Musashi combatte da solo una battaglia suicida contro le orde di Mechasaurus inviate dagli uomini-rettile. Musashi, messo alle strette, ricorre all'unica arma per evitare che la guerra venga vinta dagli Invasori: l'autodistruzione. Il sacrificio di Musashi, però, allontana solo temporaneamente il problema: dopo alcuni anni l'Impero dei Dinosauri riesce a ricostituirsi e attaccare nuovamente le città per riprendere il piano di conquista originario. Riuscirà Hayato, divenuto nel frattempo responsabile della nuova generazione di piloti e di un nuovo Getter Robot, a far fronte all'esercito dell' Impero del Dinosauri? Una battaglia è stata vinta, ma la guerra che deciderà le sorti di uomini e dinosauri comincia ora... \r\n\r\nRELEASE ORIGINAL FOR MORE INFO\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=493819","torrent":{"xt":"urn:btih:c274c381c35f5caba1a8bc9b7360c9ab4965b538","amp;dn":"+Shin+Getter+Robot+Vs+Neo+Getter+Robot+OVA+01-04+7th+STARS+TEAM","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c274c381c35f5caba1a8bc9b7360c9ab4965b538","infoHashBuffer":{"type":"Buffer","data":[194,116,195,129,195,95,92,171,161,168,188,155,115,96,201,171,73,101,181,56]},"announce":[],"urlList":[]}}