{"title":"A Metaphysics for Freedom Helen Steward 0198706464 (SHAILAB)","uid":14236538,"size":1694015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3239b96e5c9073fafe243d6faa0ecb7745ee36b&amp;dn=A+Metaphysics+for+Freedom+Helen+Steward+0198706464+%28SHAILAB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shailab","files":3,"time":1460093574,"description":"amazon/A-Metaphysics-Freedom-Helen-Steward/dp/0198706464\r\n\r\n\r\nA Metaphysics for Freedom\r\n\r\nby Helen Steward  (Author)\r\n\r\n\r\nProduct Details:\r\n\r\nPaperback: 280 pages\r\nPublisher: Oxford University Press; Reprint edition (July 29, 2014)\r\nLanguage: English\r\nISBN-10: 0198706464\r\nISBN-13: 978-0198706465\r\n\r\nA Metaphysics for Freedom argues that agency itself-and not merely the special, distinctively human variety of it-is incompatible with determinism. For determinism is threatened just as surely by the existence of powers which can be unproblematically accorded to many sorts of animals, as by the distinctively human powers on which the free will debate has tended to focus. Helen Steward suggests that a tendency to approach the question of free will solely through the issue of moral responsibility has obscured the fact that there is a quite different route to incompatibilism, based on the idea that animal agents above a certain level of complexity possess a range of distinctive 'two-way' powers, not found in simpler substances. Determinism is not a doctrine of physics, but of metaphysics; and the idea that it is physics which will tell us whether our world is deterministic or not presupposes what must not be taken for granted-that is, that physics settles everything else, and that we are already in a position to say that there could be no irreducibly top-down forms of causal influence. Steward considers questions concerning supervenience, laws, and levels of explanation, and explores an outline of a variety of top-down causation which might sustain the idea that an animal itself, rather than merely events and states going on in its parts, might be able to bring something about. The resulting position permits certain important concessions to compatibilism to be made; and a convincing response is also offered to the charge that even if it is agreed that determinism is incompatible with agency, indeterminism can be of no possible help. The whole is an argument for a distinctive and resolutely non-dualistic, naturalistically respectable version of libertarianism, rooted in a conception of what biological forms of organisation might make possible in the way of freedom.\r\n\r\nBTC - 1CZ4nTozpgfgqufWhiXDtBu9pVurd41SPz\r\n\r\nenjoy...\r\n\r\nYOURs INsincerely...\r\n\r\n---------------------------------------------------------------------------------------\r\n\r\n.:.Shailab.:.\r\n \nhttps://thepiratebay.se/user/shailab/\r\n \nhttps://kat.cr/user/shailab/","torrent":{"xt":"urn:btih:c3239b96e5c9073fafe243d6faa0ecb7745ee36b","amp;dn":"A+Metaphysics+for+Freedom+Helen+Steward+0198706464+%28SHAILAB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3239b96e5c9073fafe243d6faa0ecb7745ee36b","infoHashBuffer":{"type":"Buffer","data":[195,35,155,150,229,201,7,63,175,226,67,214,250,160,236,183,116,94,227,107]},"announce":[],"urlList":[]}}