{"title":"COAST TO COAST 3 31 Fukushima  Nuclear Issues","uid":14129127,"size":56543193,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c59af8b8a834d8259d07bf37a3a5a018f8098600&amp;dn=COAST+TO+COAST+3+31+Fukushima++Nuclear+Issues&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":4,"time":1459533344,"description":"Fukushima and Nuclear Issues\r\n\r\nAs we pass the fifth anniversary of the meltdown of three nuclear reactors in Fukushima, Earthfiles investigative reporter Linda Moulton Howe discussed the ongoing issues of that disaster, and whether something similar could happen in the US. She also examined another potential threat from nuclear reactor-powered satellites orbiting the Earth, and a new NASA space propulsion proposal that would bypass nuclear problems altogether. In the first two segments, she interviewed Arnie Gunderson, nuclear engineer, and founder of Fairewinds Nuclear Energy Education, who has referred to Fukushima as &quot;Chernobyl on steroids.&quot;\r\n\r\nGunderson recently traveled to Fukushima to conduct tests, and found alarming levels of radioactive contamination. TEPCO, the company that owns the nuclear plant, has done an inadequate job of clean-up, he declared. Though they've picked up some 30 million 1-ton bags of radioactive material, Gunderson discovered that areas they previously cleaned had become recontaminated, due to the movement of wind, rain, and dust. All atomic nuclear power reactors must be near large bodies of water to keep fuel rods and cores cooled down. But during earthquakes, tsunamis and hurricanes, their basement generators can become flooded with water, turn off and stop cooling. That's why three of the TEPCO reactor cores melted down in March 2011. Nuclear engineers have said, &quot;Fukushima can easily happen here in the United States,&quot; Linda warned. Further info.\r\n\r\nIn the 1960s to 1970s, the Soviet Union and United States launched many spy satellites powered by Uranium-235. More than 30 different nuclear reactor-powered satellites still orbit the Earth and there is concern over a collision in space that would cause radioactive junk to fall to Earth and contaminate a large area. Prof. Karl Grossman proposes that we go up there with a kind of &quot;garbage truck shuttle,&quot; locate some of these still orbiting nuclear space systems and take them down safely and eliminate them. More here.\r\n\r\nIn her last report, Linda spoke with UC Santa Barbara physicist Phillip Lubin about potential new space propulsion systems that would dramatically speed up travel time by using an array of lasers to beam an intense concentration of photons at a kind of tiny &quot;wafer-sized&quot; craft. These light-powered drones would not carry humans but could communicate back to us, and would be the first human interstellar technology traveling fast enough to get to Earth's nearest neighbor sun, Alpha Centauri, in a decade or so, Lubin marveled.\r\n\r\nMorcellator Update\r\nFirst hour guests Dr. Hooman Noorchashm and Dr. Amy Reed shared an update on their anti-morcellation campaign (related petition1/petition 2). The morcellator is a surgical tool that spreads cancer in one out of 350 cases of women having a certain type of procedure. And while Johnson and Johnson has pulled their power morcellators off the market due to such safety concerns, there are some gynecologists who still prefer to use the tool because they feel the benefits outweigh the risk, Noorchashm reported. The FDA sometimes places marketing concerns ahead of patient safety when it comes to the approval of surgical devices, he added.\r\n\r\nNews segment guests: Jerome Corsi, Mish Shedlock","torrent":{"xt":"urn:btih:c59af8b8a834d8259d07bf37a3a5a018f8098600","amp;dn":"COAST+TO+COAST+3+31+Fukushima++Nuclear+Issues","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c59af8b8a834d8259d07bf37a3a5a018f8098600","infoHashBuffer":{"type":"Buffer","data":[197,154,248,184,168,52,216,37,157,7,191,55,163,165,160,24,248,9,134,0]},"announce":[],"urlList":[]}}