{"title":"Anikka's Cuckold POV XXX (NEW) DVDRip x264","uid":14437837,"size":1877548247,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:c7d21dd2100db9e79cdc6a5eb1b03b8f6db0c285&amp;dn=+Anikka%27s+Cuckold+POV+XXX+%28NEW%29+DVDRip+x264+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LucasCar","files":3,"time":1461647067,"description":"\nCategory: Gonzo, Anal, BDWC, Lesbian, Fetish\r\n\r\nCast: Anikka Albrite, Dana DeArmond, Lea Lexis, Mick Blue, Nina Elle, Sean Michaels\r\n\r\n.:Description:.\r\nBAM Visions pornographer Anikka Albrite calls out submissive, voyeuristic fans of wicked wives. In Anikka's Cuckold POV, camera angles make you the husband watching your wayward woman serviced by superior cocks, and in each scene your wife addresses you directly with degrading verbal humiliation. Nasty MILF Lea Lexis taunts your sexual shortcomings (tiny, little worm), ordering you to beat off and watch her anal threesome with butt-blessed blonde Anikka and hung stud Mick Blue. He shows how a real man sodomizes two sluts, leaving a cum load for you to slurp. Tattooed blonde Nina Elle fucks Mick in your marital bed; they talk vicious shit as he manhandles her, and she kisses his semen into your mouth. When you catch racy MILF Dana DeArmond masturbating in lingerie shed never wear for you, she insults your pinky-dick and tells you to smell her asshole. Dana and girlfriend Anikka get bi on vibes, toys, mouths, with tease and denial for you. You help your bride (Anikka) out of her white wedding dress for stud Sean Michaels; her wedding ring shines as she sucks big black cock, and you look into her eyes as he porks her ass. She wants your face between her stunning, round cheeks to lick her butthole as her tight pussy gets plowed. Anikka deep-throats ass-to-mouth and Sean creams her face and tongue.\r\nTake a look at screenshots! Enjoy!\r\n \nhttp://naughtyimage.com/img-571eda96c3b66.html\r\n \nhttp://naughtyimage.com/img-571eda9a7361b.html\r\n\r\n\r\n\r\n* * * For more stuff please visit * * *  \nhttps://thepiratebay.se/user/LucasCar/","torrent":{"xt":"urn:btih:c7d21dd2100db9e79cdc6a5eb1b03b8f6db0c285","amp;dn":"+Anikka%27s+Cuckold+POV+XXX+%28NEW%29+DVDRip+x264+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7d21dd2100db9e79cdc6a5eb1b03b8f6db0c285","infoHashBuffer":{"type":"Buffer","data":[199,210,29,210,16,13,185,231,156,220,106,94,177,176,59,143,109,176,194,133]},"announce":[],"urlList":[]}}