{"title":"Various Artists - Zappa's Universe. A Celebration of 25 Years of","uid":14354554,"size":569151231,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c845abc26d9aeb75963967dd3739d63b2ae05d28&amp;dn=Various+Artists+-+Zappa%27s+Universe.+A+Celebration+of+25+Years+of&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pucholoco","files":25,"time":1461033994,"description":"V.A. - Zappa's Universe. A Celebration of 25 Years of Frank Zappa's Music (1993)\r\n                 EAC rip (secure mode) | FLAC+CUE+LOG -&gt; 479 Mb \r\n                      Full Artwork @ 400 dpi (png) -&gt; 96 Mb\r\n\r\n\r\nZAPPA'S UNIVERSE–a tribute to the work of the guitarist-composer, who was too ill to attend–contains the first recorded live version of &quot;Jazz Discharge Party Hats,&quot; the first recorded live instrumental version of &quot;Nite School,&quot; the first recorded dual-vocal group version of &quot;Elvis Has Just Left The Building&quot; and the first recorded a capella versions of &quot;The Meek Shall Inherit Nothing&quot; and &quot;Heavenly Bank Account.&quot; &quot;Sofa&quot; won the 1994 Grammy Award for &quot;Rock Instrumental Performance.&quot;\r\n\r\nZAPPA'S UNIVERSE contains the first recorded live version of &quot;Jazz Discharge Party Hats,&quot; the first recorded live instrumental version of &quot;Nite School,&quot; the first recorded two vocal group version of &quot;Elvis Has Just Left The Building&quot; and the first recorded a capella versions of &quot;The Meek Shall Inherit Nothin'&quot; and &quot;Heavenly Bank Account.&quot;\r\n\r\nA series of concerts was held in November 1991 at the Ritz in New York City to celebrate 25 years of the music of Frank Zappa, but the mood was dampened considerably when it was announced prior to the first concert that the honoree would not be attending because he was fighting the prostate cancer that would end his life just over two years later. \r\n\r\nOne of the highlights is the inclusion of the Persuasions, a doo wop group signed to its first recording contract by Zappa. Although guitarist Mike Keneally and bassist Scott Thunes are present from Zappa's final touring band (which broke up during the European leg of Zappa's final tour in 1988), Dweezil Zappa (Zappa's talented young son and a fine guitarist in his own right) solos on &quot;Dirty Love,&quot; and former Zappa guitarist Steve Vai makes a guest appearance on &quot;Hot Plate Heaven at the Green Hotel,&quot; Zappa's presence on stage is sorely missed. \r\n\r\nConductor and arranger Joel Thome, who conceived these tribute concerts, is to be congratulated for his efforts, though none of the songs begin to compare with Frank Zappa's own versions, which are readily available on CD. \r\n\r\nThere is also a video version of these concerts that includes music omitted from this CD.\r\n\r\n\r\n---------------------------------------------------------------------------------\r\nTracklist:\r\n---------------------------------------------------------------------------------\r\n\r\n01. Elvis Has Just Left The Building\r\n02. Brown Shoes Don't Make It\r\n03. Jazz Discharge Party Hats\r\n04. Inca Roads\r\n05. Moggio\r\n06. Nite School\r\n07. Echidna's Arf (Of You)\r\n08. Hungry Freaks, Daddy\r\n09. Heavenly Bank Account\r\n10. The Meek Shall Inherit Nothing\r\n11. Waka Jawaka (Edit)\r\n12. Sofa\r\n13. Dirty Love\r\n14. Hot Plate Heaven At The Green Hote\r\n\r\n*1993 Verve / PolyGram | 513 575-2\r\n\r\n\r\nPersonnel: \r\nRockapella, Steve Vai, Dweezil Zappa, Dale Bozzio, Mike Keneally, Mats Oberg, Marc Zigenhagen, Scott Thunes, Morgan Agren, Johnathan Haas, Joel Thome, Maureen McNally, Doug Perry, Erik Buxton, Orchestra Of Our Time, The Persuasions.\r\n\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:c845abc26d9aeb75963967dd3739d63b2ae05d28","amp;dn":"Various+Artists+-+Zappa%27s+Universe.+A+Celebration+of+25+Years+of","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c845abc26d9aeb75963967dd3739d63b2ae05d28","infoHashBuffer":{"type":"Buffer","data":[200,69,171,194,109,154,235,117,150,57,103,221,55,57,214,59,42,224,93,40]},"announce":[],"urlList":[]}}