{"title":"Sinfonias Completas Mahler","uid":13514110,"size":3725417157,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c94cb332ae2cbecb97b7cfbd43298c516eb4b0b4&amp;dn=Sinfonias+Completas+Mahler&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jl456","files":1,"time":1455315739,"description":"As Sinfonias de Mahler\r\n\r\nEm nosso último artigo sobre Gustav Mahler citamos que ele iniciou sua carreira como compositor escrevendo vários ciclos de canções, a maior parte deles utilizando poemas de Friedrich Rückert e outras obras de grandes poetas alemães e até chineses, como foi o caso de Das Lied von der Erde.\r\n\r\nFoi no campo sinfônico que Mahler atingiu seu apogeu como compositor, fato que nos leva a comentar obra sinfônica.\r\n\r\nEsta se encontra dividida em três períodos. As sinfonias do primeiro período (2ª, 3ª e 4ª) são conhecidas como Sinfonias Wunderhorn. A maior parte delas está impregnada pela música que Mahler utilizou em Das Knaben Wunderhorn, ciclo de 24 canções com temática nos poemas compilados por Achim von Arnim e Clemens Brentano.\r\n\r\nAs sinfonias do segundo período (5ª, 6º e 7ª) costumam ser chamadas Sinfonias Rückert. Elas recebem este nome porque a composição das mesmas foi influenciada pelas composições usadas por Mahler para musicar os poemas de Friedrich Rückert. Elas são puramente instrumentais e as mais trágicas do ciclo de sinfonias de Mahler.\r\n\r\nO último período não tem nome e abrange as últimas obras do compositor: sinfonias nº 8, 9 e a inacabada 10ª Sinfonia.\r\n\r\nQuanto à 1ª Sinfonia ela usa elementos do Lied Eines Fahrendes Gesellen (Canções de um Viajante Errante) e Das Klagende Lied (A canção da Lamentação). A obra é puramente instrumental.\r\n\r\n \r\n\r\nSinfonia nº 1 em Ré Maior – Titan (1883-88)\r\n\r\nO título foi inspirado na novela escrita por Jean Paul Richter, em 1803. Sua estréia mundial foi no dia 20/11/1889 com a Orquestra Filarmônica de Budapest sob a regência de Mahler.\r\n\r\n \r\n\r\nSinfonia nº 2 em Dó Menor – Ressurreição (1887-94)\r\n\r\nO título da obra está relacionado ao personagem da primeira sinfonia. O primeiro movimento foi denominado de Todtenfeier (Rito Fúnebre). Retrata o dia do Juízo Final. Muito longo e tematicamente complexo. O segundo movimento é uma Pastoral. O quarto movimento é uma introdução ao finale. Neste movimento é interpretada a canção Urlicht do Ciclo Des Knaben Wunderhorn.\r\n\r\nO quinto movimento nos leva a um colossal finale onde ocorre a ressurreição do herói. O hino Ressurreição é executado por um imenso coral e é de autoria de Friedrich Gottlieb Klopstock (1724-1803).\r\n\r\nNa primeira estréia, no dia 4 de março de 1895, em Berlim, foram apresentados os três primeiros movimentos. Richard Strauss foi o regente, conduzindo a Orquestra Filarmônica de Berlim. A sinfonia completa foi apresentada na mesma cidade no dia 13 de dezembro de 1895 com a regência de Mahler. Presentes os maestros Arthur Nikish, Bruno Walter e Félix Weingartner.\r\n\r\n \r\n\r\nSinfonia nº 3 em Ré Menor (1895-96)\r\n\r\nMahler costumava dizer: Esta sinfonia é meu monstro. Dura cerca de duas horas, é tão longa quanto à 9ª Sinfonia de Schubert e mais longa que a 9ª de Beethoven. Equivale em duração à 8ª sinfonia de Bruckner. Foi dedicada à soprano Anna von Mildenburg à época companheira do autor.\r\n\r\n \r\n\r\nSinfonia nº4 em Sol Maior (1899-1901)\r\n\r\nUma das mais líricas sinfonias de Mahler. Dura cerca de 50 minutos. Ao final do Adágio do 3º movimento uma solista interpreta um dos textos de Des Knaben Wunderhorn. A estréia mundial ocorreu em Munich no dia 28/11/1901, sob a regência de Mahler. O compositor deixou este relato sobre a obra: Esta sinfonia representa uma fase muito difícil de minha vida, Por isso a sinfonia é difícil de ser aceita. No futuro pouquíssimas pessoas a compreenderão.\r\n\r\n \r\n\r\nSinfonia nº 5 em Dó Menor (1901-2)\r\n\r\nA estréia mundial foi em Colônia, no dia 18 de outubro de1904, sob a regência de Mahler. O primeiro movimento, assim como na segunda sinfonia representa um funeral. O ponto alto desta obra é o Adagietto para harpa e cordas, mundialmente consagrado como trilha sonora do filme Morte em Veneza de Luchino Visconti. Strauss comentou para Mahler: Sua 5º sinfonia me encheu de prazer, apenas atenuado pelo Adagietto, mas sei que ele foi o que mais agradou ao público. Enquanto Mahler compunha a 5ª Sinfonia Debussy proclamava que a forma sinfônica não tinha mais valor. Ela havia morrido junto com Beethoven.\r\n\r\n \r\n\r\nSinfonia nº 6 em Lá Menor –  Trágica (1903-5)\r\n\r\nEstreou em Essen no dia 27/5/1906. Mahler escreveu: minha sexta sinfonia só será entendida pela geração que houver digerido minhas primeiras cinco sinfonias.\r\n\r\n \r\n\r\nSinfonia nº 7 em Mi Menor (1904-6)\r\n\r\nEstreou em Praga em 19 de setembro de1908 e teve uma boa acolhida. Uma das mais longas sinfonias de Mahler hoje é uma das menos interpretadas. Para Schönberg esta sinfonia representa o colapso do Romantismo.\r\n\r\n \r\n\r\nSinfonia nº 8 em Mi Maior (1906-7) Sinfonia dos Mil\r\n\r\nEsta obra conta com a presença de três sopranos, dois contraltos, tenor, barítono e baixo. Dois corais juvenis e dois corais de adultos e uma orquestra de dimensões wagnerianas fizeram com que a sinfonia fosse reconhecida como a Sinfonia dos Mil. Ela está dividida em duas seções. A primeira apresenta o hino Veni, creator spiritus e a segunda apresenta o final do Fausto de Goethe. Esta sinfonia foi dedicada à Alma Mahler e estreou em Munich no dia 12 de setembro de 1910. Obteve um grande triunfo junto ao público e foi reapresentada no dia seguinte.\r\n\r\n \r\n\r\nSinfonia nº 9 em Ré Menor (1909-10)\r\n\r\nJá muito doente Mahler temia ter a mesma sina de Beethoven, Schubert e Bruckner que morreram após a composição de sua última sinfonia. Parte dela foi composta em Nova Iorque e ele conseguiu completa-la em 1º de abril de1910, treze meses antes de sua morte. Schönberg e Alban Berg a consideram um de seus melhores trabalhos. Em seu Adagio Molto o compositor despede-se da vida. Assim como aconteceu com Das Lied von der Erde Mahler nunca escutou sua sinfonia. Coube a Bruno Walter conduzi-la pela primeira vez em Viena, em junho de 1912.\r\n\r\nNo verão de 1910 Mahler deu início ao rascunho de sua 10ª Sinfonia. Ele apenas completou o 1º movimento, um Adagio que costuma ser executado como uma peça individual. Deryck Cooke, com a permissão de Alma Mahler recriou dos esboços deixados pelo autor os quatro movimentos adicionais, mas esta versão raramente consta dos repertórios atuais. Poucos maestros tiveram a ousadia de gravar esta versão completa da 10ª sinfonia de Mahler.\r\n\r\nPara os ouvintes que desejam iniciar-se nas sinfonias de Mahler, recomendamos iniciar pela 2ª Sinfonia e posteriormente pela 5ª","torrent":{"xt":"urn:btih:c94cb332ae2cbecb97b7cfbd43298c516eb4b0b4","amp;dn":"Sinfonias+Completas+Mahler","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c94cb332ae2cbecb97b7cfbd43298c516eb4b0b4","infoHashBuffer":{"type":"Buffer","data":[201,76,179,50,174,44,190,203,151,183,207,189,67,41,140,81,110,180,176,180]},"announce":[],"urlList":[]}}