{"title":"Fluid Flow, Heat and Mass Transfer at Bodies of Different Shapes","uid":14519925,"size":4898389,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf3eeaf1f72406b25a7f551f34d62fc4be7cf6d4&amp;dn=Fluid+Flow%2C+Heat+and+Mass+Transfer+at+Bodies+of+Different+Shapes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1462373067,"description":"Fluid Flow, Heat and Mass Transfer at Bodies of Different Shapes - Numerical Solutions (AP, 2016).pdf\r\n\r\nISBN: 978-0-12-803733-1\r\n\r\nMost of the equations governing the problems related to science and engineering are nonlinear in nature. As a result, they are inherently difficult to solve. Analytical solutions are available only for some special cases. For other cases, one has no easy means but to solve the problem must depend on numerical solutions.\r\n\r\n&quot;Fluid Flow, Heat and Mass Transfer at Bodies of Different Shapes: Numerical Solutions&quot; presents the current theoretical developments of boundary layer theory, a branch of transport phenomena. Also, the book addresses the theoretical developments in the area and presents a number of physical problems that have been solved by analytical or numerical method. It is focused particularly on fluid flow problems governed by nonlinear differential equations. The book is intended for researchers in applied mathematics, physics, mechanics and engineering.\r\nAddresses basic concepts to understand the theoretical framework for the methodProvides examples of nonlinear problems that have been solved through the use of numerical methodFocuses on fluid flow problems governed by nonlinear equations","torrent":{"xt":"urn:btih:cf3eeaf1f72406b25a7f551f34d62fc4be7cf6d4","amp;dn":"Fluid+Flow%2C+Heat+and+Mass+Transfer+at+Bodies+of+Different+Shapes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf3eeaf1f72406b25a7f551f34d62fc4be7cf6d4","infoHashBuffer":{"type":"Buffer","data":[207,62,234,241,247,36,6,178,90,127,85,31,52,214,47,196,190,124,246,212]},"announce":[],"urlList":[]}}