{"title":"Custom Rifles - Mastery of Wood and Metal (2012).epub Gooner","uid":13578696,"size":16978239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2eb63e7421a183708e8615e27c7ebb42f8c5f43&amp;dn=Custom+Rifles+-+Mastery+of+Wood+and+Metal+%282012%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1455735724,"description":"Custom Rifles - Mastery of Wood &amp; Metal - David Miller Co. (2012).epub Gooner\r\n\r\nPublisher: Gun Digest Books (June 20, 2012)\r\nLanguage: English\r\nISBN-10: 1440232105\r\nISBN-13: 978-1440232107\r\n\r\nBehind the Scenes at David Miller Co. This is the book the shooting sports industry has been waiting for since the first maker put his own custom touches to rifles. Featuring hundreds of full-color images, illustrating the process and highlighting finished works of art, Custom Rifles: Mastery of Wood &amp; Metal is more than an entertaining and informative book about custom rifles and how they are made. It also serves as a map to help gun lovers and makers navigate the nuances of turning wood and metal into the functional art of a fine custom rifle. This edition will answer many questions and provide insight into the world of precision and custom gun craft: What about rifle stocks? Where does the barrel fit into the picture? How does function dictate form in gunmaking? Although the book acknowledges a number of custom rifle makers, it addresses the many facets of the art by focusing on the works and procedures of David Miller Co. of Tucson, Arizona. This shop has been instrumental in numerous advances in custom rifle work during recent decades. Custom Rifles: Mastery of Wood &amp; Metal is a tribute to all that is superlative in the making of custom bolt-action rifles. No other book in the world covers David Miller Co. or custom guns in the same way. Truly, this book provides a unique insight into one of the premier custom rifle building operations of all time","torrent":{"xt":"urn:btih:d2eb63e7421a183708e8615e27c7ebb42f8c5f43","amp;dn":"Custom+Rifles+-+Mastery+of+Wood+and+Metal+%282012%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2eb63e7421a183708e8615e27c7ebb42f8c5f43","infoHashBuffer":{"type":"Buffer","data":[210,235,99,231,66,26,24,55,8,232,97,94,39,199,235,180,47,140,95,67]},"announce":[],"urlList":[]}}