{"title":"The Training Of O Madison Young Day 1-4 4680 4679 4681 4682","uid":14175927,"size":15216728241,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d57e3d686f90a488c7bc5cf2d76eb0c89875b6c5&amp;dn=The+Training+Of+O+Madison+Young+Day+1-4+4680+4679+4681+4682&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"merzedes","files":16,"time":1459805471,"description":"\nRequested by @ishibooyahhh\r\n\r\nEnjoy :D\r\n\r\nShallow2\r\n\r\n\r\n\r\nThe Training Of O - Madison Young - Day 1-4 Complete\r\n\r\n\r\nHi and HD WMW, Hi and HD MP4.\r\n\r\n\r\nThe Training of Madison Young, Day One\r\n\r\nSep 6, 2007 - Performers: Madison Young \r\n\r\n \r\nApplicant Profile \r\n\r\nAge:26\r\nSign:Virgo\r\nDisposition: Masochist \r\n\r\nFears / Current Limits: Abandonment, being ignored. \r\n\r\nStrengths: Able to channel / erotisize pain very well. Very flexible and well versed in bondage. Sexually adventurous and easily excited. Orgasms through penetration. \r\n\r\nWeaknesses: Applicant is unfamiliar with service and considers herself 'selfish with her kink'. She does not understand how to erotisize the satisfaction that comes from a 'job well done'. \r\n\r\nExperience: Many years experience in commercial BDSM as well as in her personal life. Very strong, committed player and activist in alternative sexualities. \r\n\r\nCurrent Status: Currently petitioning for a D/s contract with James. \r\n\r\nInitial Observations: Applicant wishes to be trained as a service oriented submissive. \r\n\r\nApplicant is a greedy little cunt and cannot get enough cock to satisfy herself. Her insatiable appetite is the largest inhibitor to her D/s experience because she is currently so involved in her own pleasure that she cannot see the significance of service.  She is a bondage and pain slut, a good thing, but again she derives her pleasure from receiving the sensations. Once things cross into a territory that she does not find personally exciting she begins to close down. Again, to experience the joys of service she must remain open to the dominant's drive. \r\n\r\nRecommendations: Take away her right to masturbate and punish her immediately for infractions. She has already broken this rule. While punishing her greedy cunt, teach her the difference between correction and punishment. \r\n\r\nApplicant can be evasive when questioned. Teach her the value of answering a direct question quickly and succinctly by ordering her into very stressful positions for extended periods of time. \r\n\r\nDemonstrate her blow job skills and refine her technique. She is very sloppy and needs to learn to give a tidy blow job when required. Order her onto all fours and teach her to pleasure a cock with her pussy. \r\n\r\nTeach her the value of remaining clean and available for use at all times by shackling and scrubbing the shit out of her in a cold shower room. Deliver her to her quarters to complete her homework and video journal, where she will be kept under curfew for her entire week of training.  \r\n\r\nScreens\r\n \nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=4680 \nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=4679 \nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=4681 \nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=4682\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:d57e3d686f90a488c7bc5cf2d76eb0c89875b6c5","amp;dn":"The+Training+Of+O+Madison+Young+Day+1-4+4680+4679+4681+4682","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d57e3d686f90a488c7bc5cf2d76eb0c89875b6c5","infoHashBuffer":{"type":"Buffer","data":[213,126,61,104,111,144,164,136,199,188,92,242,215,110,176,200,152,117,182,197]},"announce":[],"urlList":[]}}