{"title":"Terahertz Biomedical Science and Technology","uid":14544109,"size":25001936,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d63512b912269ec553437020df0f8b60f2207eee&amp;dn=Terahertz+Biomedical+Science+and+Technology&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"clouderone","files":1,"time":1462556496,"description":"Terahertz Biomedical Science and Technology - Joo-Hiuk Son (CRC, 2014).pdf\r\n\r\nISBN 978-1-4665-7045-0\r\n\r\nA number of applications including scientific spectroscopy, security screening, and medical imaging have benefitted from the development and utilization of new and emerging terahertz (THz) generation and detection techniques. Exploring recent discoveries and the advancements of biological behaviors through THz spectroscopy and imaging and the development of THz medical techniques, Terahertz Biomedical Science and Technology contains contributions from scientists and researchers in the terahertz biomedical field and is exclusively dedicated to new and emerging terahertz biomedical research and applications.\r\n\r\nThis text offers an assessment of terahertz technology, and provides a compilation of fundamental biological studies conducted using terahertz waves. It introduces THz electromagnetic waves as a new tool for convergent studies, includes laser-based generation techniques and solid-state devices, contains a number of detectors, and discusses high-field generation methods. The material covers recent advancements in terahertz imaging for medical applications—most specifically in cancer diagnosis—reviewing the current status of the THz imaging technique for diagnosing cancers, and exploring the potential medical applications of THz radiation. It also considers the development of future medical applications using terahertz technology.\r\n\r\nSummarizes the recent progress made in THz waveguides, which are absolutely essential in the development of THz endoscopes\r\nDescribes the dynamic imaging of drug absorption in skin, exploiting the sensitivity of THz waves to pharmaceutical materials\r\nExplores the principle and applications of THz molecular imaging techniques using nanoparticle probes\r\n\r\nScientists and engineers involved in biological research and medical applications using optical techniques, as well as graduate students and instructors in optics, physics, electrical engineering, biology, chemistry, and medicine can benefit from this text which highlights new and emerging biomedical studies utilizing novel THz wave techniques","torrent":{"xt":"urn:btih:d63512b912269ec553437020df0f8b60f2207eee","amp;dn":"Terahertz+Biomedical+Science+and+Technology","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d63512b912269ec553437020df0f8b60f2207eee","infoHashBuffer":{"type":"Buffer","data":[214,53,18,185,18,38,158,197,83,67,112,32,223,15,139,96,242,32,126,238]},"announce":[],"urlList":[]}}