{"title":"The I Don't Cares - Wild Stab [2016][FLAC]","uid":13569254,"size":415574342,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d68b6d0d2bd8170bc98963d3ade366ffaebce1fc&amp;dn=The+I+Don%27t+Cares+-+Wild+Stab+%5B2016%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SmashAndGrab","files":17,"time":1455664368,"description":"The I Don't Cares - Wild Stab [2016][FLAC]\r\n\r\nReleased ................ 2016\r\nSource .................. WEB\r\nGenre ................... Alternative, Indie, Rock\r\nCodec ................... FLAC\r\nBit Depth ............... 16 bits\r\nSampling Rate ........... 44.1 KHz\r\nLog ..................... No\r\nCue ..................... No\r\n\r\n\r\n01 - Back\r\n02 - Wear Me Out Loud\r\n03 - Born For Me\r\n04 - 1/2 2P\r\n05 - Sorry For Tomorrow Night\r\n06 - Dance To The Fight\r\n07 - Kissing Break\r\n08 - Just A Phase\r\n09 - Outta My System\r\n10 - Need The Guys\r\n11 - Love Out Loud\r\n12 - King of America\r\n13 - Little People\r\n14 - Whole Lotta Nothin'\r\n15 - Done Done Done\r\n16 - Hands Together\r\n\r\nLike so many things Paul Westerberg touches, the Replacements reunion of the mid-2010s didn't end in explosion or tears: it merely faded away, coming to a conclusion somewhere in Europe sometime in the summer of 2015. The rumored album never materialized but Westerberg resurfaced swiftly, popping up at the start of 2016 with Wild Stab, an album he recorded with Juliana Hatfield under the name the I Don't Cares. The two Gen-X heroes harmonize and trade lines throughout but the scales are tipped ever so slightly in Westerberg's direction, supporting the story that Wild Stab's origins lie in demos Paul started but never finished. Then again, it's true that it never felt like Westerberg completed any of the digital EPs he knocked off in the 2000s; these were records that were intended to keep him dwelling on the margins where he feels most comfortable. Wild Stab is certainly not polished -- from its thin, tinny audio to the cheerful cacophony of shout-along vocals, it's proudly ragged -- but it feels unified, benefiting from the editing and instigation of Hatfield. Even when her voice isn't heard, her presence is felt in how Wild Stab emphasizes sharp hooks and smart songwriting, but the striking thing about the album is how it feels buoyant, an emotion that doesn't come easy to either member of the I Don't Cares. Operating as a team, Westerberg and Hatfield lighten each other's load, encouraging one another to tell corny jokes and make noise, tossing out the occasional fully formed tune along the way. Sometimes these songs take the shape of a bit of brooding but usually they're knockabout pop and old-time rock &amp; roll running at the pace of an old Rockpile record. All the mess, from its demo-quality fidelity to its throwaways, is intentional and the album is better for it: it's two old pros having a good time, so it's hard not to have a good time too","torrent":{"xt":"urn:btih:d68b6d0d2bd8170bc98963d3ade366ffaebce1fc","amp;dn":"The+I+Don%27t+Cares+-+Wild+Stab+%5B2016%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d68b6d0d2bd8170bc98963d3ade366ffaebce1fc","infoHashBuffer":{"type":"Buffer","data":[214,139,109,13,43,216,23,11,201,137,99,211,173,227,102,255,174,188,225,252]},"announce":[],"urlList":[]}}