{"title":"TNA Impact Wrestling HDTV 2016-04-05 720p H264 AVCHD-SC-SDH","uid":14201620,"size":2345188645,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:d826e12988942d5ae255dc9c4cb9109ce8c05211&amp;dn=TNA+Impact+Wrestling+HDTV+2016-04-05+720p+H264+AVCHD-SC-SDH&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SCSA420","files":4,"time":1459932223,"description":"StoneCold420 presents another High Quality 720p H264 release for the wrestling fans around the world here exclusively on KickAss Torrents and The Pirate Bay.\r\n\r\n\r\nTNA Impact Wrestling HDTV 2016-04-05 720p H264 AVCHD-SC-SDH\r\n\r\n\r\nTNA Impact Wrestling \r\nSoundstage 20\r\nUniversal Studios\r\nOrlando, Florida\r\nApril 5, 2016\r\n\r\n\r\n\r\nTNA Championship title match\r\nDrew Galloway\r\nvs\r\nMatt Hardy\r\n\r\n\r\nBeer Money announce an open challenge for the tag team belts.\r\n\r\n\r\nThe Decay with Rosemary come to the ring\r\n\r\n\r\nShane Helms and Trevor Lee come to the ring\r\n\r\n\r\nJade \r\nvs. \r\nMadison Rayne \r\nvs. \r\nGail Kim\r\n\r\n\r\nMaria makes an appearance\r\n\r\n\r\nMike Bennett comes to the ring\r\n\r\n\r\nEC3 comes to the ring\r\n\r\n\r\ninterruption here at 22:16 was due to a complete loss of cable HDTV signal here\r\n\r\n\r\nThe Pope D'angelo Deniro \r\nvs\r\nBobby Lashley\r\n\r\n\r\ninterruption here at 16:51 was due to a complete loss of cable HDTV signal here\r\n\r\n\r\nJeff Hardy\r\nvs\r\nEric Young\r\n\r\n\r\nJosh Mathews and The Pope call the action\r\n\r\n\r\n\r\nThis is SDH release #2,131 for the wrestling fans from a wrestling fan. First aired and captured from HDMI in H264 AVCHD at 8,000 kbps from the 16:9 widescreen 1280 x 720p resolution HD source on 04/05/2016 on the Pop Tv HD channel on Cox Digital HD Cable. Framerate is 29.970 with an average Video Bitrate of 4,500 kbps in a High Quality 2.18 GB 720p H264 AVCHD MP4 release with 48khz 384 kbps AAC 2 channel stereo audio. Total show runtime 1:03:42\r\n\r\nThis is my 1,401st official 720p H264 AVCHD-SC-SDH release. Enjoy the TNA show TNA Impact wrestling fans. \r\n\r\n\r\nThis release is in H264 AVCHD MP4 format with AAC 2 channel stereo audio. This release is playable with Sony Playstation 3, Xbox 360, Samsung Galaxy S III, IV, V, VI smartphones, iPhones, iPads, VLC player as well as Media Player Classic, Windows Media Player, and any other devices capable of playing 720p HD MP4 video files with AAC 2 channel stereo audio. \r\n\r\n\r\nEnjoy the TNA Impact show wrestling fans and thanks for downloading my TNA Impact Wrestling HDTV 2016-04-05 720p H264 AVCHD-SC-SDH release. \r\n\r\n\r\nUploaded by SCSA420 on KickAss Torrents and The Pirate Bay\r\n\r\n\r\nATTENTION: PLEASE FEEL FREE TO UPLOAD MY RELEASES ANYWHERE BUT DON'T ADD YOUR NAME TO MY HARD WORK and IF this show is uploaded on XWT then please keep the folder and files as they are and DO NOT RENAME the files or retag them with another name!!! Thank You!!!\r\n\r\nI work on my own so that I get all the credit for my hard work each and every week!!! \r\n\r\nBest Played With Media Player Classic or VLC Player \r\n\r\n\r\nATTENTION TNA Impact Wrestling fans this show is missing 20 minutes in first half of show due to a cable tv outage in my area but I'd rather share this which is most of the show then NOT upload it all. its better then nothing so enjoy it for what it is. Also I will NOT be uploading TNA Impact Wrestling or Total Divas Season 05 Episode 13 next week on April 12 because I will not be home to capture it. I will be in New York City at Madison Square Garden to see David Gilmour of Pink Floyd Live in Concert which will be a million times better then anything the WWE or TNA can put out so you will either have to find another version of TNA Impact wrestling or Total Divas S05E13 to download or wait until I return from NYC and I may or may not have it to upload here once I return from NYC\r\n\r\n\r\nStoneCold420 \r\nSmackDownHotel\r\nApril 5, 2016\r\n\r\n\r\n@SCSA420 on Twitter\r\n\r\n\r\nFor SC-SDH releases find me on KAT at https://kat.cr/user/SCSA420 or on ThePirateBay at https://thepiratebay.se/user/SCSA420","torrent":{"xt":"urn:btih:d826e12988942d5ae255dc9c4cb9109ce8c05211","amp;dn":"TNA+Impact+Wrestling+HDTV+2016-04-05+720p+H264+AVCHD-SC-SDH","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d826e12988942d5ae255dc9c4cb9109ce8c05211","infoHashBuffer":{"type":"Buffer","data":[216,38,225,41,136,148,45,90,226,85,220,156,76,185,16,156,232,192,82,17]},"announce":[],"urlList":[]}}