{"title":"Pamela Sargent - Child of Venus (Venus #3)","uid":13573778,"size":485573742,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d88b0f647779b558eacf047887010c77c994d806&amp;dn=Pamela+Sargent+-+Child+of+Venus+%28Venus+%233%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cybotage","files":31,"time":1455690313,"description":"The Project -- the terraforming of Venus -- was begun centuries ago. And generations more will come and go before the planet's surface has been rendered fully habitable and its human settlers, the Cytherians, can finally leave their protective domes. There are those, however, whose patience has grown dangerously thin -- malcontents unwilling to resign themselves to never enjoying the fruits of freedom promised to their descendents.\r\n\r\nDevastation and horror recently paralyzed this world in transition, as two religious cult leaders brought a plague of civil war to Venus, and were ultimately destroyed by their own treachery and despair. Out of the chaos and conflict came Mahala Lianghard -- a true child of Venus conceived from the rebels' genetic material and artfully gestated after their deaths. Some believe Mahala should never have been born; others see her as the glorious light that arose out of a dark time. Mahala herself is conflicted, as she struggles to come to terms with her painful birthright and her immutable future: a lifetime of unquestioning service to the Project.\r\n\r\nYoung Mahala fears her obligations to the expectations of others will leave her no room to pursue her own destiny, whatever it may be. But things are changing in the universe around her -- and not all for the good. The already fragile alliance between Earth and Venus shows signs of shattering, as the Cytherians seek a greater independence from the stifling dominance of the home planet. And rumors of a hidden agenda among the &quot;Habbers&quot; -- the cybernetically enhanced dwellers of the mobile asteroid &quot;Habitats&quot; -- threaten to bring about a rebirth of the bloody turmoil that once nearly doomed a world. With catastrophe looming, it is Mahala who must take the steps to ensure that there is a future for her flawed, star-traveling kind -- as a mysterious call from deep space pulls her toward the fulfillment of her most cherished dreams . . . even as it tears her brutally away from everything she has ever known and loved.\r\n\r\n\r\n\r\nRead by Andi Arndt\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:d88b0f647779b558eacf047887010c77c994d806","amp;dn":"Pamela+Sargent+-+Child+of+Venus+%28Venus+%233%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d88b0f647779b558eacf047887010c77c994d806","infoHashBuffer":{"type":"Buffer","data":[216,139,15,100,119,121,181,88,234,207,4,120,135,1,12,119,201,148,216,6]},"announce":[],"urlList":[]}}