{"title":"Coast to Coast Prison war drugs aprl 4","uid":14188979,"size":28577876,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d89680dc63b64aa3166bb4de6b4fd8638f2f29d4&amp;dn=Coast+to+Coast+Prison+war+drugs+aprl+4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1459873951,"description":"Coast to Coast April 4 2016 - Prison &amp; War on Drugs\r\nmp3 2 hours \r\n\r\nDate:\tMonday - April 4, 2016\r\nHost:\tGeorge Noory\r\nGuests:\tRichard Stratton, Paul Bannister\r\nIn the first half, filmmaker, screenwriter, and producer Richard Stratton detailed how he came to spend 8 years in prison, what he learned about America's prison industrial complex, and how the prohibition on plants aka the War on Drugs is destroying our communities, and ruining young lives. In the 1980s, he was convicted under the 'Kingpin' law and originally sentenced for 25 years without parole for smuggling marijuana. Stratton refused to turn in evidence on his associates, such as Hunter Thompson and Norman Mailer in exchange for a reduced term. Later, he began studying law in the prison library and found statutes that showed that you can reduce a prisoner's time for cooperation, but you can't add on more time for not turning over evidence, and so his sentence was reduced to 10 years.\r\n\r\nAround 60% of the people in American prisons are locked up for non-violent drug crimes, and receive very little help or rehabilitation, he said. Instead of criminalizing drugs, we should make efforts toward education about the pitfalls of drug usage, he remarked. &quot;In a free society, it's not up to the government to tell us how to alter our consciousness as long we're not hurting other people,&quot; and the shifting of marijuana laws in some states shows that change is afoot, and that people are rejecting laws that don't make sense, he added. Stratton recalled his days when he was in the 'Hippie Mafia'-- which included various groups around the US that dealt drugs but had a code of ethics that included trust, honor, and non-violence","torrent":{"xt":"urn:btih:d89680dc63b64aa3166bb4de6b4fd8638f2f29d4","amp;dn":"Coast+to+Coast+Prison+war+drugs+aprl+4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d89680dc63b64aa3166bb4de6b4fd8638f2f29d4","infoHashBuffer":{"type":"Buffer","data":[216,150,128,220,99,182,74,163,22,107,180,222,107,79,216,99,143,47,41,212]},"announce":[],"urlList":[]}}