{"title":"El nombre de Dios es Misericordia - Papa Francisco","uid":13911302,"size":107302,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:daea34cad728ceeaf43f59baf82a5b9055d15ee5&amp;dn=+El+nombre+de+Dios+es+Misericordia+-+Papa+Francisco&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"70n01m0","files":1,"time":1458301290,"description":"La Iglesia no está en el mundo para condenar, sino para permitir el encuentro con ese amor visceral que es la misericordia de Dios. Para que eso suceda, es necesario salir. Salir de las iglesias y de las parroquias, salir e ir a buscar a las personas allí donde viven, donde sufren, donde esperan. \r\n\r\n«La misericordia es el primer atributo de Dios. Es el nombre de Dios. No hay situaciones de las que no podamos salir, no estamos condenados a hundirnos en arenas movedizas.»\r\n\r\nCon palabras sencillas y directas, el papa Francisco se dirige a cada hombre y mujer del planeta entablando un diálogo íntimo y personal. En el centro, se halla el tema que más le interesa –la misericordia–, desde siempre eje fundamental de su testimonio y ahora de su pontificado. En cada página vibra el deseo de llegar a todas aquellas almas –dentro y fuera de la Iglesia– que buscan darle un sentido a la vida, un camino de paz y de reconciliación, una cura a las heridas físicas y espirituales. En primer lugar está esa humanidad inquieta y doliente que pide ser acogida y no rechazada: los pobres y los marginados, los presos y las prosti­tutas, pero también los desorientados y los que viven alejados de la fe, los homosexuales y los divorciados.\r\n\r\nEn la conversación con el vaticanista Andrea Tornielli, Francisco explica –a través de recuerdos de juventud y episodios relacionados con su experiencia como pastor– las razones de un Año Santo extraordinario que ha deseado intensamente. Sin ignorar las cuestio­nes éticas y teológicas, rebate que la Iglesia no puede cerrar la puerta a nadie; por el contrario, su tarea es adentrarse en las conciencias para abrir rendijas a la hora de asumir responsabilidad y alejar el mal realizado.\r\n\r\nEn la franqueza de la conversación, Francisco no se sustrae tampoco de afrontar el vínculo de la relación entre misericordia, justicia y corrupción.\r\n\r\nY a esos cristianos que se colocan a sí mismos en las filas de los «justos», les recuerda: «También el Papa es un hombre que necesita la misericordia de Dios»","torrent":{"xt":"urn:btih:daea34cad728ceeaf43f59baf82a5b9055d15ee5","amp;dn":"+El+nombre+de+Dios+es+Misericordia+-+Papa+Francisco","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daea34cad728ceeaf43f59baf82a5b9055d15ee5","infoHashBuffer":{"type":"Buffer","data":[218,234,52,202,215,40,206,234,244,63,89,186,248,42,91,144,85,209,94,229]},"announce":[],"urlList":[]}}