{"title":"Chemical Bonding at Surfaces and Interfaces","uid":14417897,"size":16075346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ddd181d3a995e567919c5f33c7c2936aafd31868&amp;dn=Chemical+Bonding+at+Surfaces+and+Interfaces&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1461510896,"description":"Chemical Bonding at Surfaces and Interfaces - Anders Nilsson et al. (Elsevier, 2008).pdf\r\n\r\nISBN 978-0-444-52837-7\r\n\r\nMolecular surface science has made enormous progress in the past 30 years. The development can be characterized by a revolution in fundamental knowledge obtained from simple model systems and by an explosion in the number of experimental techniques. The last 10 years has seen an equally rapid development of quantum mechanical modeling of surface processes using Density Functional Theory (DFT).\r\n\r\nChemical Bonding at Surfaces and Interfaces focuses on phenomena and concepts rather than on experimental or theoretical techniques. The aim is to provide the common basis for describing the interaction of atoms and molecules with surfaces and this to be used very broadly in science and technology.\r\n\r\nThe book begins with an overview of structural information on surface adsorbates and discusses the structure of a number of important chemisorption systems. Chapter 2 describes in detail the chemical bond between atoms or molecules and a metal surface in the observed surface structures. A detailed description of experimental information on the dynamics of bond-formation and bond-breaking at surfaces make up Chapter 3. Followed by an in-depth analysis of aspects of heterogeneous catalysis based on the d-band model. In Chapter 5 adsorption and chemistry on the enormously important Si and Ge semiconductor surfaces are covered. In the remaining two Chapters the book moves on from solid-gas interfaces and looks at solid-liquid interface processes. In the final chapter an overview is given of the environmentally important chemical processes occurring on mineral and oxide surfaces in contact with water and electrolytes","torrent":{"xt":"urn:btih:ddd181d3a995e567919c5f33c7c2936aafd31868","amp;dn":"Chemical+Bonding+at+Surfaces+and+Interfaces","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddd181d3a995e567919c5f33c7c2936aafd31868","infoHashBuffer":{"type":"Buffer","data":[221,209,129,211,169,149,229,103,145,156,95,51,199,194,147,106,175,211,24,104]},"announce":[],"urlList":[]}}