{"title":"JFK The Smoking Gun","uid":14283462,"size":418510234,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:df462a16cf441adcb6191e01931be7d98d16c53a&amp;dn=JFK+The+Smoking+Gun&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KJBergo","files":2,"time":1460385267,"description":"J.F.K.  The Smoking Gun\r\n\r\nAustralian detective Colin McLaren investigates the JFK assassination using ballistics expert Howard Donahue's evidence of a second shooter in Dealey Plaza.  \r\nIt's been almost fifty years since President John F Kennedy was shot in Dallas and almost three quarters of Americans still don't believe the official verdict.\r\nNow there's startling new evidence from a former Australian homicide detective.\r\nHe's analysed the complete catalogue of evidence, testimony and witness statements and is convinced he has the answer to who killed JFK.\r\n&quot;It looks like something has happened along the motorcade route, I repeat something has happened on the motorcade route&quot; - these were the soundbites that captured the moment.\r\nThe death of President Kennedy is one of the most documented assassinations in history, and almost 50 years on remains a mystery.\r\nRetired Australian detective Colin McLaren has spent the last four years investigating.\r\n&quot;Once it's got its hook into you ... I found that hook in the early days when I started finding witnesses that could smell smoke on the street level, then I couldn't give up I guess,&quot; he said.\r\nHe sorted through ballistics reports, forensic evidence and hours of eyewitness accounts and previously hidden testimonies - all revealed in a new documentary called 'JFK Smoking Gun'.\r\nEach of the witnesses seemed to be consistent with each other, that they were under threat of gag orders,&quot; Mr McLaren says.\r\n&quot;Some of them were threatened with court martialling if they told what went on in the autopsy and what really went on in the autopsy was getting the evidence, some of the x-rays, some of the specimens, and making them disappear - including JFK's brain.&quot;     \r\nArmed with this information, Mr McLaren believes he can reveal who really fired the fatal shot - it's a conclusion that seems guaranteed to start the controversy all over again","torrent":{"xt":"urn:btih:df462a16cf441adcb6191e01931be7d98d16c53a","amp;dn":"JFK+The+Smoking+Gun","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df462a16cf441adcb6191e01931be7d98d16c53a","infoHashBuffer":{"type":"Buffer","data":[223,70,42,22,207,68,26,220,182,25,30,1,147,27,231,217,141,22,197,58]},"announce":[],"urlList":[]}}