{"title":"Discreet Service 2015 (NEW 2016 VIV THOMAS) [DVD RIP ALL 4 SPLIT","uid":14324281,"size":932762323,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e19fe24e34fa823e89cf24d06cc3b1cccc6372ea&amp;dn=Discreet+Service+2015+%28NEW+2016+VIV+THOMAS%29+%5BDVD+RIP+ALL+4+SPLIT&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TechLatina","files":4,"time":1460635946,"description":"\nDiscreet Service 2015 (NEW 2016 VIV THOMAS) [DVD RIP ALL 4 SPLIT SCENES]\r\n\r\n\r\n\r\n\r\nCAST\r\nCandy Sweet\r\nLauren\r\nAmirah Adara\r\nBessie\r\nAlexa Tomas\r\nMilane Blanc\r\n\r\nDESCRIPTION\r\nThe much-anticipated sequel to one of Viv Thomas' most popular movies, &quot;Discreet Service 2015&quot; puts a fresh spin on an evergreen theme with a delicious new cast of masseuses and their clients. Candy Sweet plays a shy girl hoping a massage will make her more open to new experiences. Milana Blanc looks cute in her uniform as she douses Candy with oil and fingers her fast and deep. Cindy plays with her masseuse's beautiful breasts, slipping a hand into her white cotton panties to stroke her pussy. Milana mounts the massage table and Candy eats her skilfully, then finger-bangs her pussy and ass simultaneously. In episode two, Alexa Tomas talks about her love of running, and how much she enjoys having a massage to ease her tight muscles. Alexa's nipples are diamond-hard as pretty Amirah Adarah massages her. The girls eat and finger each other's pussy and ass in multiple positions, sharing some intense orgasms. In episode three, Milana takes the role of masseuse, masturbating before she meets her beautiful client. Bessie's slick fingers circle around Milana's pussy teasingly, before they dip inside. Milana spreads her thighs wide and Bessie rubs her clit as she diddles her, and then slides a finger into her ass. They rub their slippery bodies together and after some fingering fun, stand and grind to a mutual climax. In the final episode, Lauren explains why she loves having a massage, before Amirah anoints every inch of her skin with oil. After some teasing and clit-rubbing, Amirah fingers her in both holes, driving her wild. Amirah goes face down, ass up and Lauren oils her up and slides a finger into her tightest hole as she strokes herself to an intense climax. Fans of all-naked lesbian massage fun are sure to enjoy the happy endings... Let the girls of &quot;Discreet Service 2015&quot; rub you up the right way!","torrent":{"xt":"urn:btih:e19fe24e34fa823e89cf24d06cc3b1cccc6372ea","amp;dn":"Discreet+Service+2015+%28NEW+2016+VIV+THOMAS%29+%5BDVD+RIP+ALL+4+SPLIT","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e19fe24e34fa823e89cf24d06cc3b1cccc6372ea","infoHashBuffer":{"type":"Buffer","data":[225,159,226,78,52,250,130,62,137,207,36,208,108,195,177,204,204,99,114,234]},"announce":[],"urlList":[]}}