{"title":"Zombie Grinder 1.0.33.88 - TheDarkKnight","uid":14526813,"size":265842396,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e534245b0a80e745d14207bfb9741ea8a74de35a&amp;dn=Zombie+Grinder+1.0.33.88+-+TheDarkKnight&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"batknight2016","files":1,"time":1462414359,"description":"CAN BE PLAYED ONLINE WITH LAN\r\n\r\nStore Page:\r\n \nhttp://store.steampowered.com/app/263920/\r\n\r\nAbout This Game:\r\n\r\nZombie Grinder is cross-platform, multiplayer game that features a variety of different game-modes to enjoy with friends, both locally and online. You can slaughter your way through many different maps, game modes and enemies - With tons of weapons and customization options! \r\n\r\nCooperation \r\n\r\nSupports both local shared-screen coop (and split-screen if in pvp modes), online coop, and even the ability to mix both - bringing in multiple local players into online games! \r\n\r\nSupport is available for global community-wide in-game-chat, local in-game-chat and voice chat to make cooperation and setting up matches even easier! \r\n\r\nWeapons &amp; Customization\r\n \r\nThe game contains a constantly evolving stable of items to find in-game and add to your inventory! Giving you options to change each of your characters individual look and load-out. There are even some rare special-drops of steam-inventory items that have rare randomized stats for you to bring into your game! \r\n\r\nThis stable of items includes many fun and exotic weapons - everything from automated turrets to rocket-propelled-chainsaws! \r\n\r\nSkills\r\n \r\nThe longer you play the game, the more experience your character gains, and the more times you level up! Leveling up allows you to unlock parts of the skill tree that give you passive or active skills you can activate during games to give you an edge over the enemy! \r\n\r\nGame Modes\r\n \r\nMany different modes are implemented, with more being worked on! For PVE this includes modes like: like wave-based game modes and objective modes. While PVP provides the common deathmatch style modes, CTF, TDM, DM, Gun-Game, etc. \r\n\r\nIf that's not enough we provide several rogue-like game modes that procedurally generate their game maps! Providing more longevity to the game! \r\n\r\nVarious game modes also provide global ranking to show how awesome you are at the game! \r\n\r\nLevel-Editor &amp; Workshop\r\n \r\nIf that's not enough, the game also features a level editor that has full support for Steam Workshop. If the provided maps aren't enough, you can make your own or browse ones other people have made! \r\n\r\nIn future we want to work on opening up the source of some of the gameplay code to allow far-larger scope modifications!\r\n\r\nScreenshots:\r\n \nhttp://i.imgur.com/tvkNw2a.jpg \nhttp://i.imgur.com/DCw57TQ.jpg \nhttp://i.imgur.com/jdm8GEn.jpg \nhttp://i.imgur.com/W7FrP2P.jpg \nhttp://i.imgur.com/tJmIZAV.jpg \nhttp://i.imgur.com/4aKBnqa.jpg \nhttp://i.imgur.com/YksYJz2.jpg \nhttp://i.imgur.com/6d6oRao.jpg \nhttp://i.imgur.com/3QdtlUo.jpg \nhttp://i.imgur.com/RdhSTTL.jpg \nhttp://i.imgur.com/UrTqrzz.jpg \nhttp://i.imgur.com/uOVz0wo.jpg \nhttp://i.imgur.com/s04PcMa.jpg \nhttp://i.imgur.com/YwEfFXP.jpg\r\n\r\nAuthors Note:\r\n\r\nWhy I do this? I share because I want to give back to the community that has given to me for years. I believe torrents are a great form or advertising and promoting. When people can test games and watch movies before buying them they are more likely to support the developers / producers by buying their products.\r\n\r\nI Try to release things no one else has so when people steal my torrents without saying thanks or giving recognition it makes me want to stop. So if you want to share my stuff please mention me.\r\n\r\nPlease don't hit and run show some appreciation and say thanks/seed so you motivate me to keep sharing things that no one else has. My motivation is to give to the community but if your not telling me you like it I feel i'm wasting my time. I have lots of stuff no one else has shared but i'm not going to put much time into it unless people seed and say thanks. -TheDarkKnight\r\n\r\n\r\n!!!IF YOU LIKE THIS PLEASE SUPPORT THE DEVELOPERS AND BUY IT!!!","torrent":{"xt":"urn:btih:e534245b0a80e745d14207bfb9741ea8a74de35a","amp;dn":"Zombie+Grinder+1.0.33.88+-+TheDarkKnight","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e534245b0a80e745d14207bfb9741ea8a74de35a","infoHashBuffer":{"type":"Buffer","data":[229,52,36,91,10,128,231,69,209,66,7,191,185,116,30,168,167,77,227,90]},"announce":[],"urlList":[]}}