{"title":"Topper Prepares_True Stories of Those Who Cracked the JEE.pdf","uid":13501048,"size":979759,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8470578859bf8077a4afbac8d784c97c1d6e549&amp;dn=Topper+Prepares_True+Stories+of+Those+Who+Cracked+the+JEE.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iamshanks","files":1,"time":1455196848,"description":"About The Book:\r\nAs the water rose in his village during the floods in Bihar forcing him and his family to live in tents, Chiranjeev dreamt of a future working in a plush office in a city. Hundreds of kilometres away in Chhattisgarh, Sudoku whizkid Vipul focused on the international Physics Olympiad and winning a top rank in the All-India Joint Entrance test. Success would mean a coveted seat in one of the Indian Institutes of Technology―not to mention celebrity status amongst peers and in the family. With an acceptance ratio far lower than Harvard or MIT, the IIT JEE (or JEE Advanced) is one of the most competitive exams in the world. So how do the toppers succeed? Are there smart ways to prepare for the exam? What do the best educators in the field recommend? How do the students’ quest transform the lives of their families? Through extensive interviews with JEE top rankers, pioneering teachers and the many students who had to fight extraordinary odds to get into an IIT, Soum Paul, entrepreneur and IIT Kanpur alumnus, puts together stories of fierce competition, incredible hard work and sacrifice. A fascinating account of the battle of a million brains\r\n\r\nAbout The Author: \r\nSoum Paul graduated from IIT Kanpur in 2000 with a Computer Science degree. Since then, he has been part of several technology start-ups based out of the US, the UK and India. Along with technology, he continues to pursue writing and film-making and has directed a number of short films and documentaries for various organizations.\r\n\r\nPLEASE SEED and COMMENT","torrent":{"xt":"urn:btih:e8470578859bf8077a4afbac8d784c97c1d6e549","amp;dn":"Topper+Prepares_True+Stories+of+Those+Who+Cracked+the+JEE.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8470578859bf8077a4afbac8d784c97c1d6e549","infoHashBuffer":{"type":"Buffer","data":[232,71,5,120,133,155,248,7,122,74,251,172,141,120,76,151,193,214,229,73]},"announce":[],"urlList":[]}}