{"title":"poroshenko-assassination-kiev-stephen-f-cohen.mp3","uid":14312973,"size":38916947,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e902857e77e05eb751174cc0d5c98fbe95be2ae1&amp;dn=poroshenko-assassination-kiev-stephen-f-cohen.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kirkmoron","files":1,"time":1460558236,"description":"Poroshenko Assassination Threat in Kiev. Voter Rejection of Ukraine in the Netherlands. Stephen F. Cohen, NYU, Princeton, EastWestAccord.com\r\n\r\nThe Ukrainian radicals promised to shoot the Ukraine's President given a recent offshore scandal.\r\n\r\nThe Right Sector claimed that if a new revolution started, the President Petro Poroshenko would not manage to escape from the country, &quot;an execution in a dark vault would await him&quot;. The Right Sector spokesman Artyom Skoropadsky said that the execution &quot;would be carried out by a group of young Ukrainian military men or members of the National Guard&quot;.\r\n \nhttp://www.pravdareport.com/news/world/ussr/ukraine/12-04-2016/134145-poroshenko-0/#sthash.S7D88lfG.dpuf\r\n\r\n_____________\r\n\r\nSaakashvili – who served as Georgia’s president from 2004-2013 – has sat in Odessa’s gubernatorial chair since May 2015 after Ukrainian President Petro Poroshenko appointed him in the hope that Saakashvili would replicate many of the anti-corruption and pro-business policies that marked the early period of his presidency.\r\n \nhttp://georgiatoday.ge/news/3285/Saakashvili-Eyes-National-Role-as-Ukraine’s-Political-Crisis-Intensifies\r\n\r\n_________\r\n\r\nThe European Commission will propose this month granting visa-free travel to Ukrainians despite a Dutch referendum vote against an EU-Ukraine agreement partly motivated by hostility to migration, a senior EU source said.\r\n\r\nCommission President Jean-Claude Juncker promised Ukrainian President Petro Poroshenko in March that the EU executive would put forward the eagerly awaited proposal in April, offering Ukrainians the most tangible benefit of closer ties at a time when a free trade deal has not yet borne fruit for their economy.\r\n\r\n&quot;It may look as if we're ignoring the Dutch voters, but we have to keep our word to Ukraine, which has met the conditions,&quot; the source said.\r\n\r\nThe proposal must be approved by a qualified majority of EU member states and by the European Parliament to take effect.\r\n \nhttp://www.reuters.com/article/us-netherlands-eu-ukraine-idUSKCN0X70SJ","torrent":{"xt":"urn:btih:e902857e77e05eb751174cc0d5c98fbe95be2ae1","amp;dn":"poroshenko-assassination-kiev-stephen-f-cohen.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e902857e77e05eb751174cc0d5c98fbe95be2ae1","infoHashBuffer":{"type":"Buffer","data":[233,2,133,126,119,224,94,183,81,23,76,192,213,201,143,190,149,190,42,225]},"announce":[],"urlList":[]}}