{"title":"Kaalapani 96 Malayalam DVDRip(Encoded by Bibin){JJ's Collection}","uid":13578642,"size":672683864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ea7eb6d79995f720a43b4944cca3ca4763512556&amp;dn=Kaalapani+96+Malayalam+DVDRip%28Encoded+by+Bibin%29%7BJJ%27s+Collection%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jithin87","files":1,"time":1455735572,"description":"Kaalapani (English: Black Water) is a 1996 Indian epic film set in 1915 focusing the lives of Indian freedom fighters kept in prison during the British Raj. The film is co-wriiten and directed by Priyadarshan, starring Mohanlal, Prabhu Ganesan, Tabu, Nedumudi Venu, Sreenivasan, Tinnu Anand, Annu Kapoor, Alex Draper, Amrish Puri, and Vineeth. Kaalapani is regarded as one of the evergreen classics of Malayalam cinema. Although it is originally a Malayalam film, it was dubbed into Hindi (Saza-E-Kala Pani), Tamil (Siraichalai) and Telugu (Kaala Pani). Amitabh Bachchan had bought the Hindi dubbing rights, besides narrating the prologue for the Hindi dubbed version.\r\n\r\nThe film is about the lives of prisoners in British India who are brought to KÄlÄ PÄnÄ«, the Cellular Jail in Port Blair, Andaman and Nicobar Islands. The name Kalapani is derived from the mode of imprisonment in British India. Ilaiyaraaja composed the music, the cinematography was by Santosh Sivan, and the editing by N. Gopalakrishnan. The film introduced Dolby Stereo into Malayalam cinema. It was made on a budget of â‚¹2.5 crore, making it the costliest Malayalam film made until then. Mohanlal produced the film under his studio Pranavam Arts International.\r\n\r\nThe film won three National Film Awards including the awards for Best Art Direction (Sabu Cyril), Best Special Effects (S. T. Venky) and Best Cinematography (Santosh Sivan). Along with that it won six Kerala State Film Awards. It was released in 450 theaters worldwide, which was the largest release for any Indian film until then","torrent":{"xt":"urn:btih:ea7eb6d79995f720a43b4944cca3ca4763512556","amp;dn":"Kaalapani+96+Malayalam+DVDRip%28Encoded+by+Bibin%29%7BJJ%27s+Collection%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea7eb6d79995f720a43b4944cca3ca4763512556","infoHashBuffer":{"type":"Buffer","data":[234,126,182,215,153,149,247,32,164,59,73,68,204,163,202,71,99,81,37,86]},"announce":[],"urlList":[]}}