{"title":"Trump Supports Israel.mp3","uid":14531385,"size":5244154,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f07d1a3c9662ddc82ef975be540a16adf3ddd33a&amp;dn=Trump+Supports+Israel.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1462447118,"description":"\nTrump Supports Israel. #Hamas Prepares for War. @aaronkleinshow, Breitbart Jerusalem. @realdonaldtrump.\r\n\r\nTEL AVIV – In provoking the Israel Defense Forces along the Israel-Gaza border, Hamas seems to be testing Israel’s military and political response to the possibility of another major outbreak of war in the south.\r\n\r\n“Gaza’s Islamist rulers are also clearly sending a message to Egypt and Palestinian Authority President Mahmoud Abbas that Hamas must be part of any future accommodation regarding border security along the coastal enclave. The Egyptians have been mediating reconciliation talks between Fatah and Hamas with Palestinian Authority President Mahmoud Abbas’ Fatah Party eyeing a security presence along the Gaza-Egypt border. Abbas is due in Egypt next week for consultations.\r\n\r\n“Over the last 24 hours, Hamas militants fired at least six times at IDF forces searching for terror tunnels along the Israel-Gaza border. The Israel Air Force retaliated by firing at Hamas targets in Gaza on Wednesday.\r\n\r\nHamas’s escalation seems to be further aimed at signalling that it is willing to take risks to prevent the IDF from destroying the terror tunnels, which are critical to Hamas’s battle-plans and regional power.\r\n\r\n“Hamas is also increasingly desperate as its economy is on the brink of collapse, and it may be using the violence to send a message to Israel and the international community that the Islamist group is willing to draw Israel into conflict if Hamas’s financial needs are not met. Renewed hostilities would also help to redirect Palestinian anger away from Hamas’s own failing government and toward the Jewish state.\r\n \nhttp://www.breitbart.com/jerusalem/2016/05/04/hamas-testing-israels-preparedness-war-provocative-cross-border-attacks/\r\n \nhttp://www.breitbart.com/author/aaron-klein/\r\n\r\nThe John Batchelor Show\t\r\n \nhttp://www.breitbart.com/author/aaron-klein/","torrent":{"xt":"urn:btih:f07d1a3c9662ddc82ef975be540a16adf3ddd33a","amp;dn":"Trump+Supports+Israel.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f07d1a3c9662ddc82ef975be540a16adf3ddd33a","infoHashBuffer":{"type":"Buffer","data":[240,125,26,60,150,98,221,200,46,249,117,190,84,10,22,173,243,221,211,58]},"announce":[],"urlList":[]}}