{"title":"SEO 2016 in 80 Minute","uid":14319457,"size":71268736,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f23964833d240eb8fe56188f8704e7e8d545995f&amp;dn=SEO+2016+in+80+Minute&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"ADAMOON2","files":2,"time":1460596249,"description":"The course will guide you into the world of Search Engine Optimization (SEO). In less than 80 minutes you will get to know all the essentials, in a both compact and comprehensive way.\r\n\r\nThe course consists of 3 Factors:\r\n\r\n1. Learning your vocabulary: dive into the language of SEO. What are SERPS, brand and money keywords, broken links, power and trust, anchor texts, 301 redirects and content discovery? These and many more terms and their explanation are included in the lectures.\r\n\r\n2. Get to know the Tools: there are numerous tools on the market to support you in optimizing your webpage, blog or shop. By showing hands on sessions you will learn how to use tools like e.g. Sistrix, Link Research Tools, Google Keyword Planner, Spike\r\n\r\n3. Tips &amp; Tricks: Obtain numerous concrete instructions on how to optimize your website in order to get ranked best in search engines. In the end of the course you will receive a summary in the form of a check list.\r\n\r\nTopics you will learn about: Keywords, Search Engine Result Page (SERP), Search Index, Search Engine Optimization (SEO), Search Engine Marketing (SEM), On Page Optimization, HTML, Tags, Brand keywords, Money keywords, Long Tail / Compound key words, Title Tag, Meta Description Tag, H1 Headline, H2 Headline, Text Body, Keyword Stuffing, Supplementary Content, Video Captions, Image Alt Tag, HTML5 vs. Flash, Outbound Links, Internal Links, Backlinks, Broken Links, Authority Pages, Trustworthyness, Google Keyword Planner, Average Monthly Searches, Keyword Suggestion Lists, Google Suggest, Sistrix Visibility Index, Google Panda Update, Off Page Optimization, Link Graph, Page Rank, Power, mozRank, Link Farm, Black Hat SEO, White Hat SEO, Trustes Sites, Site Authority, Page Authority , Follow, No Follow, Power*Trust, Open SEO Stats, Link Partnership, Social Bookmarks, Web Directories, Anchor Text, Link Research Tools, seoMOZ, Link Profile, Co-Occurrence, Harmful Backlinks, Deep Link, Index Ability, User Sitemap, XML Sitemap, robots.txt, Canonical Links, Pagination, 404 Error, 301 Redirect, 302 Redirect, Response Code 200, Apache Mod Rewrite, Tidy HTML, Social SEO, Content Discovery","torrent":{"xt":"urn:btih:f23964833d240eb8fe56188f8704e7e8d545995f","amp;dn":"SEO+2016+in+80+Minute","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f23964833d240eb8fe56188f8704e7e8d545995f","infoHashBuffer":{"type":"Buffer","data":[242,57,100,131,61,36,14,184,254,86,24,143,135,4,231,232,213,69,153,95]},"announce":[],"urlList":[]}}