{"title":"Napoleon A Life - Andrew Roberts","uid":14319382,"size":720065189,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f400bbcb6dda4cd1a6d174669e3a9877e9052a0c&amp;dn=Napoleon+A+Life+-+Andrew+Roberts&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Beanhh123","files":5,"time":1460595905,"description":"Austerlitz, Borodino, Waterloo: his battles are among the greatest in history, but Napoleon Bonaparte was far more than a military genius and astute leader of men. Like George Washington and his own hero Julius Caesar, he was one of the greatest soldier-statesmen of all times.\r\n\r\nAndrew Roberts’s Napoleon is the first one-volume biography to take advantage of the recent publication of Napoleon’s thirty-three thousand letters, which radically transform our understanding of his character and motivation. At last we see him as he was: protean multitasker, decisive, surprisingly willing to forgive his enemies and his errant wife Josephine. Like Churchill, he understood the strategic importance of telling his own story, and his memoirs, dictated from exile on St. Helena, became the single bestselling book of the nineteenth century.\r\n\r\nAn award-winning historian, Roberts traveled to fifty-three of Napoleon’s sixty battle sites, discovered crucial new documents in archives, and even made the long trip by boat to St. Helena. He is as acute in his understanding of politics as he is of military history. Here at last is a biography worthy of its subject: magisterial, insightful, beautifully written, by one of our foremost historians","torrent":{"xt":"urn:btih:f400bbcb6dda4cd1a6d174669e3a9877e9052a0c","amp;dn":"Napoleon+A+Life+-+Andrew+Roberts","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f400bbcb6dda4cd1a6d174669e3a9877e9052a0c","infoHashBuffer":{"type":"Buffer","data":[244,0,187,203,109,218,76,209,166,209,116,102,158,58,152,119,233,5,42,12]},"announce":[],"urlList":[]}}