{"title":"Boronic Acids - Preparation and Applications in Organic Synthesi","uid":14418911,"size":5392922,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5f3a81ba443f3dac14d6319f75c2d21a206c090&amp;dn=Boronic+Acids+-+Preparation+and+Applications+in+Organic+Synthesi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1461521490,"description":"Boronic Acids - Preparation and Applications in Organic Synthesis and Medicine - D. G. Hall (Wiley-VCH, 2005).pdf\r\n\r\nISBN 978-3-527-30991-7\r\n\r\nFor the first time, the whole field of organoboronic acids is presented in one comprehensive handbook.\r\nProfessor Dennis Hall, a rising star within the community, covers all aspects of this important substance class, including applications in chemistry, biology and medicine.\r\nStarting with an introduction to the structure, properties, and preparation of boronic acid derivatives, together with an overview of their reactions and applications, the book goes on to look at metal-catalyzed borylation of alkanes and arenas, coupling reactions and rhodium-catalyzed additions of boronic acids to alkenes and carbonyl compounds. There follows chapters on copper-promoted C-O and C-N cross-coupling of boronic acids, recent applications in organic synthesis, as well as alpha-haloalkylboronic esters in asymmetric synthesis. Later sections deal with cycloadditions, organoboronic acids, oxazaborolidines as asymmetric inducers, and boronic acid based receptors and sensors. The whole is rounded off with experimental procedures, making this invaluable reading for organic, catalytic and medicinal chemists, as well as those working in organometallics","torrent":{"xt":"urn:btih:f5f3a81ba443f3dac14d6319f75c2d21a206c090","amp;dn":"Boronic+Acids+-+Preparation+and+Applications+in+Organic+Synthesi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5f3a81ba443f3dac14d6319f75c2d21a206c090","infoHashBuffer":{"type":"Buffer","data":[245,243,168,27,164,67,243,218,193,77,99,25,247,92,45,33,162,6,192,144]},"announce":[],"urlList":[]}}