{"title":"The Century Of The Self 2002 Adam Curtis 480p 2ch subs x265","uid":14271562,"size":1065081872,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f64bf075600352b54d909562304ffc5f7cf6c100&amp;dn=The+Century+Of+The+Self+2002+Adam+Curtis+480p+2ch+subs+x265&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bsg4you","files":6,"time":1460315906,"description":"The.Century.Of.The.Self.2002.Adam.Curtis.480p.2ch.subs.x265\r\n\r\nCentury.Of.The.Self.1of4.Happiness.Machines.480p.2ch.subs.x265\r\nCentury.Of.The.Self.2of4.The.Engineering.Of.Consent.480p.2ch.subs.x265\r\nCentury.Of.The.Self.3of4.A.Policeman.Inside.All.Our.Heads.480p.2ch.subs.x265\r\nCentury.Of.The.Self.4of4.Eight.People.Sipping.Wine.In.Kettering.480p.2ch.subs.x265\r\n\r\nTHIS TORRENT USES X265 HEVC (High Efficiency Video Coding) VIDEO\r\nPLEASE USE A PLAYER THAT SUPPORTS X265 HEVC VIDEO LIKE VLC, POTPLAYER, ETC\r\n\r\nThe Century of the Self (2002) by Adam Curtis\r\nvideo: 640x480 HEVC crf=23.00 preset=medium (~461Kbps to ~583Kbps)\r\naudio: 2.0 Stereo HE-AAC 96Kbps\r\nsubs1: English\r\nsubs2: French\r\nTotals: 3hour55min32sec 1,065,016,384bytes\r\n  http://www.imdb.com/title/tt0432232/  \r\n\r\nPart1: Happiness Machines\r\n2002.03.17 58min45sec 300,426,619bytes\r\n\r\nPart2: The Engineering of Consent\r\n2002.03.24 58min52sec 246,895,836bytes\r\n\r\nPart3: There is a Policeman Inside All Our Heads; He Must Be Destroyed\r\n2002.03.31 58min50sec 259,252,554bytes\r\n\r\nPart4: Eight People Sipping Wine in Kettering\r\n2002.04.07 59min03sec 258,441,375bytes\r\n\r\nNote, for part1 and part2 both the English and French subtitles were adjusted so they synchronize better with the dialog. The part1 and part2 French subs needed much more adjustment and still float a little bit but they are much closer than before.\r\n\r\nIMDB: A documentary about the rise of psychoanalysis as a powerful mean of persuasion for both governments and corporations.\r\n\r\nBBC: To many in politics and business, the triumph of the self is the ultimate expression of democracy, where power has finally moved to the people. Certainly, the people may feel they are in charge, but are they really? The Century of the Self tells the untold and sometimes controversial story of the growth of the mass-consumer society. How was the all-consuming self created, by whom, and in whose interests?\r\n\r\nWIkipedia: The Century of the Self is a 2002 British television documentary series by filmmaker Adam Curtis. It focuses on the work of psychoanalysts Sigmund Freud and Anna Freud, and PR consultant Edward Bernays. In episode one, Curtis says, &quot;This series is about how those in power have used Freud's theories to try and control the dangerous crowd in an age of mass democracy.&quot;\r\n\r\nSigmund Freud, the founder of psychoanalysis, changed our perception of the mind and its workings. The documentary explores the various ways that governments and corporations have utilized Freud's theories. Freud and his nephew Edward Bernays, who was the first to use psychological techniques in public relations, are discussed in part one. His daughter Anna Freud, a pioneer of child psychology, is mentioned in part two. Wilhelm Reich, an opponent of Freud's theories, is discussed in part three.\r\n\r\nAlong these lines, The Century of the Self asks deeper questions about the roots and methods of consumerism and commodification and their implications. It also questions the modern way people see themselves, the attitudes to fashion, and superficiality.\r\n\r\n&quot;It's rare to see a documentary that bursts your mind right open, exploding your perceptions of the world we live in.&quot;\r\n- Owen Gleiberman, Entertainment Weekly\r\n\r\n&quot;The true subject of Curtis's lucid, pessimistic film, it turns out, is the frightening adaptability of consumer capitalism.&quot;\r\n- Dennis Lim, Village Voice\r\n\r\nPlease check out other releases of documentaries, Rifftrax, MST3K, Battlestar Galactica, DC Comics, Gotham, Star Trek, and more at:\r\n  https://thepiratebay.se/user/bsg4you/  \r\n  https://kat.cr/user/bsg4you/uploads/  \r\nand leave any corrections, criticism, comments and requests.\r\n\r\nThanks, bsg4you","torrent":{"xt":"urn:btih:f64bf075600352b54d909562304ffc5f7cf6c100","amp;dn":"The+Century+Of+The+Self+2002+Adam+Curtis+480p+2ch+subs+x265","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f64bf075600352b54d909562304ffc5f7cf6c100","infoHashBuffer":{"type":"Buffer","data":[246,75,240,117,96,3,82,181,77,144,149,98,48,79,252,95,124,246,193,0]},"announce":[],"urlList":[]}}