{"title":"Stargate SG-1 - Season 08 - Episodes 11 thru 20","uid":14271556,"size":5273933353,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f7057485f71f1594970c17005edb2432c04e8b9c&amp;dn=Stargate+SG-1+-+Season+08+-+Episodes+11+thru+20&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":34,"time":1460315751,"description":"Stargate SG-1 - Season 08 - Episodes 11 thru 20\r\n\r\nGemini (Stargate SG-1) \t&quot;Gemini&quot; \t811 \tDecember 14, 2004 \tEarth, P4X-650 \tReplicator \tFifth, Replicator Carter\r\nSG-1 is shocked to see a duplicate of Lt. Colonel Samantha Carter, who reveals that she is a Replicator created by Fifth. She wishes to be destroyed with the Replicator disruptor, to prevent Fifth from getting his hands on her again, since he is heading straight for the Milky Way. However, the Tau'ri plan to have her help them defeat them, since she claims Fifth has created a cipher to become immune to the disruptor.\r\nPrometheusunboundstargte \t&quot;Prometheus Unbound&quot; \t812 \tDecember 21, 2004 \tEarth \tOranian \tVala Mal Doran\r\nLt. General George S. Hammond returns and offers Dr. Daniel Jackson to go with him on board the Prometheus to find the missing Atlantis expedition. However, on the way they pick up a distress signal and investigates. There, a Kull warrior makes its way on board, and imprisons Daniel and leaves the rest of the crew trapped on a damaged Al'kesh.\r\nHarry Maybourne-king \t&quot;It's Good to Be King&quot; \t813 \tJanuary 4, 2005 \tArkhan's World, Earth \tArkhan's people, Jaffa \tAres, Trelak\r\nThe System Lord Ares plans on taking back his old territories to reinforce himself against Ba'al. One of his planets happen to be the new home of Harold Maybourne. SG-1 comes to warn him, but find out that he has become king, and apparently knows this is going to happen.\r\nFull Alert (Stargate SG-1) \t&quot;Full Alert&quot; \t814 \tJanuary 11, 2005 \tEarth \tGoa'uld \tThe Trust\r\nBrigadier General Jack O'Neill finds Robert Kinsey in his home. He tells O'Neill that he needs help in taking down The Trust. However in the process, he is taken and implanted with a Goa'uld, where he is trying to pit the Americans and Russians against each other when both parties accuse each other of having a Goa'uld spy within their ranks. If no one finds the truth, it may result in World War 3.\r\nCitizenjoestargate \t&quot;Citizen Joe&quot; \t815 \tJanuary 18, 2005 \tEarth \tN/A \tN/A\r\nJoe Spencer, a barber from Indiana buys a mysterious stone in a garage sale seven years ago, and ever since then, has received several visions concerning SG-1 and their missions to save the world.\r\nReckoning Part 1 \t&quot;Reckoning (Part 1 of 2)&quot; \t816 \tJanuary 25, 2005 \tChulak, Dakara, Earth \tAsgard, Goa'uld, Jaffa, Kull, Replicator, Tok'ra \tAnubis, Ba'al, Replicator Carter\r\nThe Replicators arrive in the Milky Way and begin an all out assault on the Goa'uld. After they are wiped out, they will turn to the Human populations for resources. Dr. Daniel Jackson is captured by Replicator Carter, in order to get into his memories while he ascended. In the meantime, Teal'c and Bra'tac plan on getting the Jaffa free once and for all, by taking the holy land on Dakara, one of Ba'al's strongholds.\r\nReckoning2stargate \t&quot;Reckoning (Part 2 of 2)&quot; \t817 \tFebruary 1, 2005 \tDakara, Earth \tGoa'uld, Jaffa, Kull, Replicator, Tok'ra \tAnubis, Ba'al, Replicator Carter\r\nAfter successfully taking Dakara, Teal'c and Lt. Colonel Samantha Carter realize that the temple has a weapon that can defeat the Replicators once and for all. However, they have to work fast, as the Replicators discover about the temple also, as well as Ba'al's forces, to destroy it. Meanwhile, the Replicators attack Stargate Command.\r\nThreadsstargate \t&quot;Threads&quot; \t818 \tFebruary 8, 2005 \tDakara, Earth \tAncient, Jaffa, Tok'ra \tAnubis\r\nAfter the defeat of the Replicators, Dr. Daniel Jackson ends up in an Astral Diner, where Oma Desala offers him ascension again. Lt. Colonel Samantha Carter starts having second thoughts about marrying Pete Shanahan, after finding out her father is dying. Anubis plans on taking Dakara and use the superweapon to destroy every living thing in the galaxy.\r\nMoebius1stargate \t&quot;Moebius (Part 1 of 2)&quot; \t819 \tFebruary 15, 2005 \tEarth \tJaffa \tRa\r\nDr. Daniel Jackson hears that Catherine Langford has passed away. He is then given her entire collection, where he discovers a location of a Zero Point Module to contact Atlantis. The catch is, they have to travel back in time to Ancient Egypt to get it. However, their efforts alters the timeline, where Daniel Jackson is a teacher, Samantha Carter is a secretary, and Jack O'Neill has retired.\r\nMoebius Part 2 \t&quot;Moebius (Part 2 of 2)&quot; \t820 \tFebruary 22, 2005 \tChulak, Earth \tGoa'uld, Jaffa \tApophis, Ra\r\nAfter discovering a second Stargate in Antarctica, the team is sent to Chulak, to get to Teal'c and go to Egypt for the Zero Point Module. However, in the process the team are captured, and Teal'c is once again the First Prime of Apophis","torrent":{"xt":"urn:btih:f7057485f71f1594970c17005edb2432c04e8b9c","amp;dn":"Stargate+SG-1+-+Season+08+-+Episodes+11+thru+20","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7057485f71f1594970c17005edb2432c04e8b9c","infoHashBuffer":{"type":"Buffer","data":[247,5,116,133,247,31,21,148,151,12,23,0,94,219,36,50,192,78,139,156]},"announce":[],"urlList":[]}}