{"title":"Downstream (2015).epub Gooner","uid":14316759,"size":15284336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8cea4e28534d4e780c61dd8a798dcc56d574aeb&amp;dn=Downstream+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1460585182,"description":"Downstream - A History and Celebration of Swimming the River Thames (2015).epub Gooner\r\n\r\nPublisher: Aurum Press Ltd (June 15, 2015)\r\nLanguage: English\r\nISBN-10: 1781311196\r\nISBN-13: 978-1781311196\r\n\r\nStretching 215 miles from its source in Gloucestershire, through England's capital and across to the North Sea, the River Thames has always enticed swimmers.\r\n\r\nFrom bathing kings to splashing school children, intrepid wild swimmers to international athletes, this famous river has long been a favourite. But it was the Victorian era that saw the birth of organised river racing with the launch of the long distance amateur championship of Great Britain.\r\n\r\nSoon floating baths were built in London; people swam at official bathing pools and islands at Oxford, Reading and Henley, dived off pontoons at Kingston and played at temporary lidos in Richmond. By the 1930s the Thames had become a top holiday spot for families with beaches at the Tower of London, Greenwich and Grays. Then in 1957 the river was declared biologically dead, organised racing was largely over, and swimming in the Thames was seen as dangerous.\r\n\r\nYet today we have returned to the river in numbers not seen for a long time, some drawn by the thrill of wild swimming, others to compete in annual racing events. Now Caitlin Davies recounts the history of swimmers and the Thames, telling the stories of legends like Annette Kellerman and Matthew Webb, forgotten champions such as Agnes Beckwith and Lily Smith, as well as modern day charity swimmers and sport stars.\r\n\r\nDownstream explores the changing nature of swimmers' relationship with the river, featuring previously unpublished archive images, and asks why it is that swimmers still love the Thames","torrent":{"xt":"urn:btih:f8cea4e28534d4e780c61dd8a798dcc56d574aeb","amp;dn":"Downstream+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8cea4e28534d4e780c61dd8a798dcc56d574aeb","infoHashBuffer":{"type":"Buffer","data":[248,206,164,226,133,52,212,231,128,198,29,216,167,152,220,197,109,87,74,235]},"announce":[],"urlList":[]}}