{"title":"Atlantis Evidence Coast to Coast May 6,2016","uid":14573191,"size":28617542,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fcc761b377569a3c15fb6df1d5885ece7dbb0e7c&amp;dn=Atlantis+Evidence+Coast+to+Coast+May+6%2C2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1462825141,"description":"Coast to Coast May 8,2016\r\n\r\nAtlantis Evidence\r\n\r\n\r\nAuthor and researcher Andrew Collins offered an intriguing hypothesis to the enduring legend of Atlantis. He argued that what Plato recounts is the memory of a major cataclysm at the end of the last Ice Age, when a comet devastated land masses in the Caribbean. Plato knew of the journeys of ancient mariners, who visited islands in the far reaches of the Atlantic, and these mariners were told by indigenous people of the catastrophic events from their distant past which tore apart their islands, he explained.\r\n\r\nFragmented parts of a comet entered into the lower atmosphere around 10,800 BC, Collins estimated, devastating the North American continent, and areas in the Atlantic ocean, with fires, super tsunamis, and great floods. Rather than the destruction happening within a short time frame, Collins believes it took place over a period of several hundred years. &quot;All of the evidence suggests that Cuba is the main location of Atlantis,&quot; and was once part of a greater land mass connected to the Bahamas, he cited. There are sunken ruins off the coasts of both Cuba and the Bahamas, ancient complexes spanning more than 10 acres that indicate a lost civilization, urban development and planned road systems, he reported","torrent":{"xt":"urn:btih:fcc761b377569a3c15fb6df1d5885ece7dbb0e7c","amp;dn":"Atlantis+Evidence+Coast+to+Coast+May+6%2C2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcc761b377569a3c15fb6df1d5885ece7dbb0e7c","infoHashBuffer":{"type":"Buffer","data":[252,199,97,179,119,86,154,60,21,251,109,241,213,136,94,206,125,187,14,124]},"announce":[],"urlList":[]}}